<FONT class=extract>&#12304;&#35268;&#21017;1&#12305;&#29992;malloc&#25110;new&#30003;&#35831;&#20869;&#23384;&#20043;&#21518;&#65292;&#24212;&#35813;&#31435;&#21363;&#26816;&#26597;&#25351;&#38024;&#20540;&#26159;&#21542;&#20026;NULL&#12290;&#38450;&#27490;&#20351;&#29992;&#25351;&#38024;&#20540;&#20026;NULL&#30340;&#20869;&#23384;&#12290; </FONT>
<P></P>
<P><FONT class=extract>&#12304;&#35268;&#21017;2&#12305;&#19981;&#35201;&#24536;&#35760;&#20026;&#25968;&#32452;&#21644;&#21160;&#24577;&#20869;&#23384;&#36171;&#21021;&#20540;&#12290;&#38450;&#27490;&#23558;&#26410;&#34987;&#21021;&#22987;&#21270;&#30340;&#20869;&#23384;&#20316;&#20026;&#21491;&#20540;&#20351;&#29992;&#12290; </FONT></P>
<P><FONT class=extract>&#12304;&#35268;&#21017;3&#12305;&#36991;&#20813;&#25968;&#32452;&#25110;&#25351;&#38024;&#30340;&#19979;&#26631;&#36234;&#30028;&#65292;&#29305;&#21035;&#35201;&#24403;&#24515;&#21457;&#29983;&#8220;&#22810;1&#8221;&#25110;&#32773;&#8220;&#23569;1&#8221;&#25805;&#20316;&#12290; </FONT></P>
<P><FONT class=extract>&#12304;&#35268;&#21017;4&#12305;&#21160;&#24577;&#20869;&#23384;&#30340;&#30003;&#35831;&#19982;&#37322;&#25918;&#24517;&#39035;&#37197;&#23545;&#65292;&#38450;&#27490;&#20869;&#23384;&#27844;&#28431;&#12290; </FONT></P>
<P><FONT class=extract>&#12304;&#35268;&#21017;5&#12305;&#29992;free&#25110;delete&#37322;&#25918;&#20102;&#20869;&#23384;&#20043;&#21518;&#65292;&#31435;&#21363;&#23558;&#25351;&#38024;&#35774;&#32622;&#20026;NULL&#65292;&#38450;&#27490;&#20135;&#29983;&#8220;&#37326;&#25351;&#38024;&#8221;&#12290;</FONT></P>
<P>&nbsp;</P>
<P>&#24120;&#35265;&#30340;&#20869;&#23384;&#38169;&#35823;&#21450;&#20854;&#23545;&#31574;&#22914;&#19979;&#65306; </P>
<P>1. <FONT class=extract>&#20869;&#23384;&#20998;&#37197;&#26410;&#25104;&#21151;&#65292;&#21364;&#20351;&#29992;&#20102;&#23427;&#12290;&#32534;&#31243;&#26032;&#25163;&#24120;&#29359;&#36825;&#31181;&#38169;&#35823;&#65292;&#22240;&#20026;&#20182;&#20204;&#27809;&#26377;&#24847;&#35782;&#21040;&#20869;&#23384;&#20998;&#37197;&#20250;&#19981;&#25104;&#21151;&#12290;&#24120;&#29992;&#35299;&#20915;&#21150;&#27861;&#26159;&#65292;&#22312;&#20351;&#29992;&#20869;&#23384;&#20043;&#21069;&#26816;&#26597;&#25351;&#38024;&#26159;&#21542;&#20026;NULL&#12290;&#22914;&#26524;&#25351;&#38024;p&#26159;&#20989;&#25968;&#30340;&#21442;&#25968;&#65292;&#37027;&#20040;&#22312;&#20989;&#25968;&#30340;&#20837;&#21475;&#22788;&#29992;assert(p!=NULL)&#36827;&#34892;&#26816;&#26597;&#12290;&#22914;&#26524;&#26159;&#29992;malloc&#25110;new&#26469;&#30003;&#35831;&#20869;&#23384;&#65292;&#24212;&#35813;&#29992;if(p==NULL) &#25110;if(p!=NULL)&#36827;&#34892;&#38450;&#38169;&#22788;&#29702;&#12290;</FONT> </P>
<P>2. &#20869;&#23384;&#20998;&#37197;&#34429;&#28982;&#25104;&#21151;&#65292;&#20294;&#26159;&#23578;&#26410;&#21021;&#22987;&#21270;&#23601;&#24341;&#29992;&#23427;&#12290;&#29359;&#36825;&#31181;&#38169;&#35823;&#20027;&#35201;&#26377;&#20004;&#20010;&#36215;&#22240;&#65306;&#19968;&#26159;&#27809;&#26377;&#21021;&#22987;&#21270;&#30340;&#35266;&#24565;&#65307;&#20108;&#26159;&#35823;&#20197;&#20026;&#20869;&#23384;&#30340;&#32570;&#30465;&#21021;&#20540;&#20840;&#20026;&#38646;&#65292;&#23548;&#33268;&#24341;&#29992;&#21021;&#20540;&#38169;&#35823;&#65288;&#20363;&#22914;&#25968;&#32452;&#65289;&#12290;&#20869;&#23384;&#30340;&#32570;&#30465;&#21021;&#20540;&#31350;&#31455;&#26159;&#20160;&#20040;&#24182;&#27809;&#26377;&#32479;&#19968;&#30340;&#26631;&#20934;&#65292;&#23613;&#31649;&#26377;&#20123;&#26102;&#20505;&#20026;&#38646;&#20540;&#65292;&#25105;&#20204;&#23425;&#21487;&#20449;&#20854;&#26080;&#19981;&#21487;&#20449;&#20854;&#26377;&#12290;&#25152;&#20197;&#26080;&#35770;&#29992;&#20309;&#31181;&#26041;&#24335;&#21019;&#24314;&#25968;&#32452;&#65292;&#37117;&#21035;&#24536;&#20102;&#36171;&#21021;&#20540;&#65292;&#21363;&#20415;&#26159;&#36171;&#38646;&#20540;&#20063;&#19981;&#21487;&#30465;&#30053;&#65292;&#19981;&#35201;&#23244;&#40635;&#28902;&#12290; </P>
<P>3. &#20869;&#23384;&#20998;&#37197;&#25104;&#21151;&#24182;&#19988;&#24050;&#32463;&#21021;&#22987;&#21270;&#65292;&#20294;&#25805;&#20316;&#36234;&#36807;&#20102;&#20869;&#23384;&#30340;&#36793;&#30028;&#12290;&#20363;&#22914;&#22312;&#20351;&#29992;&#25968;&#32452;&#26102;&#32463;&#24120;&#21457;&#29983;&#19979;&#26631;&#8220;&#22810;1&#8221;&#25110;&#32773;&#8220;&#23569;1&#8221;&#30340;&#25805;&#20316;&#12290;&#29305;&#21035;&#26159;&#22312;for&#24490;&#29615;&#35821;&#21477;&#20013;&#65292;&#24490;&#29615;&#27425;&#25968;&#24456;&#23481;&#26131;&#25630;&#38169;&#65292;&#23548;&#33268;&#25968;&#32452;&#25805;&#20316;&#36234;&#30028;&#12290; </P>
<P>4. &#24536;&#35760;&#20102;&#37322;&#25918;&#20869;&#23384;&#65292;&#36896;&#25104;&#20869;&#23384;&#27844;&#38706;&#12290;&#21547;&#26377;&#36825;&#31181;&#38169;&#35823;&#30340;&#20989;&#25968;&#27599;&#34987;&#35843;&#29992;&#19968;&#27425;&#23601;&#20002;&#22833;&#19968;&#22359;&#20869;&#23384;&#12290;&#21018;&#24320;&#22987;&#26102;&#31995;&#32479;&#30340;&#20869;&#23384;&#20805;&#36275;&#65292;&#20320;&#30475;&#19981;&#21040;&#38169;&#35823;&#12290;&#32456;&#26377;&#19968;&#27425;&#31243;&#24207;&#31361;&#28982;&#27515;&#25481;&#65292;&#31995;&#32479;&#20986;&#29616;&#25552;&#31034;&#65306;&#20869;&#23384;&#32791;&#23613;&#12290;&#21160;&#24577;&#20869;&#23384;&#30340;&#30003;&#35831;&#19982;&#37322;&#25918;&#24517;&#39035;&#37197;&#23545;&#65292;&#31243;&#24207;&#20013;malloc&#19982;free&#30340;&#20351;&#29992;&#27425;&#25968;&#19968;&#23450;&#35201;&#30456;&#21516;&#65292;&#21542;&#21017;&#32943;&#23450;&#26377;&#38169;&#35823;&#65288;new/delete&#21516;&#29702;&#65289;&#12290; </P>
<P>5. &#37322;&#25918;&#20102;&#20869;&#23384;&#21364;&#32487;&#32493;&#20351;&#29992;&#23427;&#12290;&#26377;&#19977;&#31181;&#24773;&#20917;&#65306;&#65288;1&#65289;&#31243;&#24207;&#20013;&#30340;&#23545;&#35937;&#35843;&#29992;&#20851;&#31995;&#36807;&#20110;&#22797;&#26434;&#65292;&#23454;&#22312;&#38590;&#20197;&#25630;&#28165;&#26970;&#26576;&#20010;&#23545;&#35937;&#31350;&#31455;&#26159;&#21542;&#24050;&#32463;&#37322;&#25918;&#20102;&#20869;&#23384;&#65292;&#27492;&#26102;&#24212;&#35813;&#37325;&#26032;&#35774;&#35745;&#25968;&#25454;&#32467;&#26500;&#65292;&#20174;&#26681;&#26412;&#19978;&#35299;&#20915;&#23545;&#35937;&#31649;&#29702;&#30340;&#28151;&#20081;&#23616;&#38754;&#12290;&#65288;2&#65289;&#20989;&#25968;&#30340;return&#35821;&#21477;&#20889;&#38169;&#20102;&#65292;&#27880;&#24847;&#19981;&#35201;&#36820;&#22238;&#25351;&#21521;&#8220;&#26632;&#20869;&#23384;&#8221;&#30340;&#8220;&#25351;&#38024;&#8221;&#25110;&#32773;&#8220;&#24341;&#29992;&#8221;&#65292;&#22240;&#20026;&#35813;&#20869;&#23384;&#22312;&#20989;&#25968;&#20307;&#32467;&#26463;&#26102;&#34987;&#33258;&#21160;&#38144;&#27585;&#12290;&#65288;3&#65289;&#20351;&#29992;free&#25110;delete&#37322;&#25918;&#20102;&#20869;&#23384;&#21518;&#65292;&#27809;&#26377;&#23558;&#25351;&#38024;&#35774;&#32622;&#20026;NULL&#12290;&#23548;&#33268;&#20135;&#29983;&#8220;&#37326;&#25351;&#38024;<SPAN style="COLOR: #454545; FONT-FAMILY: '&#24494;&#36719;&#38597;&#40657;','sans-serif'; mso-bidi-font-size: 10.5pt; mso-bidi-font-family: &#23435;&#20307;; mso-font-kerning: 0pt"><FONT size=3>&#8221;<SPAN lang=EN-US></SPAN></FONT></SPAN>