&#19968;&#20010;&#30001;c/C++&#32534;&#35793;&#30340;&#31243;&#24207;&#21344;&#29992;&#30340;&#20869;&#23384;&#20998;&#20026;&#20197;&#19979;&#20960;&#20010;&#37096;&#20998;&#65306;</P>
<P>&nbsp;1&#12289;&#26632;&#21306;&#65288;stack&#65289;&#8212; &#30001;&#32534;&#35793;&#22120;&#33258;&#21160;&#20998;&#37197;&#37322;&#25918;&#65292;&#23384;&#25918;&#20989;&#25968;&#30340;&#21442;&#25968;&#20540;&#65292;&#23616;&#37096;&#21464;&#37327;&#30340;&#20540;&#31561;&#12290;&#20854;&#25805;&#20316;&#26041;&#24335;&#31867;&#20284;&#20110;&#25968;&#25454;&#32467;&#26500;&#20013;&#30340;&#26632;&#12290; </P>
<P>2&#12289;&#22534;&#21306;&#65288;heap&#65289; &#8212; &#19968;&#33324;&#30001;&#31243;&#24207;&#21592;&#20998;&#37197;&#37322;&#25918;&#65292; &#33509;&#31243;&#24207;&#21592;&#19981;&#37322;&#25918;&#65292;&#31243;&#24207;&#32467;&#26463;&#26102;&#21487;&#33021;&#30001;OS&#22238;&#25910; &#12290;&#27880;&#24847;&#23427;&#19982;&#25968;&#25454;&#32467;&#26500;&#20013;&#30340;&#22534;&#26159;&#20004;&#22238;&#20107;&#65292;&#20998;&#37197;&#26041;&#24335;&#20498;&#26159;&#31867;&#20284;&#20110;&#38142;&#34920;&#12290; </P>
<P>3&#12289;&#20840;&#23616;&#21306;&#65288;&#38745;&#24577;&#21306;&#65289;&#65288;static&#65289;&#8212;&#65292;&#20840;&#23616;&#21464;&#37327;&#21644;&#38745;&#24577;&#21464;&#37327;&#30340;&#23384;&#20648;&#26159;&#25918;&#22312;&#19968;&#22359;&#30340;&#65292;&#21021;&#22987;&#21270;&#30340;&#20840;&#23616;&#21464;&#37327;&#21644;&#38745;&#24577;&#21464;&#37327;&#22312;&#19968;&#22359;&#21306;&#22495;(.data)&#65292;&#26410;&#21021;&#22987;&#21270;&#30340;&#20840;&#23616;&#21464;&#37327;&#21644;&#26410;&#21021;&#22987;&#21270;&#30340;&#38745;&#24577;&#21464;&#37327;&#22312;&#30456;&#37051;&#30340;&#21478;&#19968;&#22359;&#21306;&#22495;(.bss)&#12290; - &#31243;&#24207;&#32467;&#26463;&#21518;&#30001;&#31995;&#32479;&#37322;&#25918;&#12290; </P>
<P>4&#12289;&#25991;&#23383;&#24120;&#37327;&#21306; &#8212;&#24120;&#37327;&#23383;&#31526;&#20018;&#23601;&#26159;&#25918;&#22312;&#36825;&#37324;&#30340;(.rodata)&#12290; &#31243;&#24207;&#32467;&#26463;&#21518;&#30001;&#31995;&#32479;&#37322;&#25918;&#12290; </P>
<P>5&#12289;&#31243;&#24207;&#20195;&#30721;&#21306;&#8212;&#23384;&#25918;&#20989;&#25968;&#20307;&#30340;&#20108;&#36827;&#21046;&#20195;&#30721;(.text)&#12290; </P>
<P>//main.cpp </P>
<P>int a = 0; // &#20840;&#23616;&#21021;&#22987;&#21270;&#21306; </P>
<P>char *p1; // &#20840;&#23616;&#26410;&#21021;&#22987;&#21270;&#21306; </P>
<P>main() { </P>
<P>int b; // &#26632;&#21306; </P>
<P>char s[] = "abc"; // &#26632;&#21306; </P>
<P>char *p2; // &#26632;&#21306; </P>
<P>char *p3 = "123456"; // "123456/0" &#22312;&#24120;&#37327;&#21306;&#65292;p3&#22312;&#26632;&#21306; </P>
<P>static int c =0; // &#20840;&#23616;&#65288;&#38745;&#24577;&#65289;&#21021;&#22987;&#21270;&#21306; </P>
<P>p1 = (char *)malloc(10); p2 = (char *)malloc(20); // &#20998;&#37197;&#24471;&#26469;&#30340;10&#21644;20&#23383;&#33410;&#30340;&#21306;&#22495;&#23601;&#22312;&#22534;&#21306; </P>
<P>strcpy(p1, "123456"); // "123456/0" &#25918;&#22312;&#24120;&#37327;&#21306;&#65292;&#32534;&#35793;&#22120;&#21487;&#33021;&#20250;&#23558;&#23427; // &#19982;p3&#25152;&#25351;&#21521;&#30340;"123456"&#20248;&#21270;&#25104;&#19968;&#20010;&#22320;&#26041;&#12290; </P>
<P>} </P>
<P>1.&#30003;&#35831;&#21518;&#31995;&#32479;&#30340;&#21709;&#24212;&#26632;&#65306;&#21482;&#35201;&#26632;&#30340;&#21097;&#20313;&#31354;&#38388;&#22823;&#20110;&#25152;&#30003;&#35831;&#31354;&#38388;&#65292;&#31995;&#32479;&#23558;&#20026;&#31243;&#24207;&#25552;&#20379;&#20869;&#23384;&#65292;&#21542;&#21017;&#23558;&#25253;&#24322;&#24120;&#25552;&#31034;&#26632;&#28322;&#20986;&#12290;&#22534;&#65306;&#39318;&#20808;&#24212;&#35813;&#30693;&#36947;&#25805;&#20316;&#31995;&#32479;&#26377;&#19968;&#20010;&#35760;&#24405;&#31354;&#38386;&#20869;&#23384;&#22320;&#22336;&#30340;&#38142;&#34920;&#65292;&#24403;&#31995;&#32479;&#25910;&#21040;&#31243;&#24207;&#30340;&#30003;&#35831;&#26102;&#65292;&#20250;&#36941;&#21382;&#35813;&#38142;&#34920;&#65292;&#23547;&#25214;&#31532;&#19968;&#20010;&#31354;&#38388;&#22823;&#20110;&#25152;&#30003;&#35831;&#31354;&#38388;&#30340;&#22534;&#32467;&#28857;&#65292;&#28982;&#21518;&#23558;&#35813;&#32467;&#28857;&#20174;&#31354;&#38386;&#32467;&#28857;&#38142;&#34920;&#20013;&#21024;&#38500;&#65292;&#24182;&#23558;&#35813;&#32467;&#28857;&#30340;&#31354;&#38388;&#20998;&#37197;&#32473;&#31243;&#24207;&#65292;&#21478;&#22806;&#65292;&#23545;&#20110;&#22823;&#22810;&#25968;&#31995;&#32479;&#65292;&#20250;&#22312;&#36825;&#22359;&#20869;&#23384;&#31354;&#38388;&#20013;&#30340;&#39318;&#22320;&#22336;&#22788;&#35760;&#24405;&#26412;&#27425;&#20998;&#37197;&#30340;&#22823;&#23567;&#65292;&#36825;&#26679;&#65292;&#20195;&#30721;&#20013;&#30340; delete&#35821;&#21477;&#25165;&#33021;&#27491;&#30830;&#30340;&#37322;&#25918;&#26412;&#20869;&#23384;&#31354;&#38388;&#12290;&#21478;&#22806;&#65292;&#30001;&#20110;&#25214;&#21040;&#30340;&#22534;&#32467;&#28857;&#30340;&#22823;&#23567;&#19981;&#19968;&#23450;&#27491;&#22909;&#31561;&#20110;&#30003;&#35831;&#30340;&#22823;&#23567;&#65292;&#31995;&#32479;&#20250;&#33258;&#21160;&#30340;&#23558;&#22810;&#20313;&#30340;&#37027;&#37096;&#20998;&#37325;&#26032;&#25918;&#20837;&#31354;&#38386;&#38142;&#34920;&#20013;&#12290; &#20063;&#23601;&#26159;&#35828;&#22534;&#20250;&#22312;&#30003;&#35831;&#21518;&#36824;&#35201;&#20570;&#19968;&#20123;&#21518;&#32493;&#30340;&#24037;&#20316;&#36825;&#23601;&#20250;&#24341;&#20986;&#30003;&#35831;&#25928;&#29575;&#30340;&#38382;&#39064;&#12290; </P>
<P>2.&#30003;&#35831;&#25928;&#29575;&#30340;&#27604;&#36739;&#26681;&#25454;&#31532;0&#28857;&#21644;&#31532;1&#28857;&#21487;&#30693;&#12290;&#26632;&#65306;&#30001;&#31995;&#32479;&#33258;&#21160;&#20998;&#37197;&#65292;&#36895;&#24230;&#36739;&#24555;&#12290;&#20294;&#31243;&#24207;&#21592;&#26159;&#26080;&#27861;&#25511;&#21046;&#30340;&#12290;&#22534;&#65306;&#26159;&#30001;new&#20998;&#37197;&#30340;&#20869;&#23384;&#65292;&#19968;&#33324;&#36895;&#24230;&#27604;&#36739;&#24930;&#65292;&#32780;&#19988;&#23481;&#26131;&#20135;&#29983;&#20869;&#23384;&#30862;&#29255;,&#19981;&#36807;&#29992;&#36215;&#26469;&#26368;&#26041;&#20415;&#12290; </P>
<P>3.&#30003;&#35831;&#22823;&#23567;&#30340;&#38480;&#21046;&#26632;&#65306;&#22312;Windows&#19979;,&#26632;&#26159;&#21521;&#20302;&#22320;&#22336;&#25193;&#23637;&#30340;&#25968;&#25454;&#32467;&#26500;&#65292;&#26159;&#19968;&#22359;&#36830;&#32493;&#30340;&#20869;&#23384;&#30340;&#21306;&#22495;&#12290;&#36825;&#21477;&#35805;&#30340;&#24847;&#24605;&#26159;&#26632;&#39030;&#30340;&#22320;&#22336;&#21644;&#26632;&#30340;&#26368;&#22823;&#23481;&#37327;&#26159;&#31995;&#32479;&#39044;&#20808;&#35268;&#23450;&#22909;&#30340;&#65292;&#22312; WINDOWS&#19979;&#65292;&#26632;&#30340;&#22823;&#23567;&#26159;2M&#65288;&#20063;&#26377;&#30340;&#35828;&#26159;1M&#65292;&#24635;&#20043;&#26159;&#19968;&#20010;&#32534;&#35793;&#26102;&#23601;&#30830;&#23450;&#30340;&#24120;&#25968;&#65289;&#65292;&#22914;&#26524;&#30003;&#35831;&#30340;&#31354;&#38388;&#36229;&#36807;&#26632;&#30340;&#21097;&#20313;&#31354;&#38388;&#26102;&#65292;&#23558;&#25552;&#31034;overflow&#12290;&#22240;&#27492;&#65292;&#33021;&#20174;&#26632;&#33719;&#24471;&#30340;&#31354;&#38388;&#36739;&#23567;&#12290; &#22534;&#65306;&#22534;&#26159;&#21521;&#39640;&#22320;&#22336;&#25193;&#23637;&#30340;&#25968;&#25454;&#32467;&#26500;&#65292;&#26159;&#19981;&#36830;&#32493;&#30340;&#20869;&#23384;&#21306;&#22495;&#12290;&#36825;&#26159;&#30001;&#20110;&#31995;&#32479;&#26159;&#29992;&#38142;&#34920;&#26469;&#23384;&#20648;&#30340;&#31354;&#38386;&#20869;&#23384;&#22320;&#22336;&#30340;&#65292;&#33258;&#28982;&#26159;&#19981;&#36830;&#32493;&#30340;&#65292;&#32780;&#38142;&#34920;&#30340;&#36941;&#21382;&#26041;&#21521;&#26159;&#30001;&#20302;&#22320;&#22336;&#21521;&#39640;&#22320;&#22336;&#12290;&#22534;&#30340;&#22823;&#23567;&#21463;&#38480;&#20110;&#35745;&#31639;&#26426;&#31995;&#32479;&#20013;&#26377;&#25928;&#30340;&#34394;&#25311;&#20869;&#23384;&#12290;&#30001;&#27492;&#21487;&#35265;&#65292;&#22534;&#33719;&#24471;&#30340;&#31354;&#38388;&#27604;&#36739;&#28789;&#27963;&#65292;&#20063;&#27604;&#36739;&#22823;&#12290; </P>
<P>4.&#22534;&#21644;&#26632;&#20013;&#30340;&#23384;&#20648;&#20869;&#23481;&#30001;&#20110;&#26632;&#30340;&#22823;&#23567;&#26377;&#38480;&#65292;&#25152;&#20197;&#29992;&#23376;&#20989;&#25968;&#36824;&#26159;&#26377;&#29289;&#29702;&#24847;&#20041;&#30340;&#65292;&#32780;&#19981;&#20165;&#20165;&#26159;&#36923;&#36753;&#24847;&#20041;&#12290;&#26632;&#65306; &#22312;&#20989;&#25968;&#35843;&#29992;&#26102;&#65292;&#31532;&#19968;&#20010;&#36827;&#26632;&#30340;&#26159;&#20027;&#20989;&#25968;&#20013;&#20989;&#25968;&#35843;&#29992;&#21518;&#30340;&#19979;&#19968;&#26465;&#25351;&#20196;&#65288;&#20989;&#25968;&#35843;&#29992;&#35821;&#21477;&#30340;&#19979;&#19968;&#26465;&#21487;&#25191;&#34892;&#35821;&#21477;&#65289;&#30340;&#22320;&#22336;&#65292;&#28982;&#21518;&#26159;&#20989;&#25968;&#30340;&#21508;&#20010;&#21442;&#25968;&#65292;&#22312;&#22823;&#22810;&#25968;&#30340;C&#32534;&#35793;&#22120;&#20013;&#65292;&#21442;&#25968;&#26159;&#30001;&#21491;&#24448;&#24038;&#20837;&#26632;&#30340;&#65292;&#28982;&#21518;&#26159;&#20989;&#25968;&#20013;&#30340;&#23616;&#37096;&#21464;&#37327;&#12290;&#27880;&#24847;&#38745;&#24577;&#21464;&#37327;&#26159;&#19981;&#20837;&#26632;&#30340;&#12290; &#24403;&#26412;&#27425;&#20989;&#25968;&#35843;&#29992;&#32467;&#26463;&#21518;&#65292;&#23616;&#37096;&#21464;&#37327;&#20808;&#20986;&#26632;&#65292;&#28982;&#21518;&#26159;&#21442;&#25968;&#65292;&#26368;&#21518;&#26632;&#39030;&#25351;&#38024;&#25351;&#21521;&#26368;&#24320;&#22987;&#23384;&#30340;&#22320;&#22336;&#65292;&#20063;&#23601;&#26159;&#20027;&#20989;&#25968;&#20013;&#30340;&#19979;&#19968;&#26465;&#25351;&#20196;&#65292;&#31243;&#24207;&#30001;&#35813;&#28857;&#32487;&#32493;&#36816;&#34892;&#12290; &#22534;&#65306;&#19968;&#33324;&#26159;&#22312;&#22534;&#30340;&#22836;&#37096;&#29992;&#19968;&#20010;&#23383;&#33410;&#23384;&#25918;&#22534;&#30340;&#22823;&#23567;&#12290;&#22534;&#20013;&#30340;&#20855;&#20307;&#20869;&#23481;&#26377;&#31243;&#24207;&#21592;&#23433;&#25490;&#12290; </P>
<P>5.&#23384;&#21462;&#25928;&#29575;&#30340;&#27604;&#36739; char s1[] = "aaaaaaaaaaaaaaa"; char *s2 = "bbbbbbbbbbbbbbbbb"; aaaaaaaaaaa&#26159;&#22312;&#36816;&#34892;&#26102;&#21051;&#36171;&#20540;&#30340;&#65307;&#25918;&#22312;&#26632;&#20013;&#12290; &#32780;bbbbbbbbbbb&#26159;&#22312;&#32534;&#35793;&#26102;&#23601;&#30830;&#23450;&#30340;&#65307;&#25918;&#22312;&#22534;&#20013;&#12290; &#20294;&#26159;&#65292;&#22312;&#20197;&#21518;&#30340;&#23384;&#21462;&#20013;&#65292;&#22312;&#26632;&#19978;&#30340;&#25968;&#32452;&#27604;&#25351;&#38024;&#25152;&#25351;&#21521;&#30340;&#23383;&#31526;&#20018;(&#20363;&#22914;&#22534;)&#24555;&#12290; &#27604;&#22914;&#65306; </P>
<P>#include </P>
<P>void main() </P>
<P>{ </P>
<P>char a = 1; </P>
<P>char c[] = "1234567890"; </P>
<P>char *p ="1234567890"; </P>
<P>a = c[1]; </P>
<P>a = p[1]; </P>
<P>return; </P>
<P>} </P>
<P>&#23545;&#24212;&#30340;&#27719;&#32534;&#20195;&#30721; </P>
<P>10: </P>
<P>a = c[1]; </P>
<P>00401067 8A 4D F1 mov cl,byte ptr [ebp-0Fh] </P>
<P>0040106A 88 4D FC mov byte ptr [ebp-4],cl 11: a = p[1]; </P>
<P>0040106D 8B 55 EC mov edx,dword ptr [ebp-14h] </P>
<P>00401070 8A 42 01 mov al,byte ptr [edx+1] </P>
<P>00401073 88 45 FC mov byte ptr [ebp-4],al </P>
<P>&#20851;&#20110;&#22534;&#21644;&#26632;&#21306;&#21035;&#30340;&#27604;&#21947;&#22534;&#21644;&#26632;&#30340;&#21306;&#21035;&#21487;&#20197;&#24341;&#29992;&#19968;&#20301;&#21069;&#36744;&#30340;&#27604;&#21947;&#26469;&#30475;&#20986;&#65306; &#20351;&#29992;&#26632;&#23601;&#35937;&#25105;&#20204;&#21435;&#39277;&#39302;&#37324;&#21507;&#39277;&#65292;&#21482;&#31649;&#28857;&#33756;&#65288;&#21457;&#20986;&#30003;&#35831;&#65289;&#12289;&#20184;&#38065;&#12289;&#21644;&#21507;&#65288;&#20351;&#29992;&#65289;&#65292;&#21507;&#39281;&#20102;&#23601;&#36208;&#65292;&#19981;&#24517;&#29702;&#20250;&#20999;&#33756;&#12289;&#27927;&#33756;&#31561;&#20934;&#22791;&#24037;&#20316;&#21644;&#27927;&#30871;&#12289;&#21047;&#38149;&#31561;&#25195;&#23614;&#24037;&#20316;&#65292;&#20182;&#30340;&#22909;&#22788;&#26159;&#24555;&#25463;&#65292;&#20294;&#26159;&#33258;&#30001;&#24230;&#23567;&#12290; &#20351;&#29992;&#22534;&#23601;&#35937;&#26159;&#33258;&#24049;&#21160;&#25163;&#20570;&#21916;&#27426;&#21507;&#30340;&#33756;&#32948;&#65292;&#27604;&#36739;&#40635;&#28902;&#65292;&#20294;&#26159;&#27604;&#36739;&#31526;&#21512;&#33258;&#24049;&#30340;&#21475;&#21619;&#65292;&#32780;&#19988;&#33258;&#30001;&#24230;&#22823;&#12290;&#27604;&#21947;&#24456;&#24418;&#35937;&#65292;&#35828;&#30340;&#24456;&#36890;&#20439;&#26131;&#25026;&#65292;&#19981;&#30693;&#36947;&#20320;&#26159;&#21542;&#26377;&#28857;&#25910;&#33719;<SPAN style="FONT-FAMILY: '&#24494;&#36719;&#38597;&#40657;','sans-serif'; COLOR: black; mso-bidi-font-family: &#23435;&#20307;; mso-bidi-font-size: 10.5pt; mso-font-kerning: 0pt"><FONT size=3>&#12290;<SPAN lang=EN-US></SPAN></FONT></SPAN>