<DIV>&#20316;&#32773;&#65306;&#27264;&#20449;&#20171;<BR>&#38142;&#25509;&#65306;https://www.zhihu.com/question/20736019/answer/150335497<BR>&#26469;&#28304;&#65306;&#30693;&#20046;<BR>&#33879;&#20316;&#26435;&#24402;&#20316;&#32773;&#25152;&#26377;&#65292;&#36716;&#36733;&#35831;&#32852;&#31995;&#20316;&#32773;&#33719;&#24471;&#25480;&#26435;&#12290;<BR><BR>
<DIV>1&#12289;&#30333;&#27827;&#22812;&#33337;&#65288;&#12375;&#12425;&#12363;&#12431;&#12424;&#12405;&#12397;&#65289;&#36825;&#20010;&#25104;&#35821;&#24456;&#36866;&#21512;&#24418;&#23481;<A class=member_mention href="about://www.zhihu.com/people/fa9e692fb44d7a921023371bbebad57c" data-hovercard="p$b$fa9e692fb44d7a921023371bbebad57c" data-hash="fa9e692fb44d7a921023371bbebad57c">@&#28023;&#36156;-&#29579;&#36335;&#39134;</A>&#19968;&#31867;&#30340;&#30693;&#20046;&#22823;v&#12290;&#24418;&#23481;&#35773;&#21050;&#37027;&#20123;&#33258;&#24049;&#20160;&#20040;&#37117;&#27809;&#20570;&#36807;&#12289;&#27809;&#21548;&#36807;&#65292;&#21364;&#20266;&#36896;&#32463;&#21382;&#65292;&#35013;&#25104;&#19968;&#21103;&#20840;&#30693;&#20840;&#25026;&#12289;&#20160;&#20040;&#37117;&#20570;&#36807;&#30340;&#26679;&#23376;&#30340;&#20154;&#12290;<BR><BR>&#20986;&#20856;&#26159;&#26085;&#26412;&#30340;&#27665;&#38388;&#25925;&#20107;&#12290;&#30333;&#27827;&#26159;&#20140;&#37117;&#30340;&#19968;&#20010;&#22320;&#21517;&#65292;&#21483;&#30333;&#27827;&#21364;&#27809;&#26377;&#27827;&#65292;&#26159;&#20010;&#38470;&#22320;&#26449;&#33853;&#12290;&#26377;&#20010;&#27743;&#25143;&#20154;&#21521;&#20154;&#21561;&#22040;&#33258;&#24049;&#19978;&#27931;&#21435;&#36807;&#20140;&#37117;&#12290;&#26377;&#20154;&#36136;&#30097;&#20182;&#12300;&#20320;&#21435;&#20140;&#37117;&#36335;&#19978;&#36335;&#36807;&#30333;&#27827;&#20102;&#20040;&#65311;&#37027;&#37324;&#26159;&#20160;&#20040;&#26679;&#23376;&#65311;&#12301;&#37027;&#20010;&#20154;&#12300;&#21435;&#20102;&#65292;&#21435;&#20102;&#65292;&#36335;&#36807;&#30333;&#27827;&#21018;&#22909;&#26159;&#26202;&#19978;&#65292;&#25105;&#22312;&#33337;&#19978;&#30561;&#35273;&#65292;&#25152;&#20197;&#20063;&#27809;&#30475;&#21040;&#26159;&#20160;&#20040;&#26679;&#23376;&#12290;&#12301;<BR><BR>2&#12289;&#19968;&#26399;&#19968;&#20250;&#65288;&#12356;&#12385;&#12372;&#12356;&#12385;&#12360;&#65289;&#24847;&#20026;&#24456;&#22810;&#38469;&#36935;&#19982;&#36994;&#36869;&#65292;&#19968;&#29983;&#21487;&#33021;&#21482;&#26377;&#19968;&#27425;&#12290;<BR><BR>&#20986;&#20856;&#33258;&#12298;&#33590;&#28271;&#32773;&#35226;&#24735;&#21313;&#36528;&#12299;&#20013;&#35760;&#36733;&#26085;&#26412;&#33590;&#36947;&#30340;&#24320;&#23665;&#31062;&#24072;&#21033;&#20241;&#23545;&#24351;&#23376;&#20204;&#30340;&#36523;&#25945;&#12300;&#36335;&#22320;&#12408;&#20837;&#12427;&#12424;&#12426;&#20986;&#12391;&#12378;&#12427;&#12414;&#12391;&#12289;<B>&#19968;&#26399;&#12395;&#19968;&#24230;&#12398;&#20250;</B>&#12398;&#12424;&#12358;&#12395;&#12289;&#20141;&#20027;&#12434;&#25964;&#30031;&#12377;&#12409;&#12375;&#12290;&#19990;&#38291;&#38609;&#35527;&#12289;&#28961;&#29992;&#20063;&#12290;&#12301;<BR><BR>3&#12289;&#24859;&#21029;&#38626;&#33510;(&#12354;&#12356;&#12409;&#12388;&#12426;&#12367;)&#65292;&#24418;&#23481;&#20146;&#20154;&#12289;&#29233;&#20154;&#31561;&#31163;&#21035;&#26102;&#30340;&#30171;&#33510;&#12290;<BR><BR>&#20986;&#20856;&#12298;&#22823;&#33324;&#28037;&#27075;&#32463;&#12299;&#65292;&#26159;&#20315;&#25945;&#30340;&#20843;&#33510;&#20043;&#19968;&#12290;<BR><BR>4&#12289;&#24746;&#26408;&#30423;&#27849;&#65288;&#12354;&#12367;&#12412;&#12367;&#12392;&#12358;&#12379;&#12435;&#65289;&#65292;&#29992;&#27861;&#31867;&#20284;&#20110;&#12300;&#29916;&#30000;&#26446;&#19979;&#12301;&#12290;<BR><BR>&#20986;&#20856;&#26159;&#26187;&#20195;&#38470;&#26426;&#30340;&#12298;&#29467;&#34382;&#34892;&#12299;&#12300;&#28212;&#19981;&#39278;&#30423;&#27849;&#27700;&#65292;&#28909;&#19981;&#24687;&#24694;&#26408;&#38452;&#12290;&#12301;<BR><BR>5&#12289;&#26376;&#19979;&#27703;&#20154;&#65288;&#12370;&#12387;&#12363;-&#12402;&#12423;&#12358;&#12376;&#12435;&#65289;&#27703;&#23601;&#26159;&#20912;&#65292;&#36825;&#20010;&#35789;&#25351;&#32532;&#32467;&#30007;&#22899;&#23035;&#32536;&#30340;&#20154;&#65292;&#31867;&#20284;&#21681;&#20204;&#35828;&#30340;&#26376;&#32769;&#12290;&#20986;&#20856;&#26159;&#12298;&#26187;&#20070; &#32034;&#32030;&#20253;&#12299;<BR><BR>6&#12289;&#26705;&#24359;&#34028;&#30690;&#65288;&#12381;&#12358;&#12371;&#12411;&#12358;&#12375;&#65289;&#24418;&#23481;&#30007;&#20154;&#26641;&#31435;&#20102;&#33258;&#24049;&#30340;&#29702;&#24819;&#65292;&#24535;&#22312;&#22235;&#26041;&#12290;&#20986;&#20856;&#26159;&#20013;&#22269;&#30340;&#12298;&#31036;&#35760;&#12299;&#65292;&#21476;&#20195;&#35832;&#20399;&#29983;&#20102;&#30007;&#23401;&#20799;&#65292;&#23601;&#20250;&#35753;&#20182;&#29992;&#26705;&#26408;&#30340;&#24339;&#34028;&#26438;&#30340;&#31661;&#30690;&#23556;&#21521;&#22235;&#26041;&#65292;&#35937;&#24449;&#22909;&#30007;&#20799;&#24535;&#22312;&#22235;&#26041;&#12290;<BR><BR>7&#12289;&#22810;&#34101;&#21402;&#20129;&#65288;&#12383;&#12382;&#12358;&#12371;&#12358;&#12412;&#12358;&#65289;&#24418;&#23481;&#38065;&#23384;&#30340;&#36234;&#22810;&#65292;&#23601;&#36234;&#20250;&#24341;&#36215;&#22823;&#30340;&#32463;&#27982;&#25439;&#22833;&#12290;&#20986;&#20856;&#12298;&#36947;&#24503;&#32463;&#12299;&#12290;<BR><BR>8&#12289;&#31406;&#29503;&#25237;&#26519;&#65288;&#12365;&#12421;&#12358;&#12360;&#12435;-&#12392;&#12358;&#12426;&#12435;&#65289;&#24418;&#23481;&#36208;&#25237;&#26080;&#36335;&#30340;&#20154;&#65292;&#23601;&#19981;&#33021;&#20877;&#25361;&#32933;&#25315;&#30246;&#20102;&#12290;&#20986;&#20856;&#12298;&#26187;&#20070; &#26446;&#20805;&#20256;&#12299;<BR><BR>9&#12289;&#38518;&#29356;&#29926;&#40335;&#65288;&#12392;&#12358;&#12369;&#12435;-&#12364;&#12369;&#12356;&#65289;&#24418;&#23481;&#37027;&#20123;&#36215;&#19981;&#21040;&#23454;&#38469;&#20316;&#29992;&#30340;&#25670;&#35774;&#12290;&#20986;&#20856;&#12298;&#37329;&#27004;&#23376;&#12299;&#12290;<BR><BR>10&#12289;&#39340;&#29275;&#35167;&#35070;&#65288;&#12400;&#12366;&#12421;&#12358;-&#12365;&#12435;&#12365;&#12423;&#65289;&#31867;&#20284;&#20110;&#21681;&#20204;&#30340;&#27792;&#29492;&#32780;&#20896;&#65292;&#24418;&#23481;&#27809;&#26377;&#23398;&#38382;&#12289;&#19981;&#30693;&#31036;&#20202;&#30340;&#20154;&#65292;&#31359;&#30340;&#20809;&#40092;&#20142;&#20029;&#12290;&#20986;&#20856;&#26159;&#38889;&#24840;&#30340;&#35799;&#12298;&#31526;&#35835;&#20070;&#22478;&#21335;&#12299;&#35799;&#12300;&#20154;&#19981;&#36890;&#21476;&#20170;&#65292; &#39532;&#29275;&#32780;&#35167;&#35070;&#12290;&#12301;<BR><BR>12&#12289;&#39135;&#21069;&#26041;&#19976;&#65288;&#12375;&#12423;&#12367;&#12380;&#12435;-&#12411;&#12358;&#12376;&#12423;&#12358;&#65289;&#36319;&#24217;&#37324;&#30340;&#26041;&#19976;&#27809;&#20851;&#31995;&#65292;&#24418;&#23481;&#39278;&#39135;&#21313;&#20998;&#35946;&#21326;&#65292;&#21507;&#39277;&#30340;&#26102;&#20505;&#65292;&#38754;&#21069;&#19968;&#19976;&#37117;&#25670;&#28385;&#20102;&#22909;&#21507;&#30340;&#12290;<BR>&#20986;&#20856;&#26159;&#12298;&#23391;&#23376; &#23613;&#24515;&#19979;&#12299;&#12300;&#39135;&#21069;&#26041;&#19976;&#65292;&#20365;&#22974;&#25968;&#30334;&#20154;&#65292;&#25105;&#24471;&#24535;&#65292;&#24343;&#20026;&#20063;&#12290;&#12301;<BR><BR>13&#12289;&#39135;&#39340;&#35299;&#22258;(&#12375;&#12423;&#12367;&#12400;&#12363;&#12356;&#12356;)&#24418;&#23481;&#26366;&#25910;&#20154;&#24681;&#24800;&#30340;&#20154;&#65292;&#22312;&#24681;&#20154;&#38519;&#20837;&#21361;&#38590;&#26102;&#20986;&#25163;&#30456;&#25937;&#12290;&#20986;&#20856;&#12298;&#21525;&#27663;&#26149;&#31179;&#12299;<BR><BR>14&#12289;&#28961;&#25105;&#22818;&#20013;(&#12416;&#12364;&#12416;&#12385;&#12421;&#12358;) &#24847;&#20026;&#65292;&#24536;&#25105;&#22320;&#27785;&#36855;&#20110;&#20160;&#20040;&#12290;&#26085;&#26412;&#21407;&#21019;&#25104;&#35821;&#65292;&#26080;&#20986;&#20856;&#12290;<BR><BR>15&#12289;&#20182;&#21147;&#26412;&#39000;&#65288;&#12383;&#12426;&#12365;-&#12411;&#12435;&#12364;&#12435;&#65289;&#24847;&#20026;&#26399;&#26395;&#20381;&#38752;&#21035;&#20154;&#30340;&#21147;&#37327;&#65292;&#32780;&#38750;&#36890;&#36807;&#33258;&#24049;&#30340;&#21162;&#21147;&#23454;&#29616;&#24895;&#26395;&#12290;&#20986;&#20856;&#26159;&#26085;&#26412;&#20315;&#25945;&#20928;&#22303;&#23447;&#32463;&#20856;&#12298;&#25945;&#34892;&#20449;&#35388;&#12299;&#65292;&#21407;&#24847;&#20026;&#20449;&#24466;&#21482;&#35201;&#23433;&#24515;&#24565;&#20315;&#65292;&#19981;&#38656;&#35201;&#33258;&#24049;&#20462;&#34892;&#65292;&#23601;&#33021;&#36890;&#36807;&#38463;&#24357;&#38464;&#20315;&#30340;&#26412;&#24895;&#24448;&#29983;&#26497;&#20048;&#19990;&#30028;&#12290;<BR><BR>16&#12289;&#19968;&#29983;&#25080;&#21629;&#65288;&#12356;&#12387;&#12375;&#12423;&#12358;&#8208;&#12369;&#12435;&#12417;&#12356;&#65289;&#36825;&#20010;&#27604;&#36739;&#20013;&#20108;&#65292;&#24847;&#24605;&#26159;&#36830;&#29983;&#21629;&#37117;&#25645;&#19978;&#65292;&#21162;&#21147;&#23436;&#25104;&#26576;&#20107;&#12290;&#26085;&#26412;&#21407;&#21019;&#25104;&#35821;&#65292;&#26080;&#20986;&#20856;&#12290;<BR><BR>17&#12289;&#20843;&#26041;&#32654;&#20154;&#65288;&#12399;&#12387;&#12413;&#12358;&#8208;&#12403;&#12376;&#12435;&#65289;&#24847;&#24605;&#26159;&#20843;&#38754;&#29618;&#29649;&#12289;&#35841;&#37117;&#19981;&#24471;&#32618;&#30340;&#20154;&#12290;&#26085;&#26412;&#21407;&#21019;&#25104;&#35821;&#65292;&#26080;&#20986;&#20856;&#12290;<BR><BR>18&#12289;&#19977;&#26085;&#22346;&#20027;(&#12415;&#12387;&#12363;&#12412;&#12358;&#12378;)&#22346;&#20027;&#26159;&#21644;&#23578;&#65292;&#21482;&#20570;&#20102;&#19977;&#22825;&#21644;&#23578;&#23601;&#36824;&#20439;&#12290;&#24418;&#23481;&#37027;&#20123;&#19977;&#20998;&#38047;&#28909;&#24230;&#30340;&#20154;&#12290;&#26085;&#26412;&#21407;&#21019;&#12290;<BR><BR>19&#12289;&#33258;&#26989;&#33258;&#24471;(&#12376;&#12372;&#12358;&#12376;&#12392;&#12367;)&#20174;&#20315;&#25945;&#20013;&#34893;&#29983;&#20986;&#65292;&#33258;&#24049;&#36896;&#19979;&#30340;&#19994;&#65292;&#33258;&#24049;&#35201;&#21507;&#37027;&#20010;&#24694;&#26524;&#12290;&#24847;&#24605;&#31867;&#20284;&#20110;&#21681;&#20204;&#30340;&#33258;&#20316;&#33258;&#21463;&#12290;&#26085;&#26412;&#21407;&#21019;&#12290;<BR><BR>20&#12289;&#34503;&#24515;&#20175;&#21475;(&#12384;&#12375;&#12435;&#12406;&#12388;&#12371;&#12358;)&#20175;&#23601;&#26159;&#20315;&#65292;&#34503;&#24515;&#20315;&#21475;&#65292;&#31867;&#20284;&#20110;&#21681;&#20204;&#30340;&#21475;&#34588;&#33145;&#21073;&#12290;&#26085;&#26412;&#21407;&#21019;&#12290;<BR><BR>21&#12289;&#26377;&#32822;&#28961;&#32822;&#65288;&#12358;&#12420;&#12416;&#12420;&#65289;&#24847;&#20026;&#21547;&#31946;&#20854;&#36766;&#65292;&#29992;&#20123;&#26377;&#30340;&#27809;&#30340;&#35828;&#36766;&#31946;&#24324;&#12290;&#26085;&#26412;&#21407;&#21019;&#12290;<BR><BR>22&#12289;&#23713;&#30446;&#20843;&#30446;&#65288;&#12362;&#12363;&#12417;&#12399;&#12385;&#12418;&#12367;&#65289;&#22260;&#26827;&#20013;&#34893;&#29983;&#20986;&#30340;&#25104;&#35821;&#65292;&#24847;&#20026;&#24403;&#23616;&#32773;&#36855;&#12289;&#26049;&#35266;&#32773;&#28165;&#12290;&#26085;&#35821;&#21407;&#21019;&#12290;</DIV></DIV>