<HEAD></HEAD>
<BODY>
<P>1) &#20840;&#23616;&#21464;&#37327;(&#22806;&#37096;&#21464;&#37327;)&#30340;&#35828;&#26126;&#20043;&#21069;&#20877;&#20896;&#20197;static &#23601;&#26500;&#25104;&#20102;&#38745;&#24577;&#30340;&#20840;&#23616;&#21464;&#37327;&#12290;&#20840;&#23616;&#21464;&#37327;&#26412;&#36523;&#23601;&#26159;&#38745;&#24577;&#23384;&#20648;&#26041;&#24335;&#65292; &#38745;&#24577;&#20840;&#23616;&#21464;&#37327;&#24403;&#28982;&#20063;&#26159;&#38745;&#24577;&#23384;&#20648;&#26041;&#24335;&#12290; &#36825;&#20004;&#32773;&#22312;&#23384;&#20648;&#26041;&#24335;&#19978;&#24182;&#26080;&#19981;&#21516;&#12290;&#36825;&#20004;&#32773;&#30340;&#21306;&#21035;&#22312;&#20110;&#38750;&#38745;&#24577;&#20840;&#23616;&#21464;&#37327;&#30340;&#20316;&#29992;&#22495;&#26159;&#25972;&#20010;&#28304;&#31243;&#24207;&#65292; &#24403;&#19968;&#20010;&#28304;&#31243;&#24207;&#30001;&#22810;&#20010;&#28304;&#25991;&#20214;&#32452;&#25104;&#26102;&#65292;&#38750;&#38745;&#24577;&#30340;&#20840;&#23616;&#21464;&#37327;&#22312;&#21508;&#20010;&#28304;&#25991;&#20214;&#20013;&#37117;&#26159;&#26377;&#25928;&#30340;&#12290; &#32780;&#38745;&#24577;&#20840;&#23616;&#21464;&#37327;&#21017;&#38480;&#21046;&#20102;&#20854;&#20316;&#29992;&#22495;&#65292; &#21363;&#21482;&#22312;&#23450;&#20041;&#35813;&#21464;&#37327;&#30340;&#28304;&#25991;&#20214;&#20869;&#26377;&#25928;&#65292; &#22312;&#21516;&#19968;&#28304;&#31243;&#24207;&#30340;&#20854;&#23427;&#28304;&#25991;&#20214;&#20013;&#19981;&#33021;&#20351;&#29992;&#23427;&#12290;&#30001;&#20110;&#38745;&#24577;&#20840;&#23616;&#21464;&#37327;&#30340;&#20316;&#29992;&#22495;&#23616;&#38480;&#20110;&#19968;&#20010;&#28304;&#25991;&#20214;&#20869;&#65292;&#21482;&#33021;&#20026;&#35813;&#28304;&#25991;&#20214;&#20869;&#30340;&#20989;&#25968;&#20844;&#29992;&#65292;&#22240;&#27492;&#21487;&#20197;&#36991;&#20813;&#22312;&#20854;&#23427;&#28304;&#25991;&#20214;&#20013;&#24341;&#36215;&#38169;&#35823;&#12290;</P>
<P>&nbsp;2) &#20174;&#20197;&#19978;&#20998;&#26512;&#21487;&#20197;&#30475;&#20986;&#65292; &#25226;&#23616;&#37096;&#21464;&#37327;&#25913;&#21464;&#20026;&#38745;&#24577;&#21464;&#37327;&#21518;&#26159;&#25913;&#21464;&#20102;&#23427;&#30340;&#23384;&#20648;&#26041;&#24335;&#21363;&#25913;&#21464;&#20102;&#23427;&#30340;&#29983;&#23384;&#26399;&#12290;&#25226;&#20840;&#23616;&#21464;&#37327;&#25913;&#21464;&#20026;&#38745;&#24577;&#21464;&#37327;&#21518;&#26159;&#25913;&#21464;&#20102;&#23427;&#30340;&#20316;&#29992;&#22495;&#65292;&#38480;&#21046;&#20102;&#23427;&#30340;&#20351;&#29992;&#33539;&#22260;&#12290;</P>
<P>3) static&#20989;&#25968;&#19982;&#26222;&#36890;&#20989;&#25968;&#20316;&#29992;&#22495;&#19981;&#21516;,&#20165;&#22312;&#26412;&#25991;&#20214;&#12290;&#21482;&#22312;&#24403;&#21069;&#28304;&#25991;&#20214;&#20013;&#20351;&#29992;&#30340;&#20989;&#25968;&#24212;&#35813;&#35828;&#26126;&#20026;&#20869;&#37096;&#20989;&#25968;(static)&#65292;&#20869;&#37096;&#20989;&#25968;&#24212;&#35813;&#22312;&#24403;&#21069;&#28304;&#25991;&#20214;&#20013;&#35828;&#26126;&#21644;&#23450;&#20041;&#12290;&#23545;&#20110;&#21487;&#22312;&#24403;&#21069;&#28304;&#25991;&#20214;&#20197;&#22806;&#20351;&#29992;&#30340;&#20989;&#25968;&#65292;&#24212;&#35813;&#22312;&#19968;&#20010;&#22836;&#25991;&#20214;&#20013;&#35828;&#26126;&#65292;&#35201;&#20351;&#29992;&#36825;&#20123;&#20989;&#25968;&#30340;&#28304;&#25991;&#20214;&#35201;&#21253;&#21547;&#36825;&#20010;&#22836;&#25991;&#20214; </P>
<P>&#12288;&#12288;&#32508;&#19978;&#25152;&#36848;: </P>
<P>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 1&#65292;static&#20840;&#23616;&#21464;&#37327;&#19982;&#26222;&#36890;&#30340;&#20840;&#23616;&#21464;&#37327;&#26377;&#20160;&#20040;&#21306;&#21035;&#65306;</P>
<P>static&#20840;&#23616;&#21464;&#37327;&#21482;&#21021;&#20351;&#21270;&#19968;&#27425;&#65288;???&#26222;&#36890;&#20840;&#23616;&#21464;&#37327;&#20063;&#24212;&#35813;&#21482;&#21021;&#22987;&#21270;&#19968;&#27425;&#21834;&#65281;&#65281;&#65281;&#65289;&#65292;&#38450;&#27490;&#22312;&#20854;&#20182;&#25991;&#20214;&#21333;&#20803;&#20013;&#34987;&#24341;&#29992;;</P>
<P>&nbsp;&#12288;&#12288;2&#65292;static&#23616;&#37096;&#21464;&#37327;&#21644;&#26222;&#36890;&#23616;&#37096;&#21464;&#37327;&#26377;&#20160;&#20040;&#21306;&#21035;&#65306; </P>
<P>static&#23616;&#37096;&#21464;&#37327;&#21482;&#34987;&#21021;&#22987;&#21270;&#19968;&#27425;&#65292;&#19979;&#19968;&#27425;&#20381;&#25454;&#19978;&#19968;&#27425;&#32467;&#26524;&#20540;&#65307;</P>
<P>&nbsp;&#12288;&#12288;3&#65292;static&#20989;&#25968;&#19982;&#26222;&#36890;&#20989;&#25968;&#26377;&#20160;&#20040;&#21306;&#21035;&#65306; </P>
<P>static&#20989;&#25968;&#22312;&#20869;&#23384;&#20013;&#21482;&#26377;&#19968;&#20221;&#65292;&#26222;&#36890;&#20989;&#25968;&#22312;&#27599;&#20010;&#34987;&#35843;&#29992;&#20013;&#32500;&#25345;&#19968;&#20221;&#25335;&#36125;&#12290;</P></BODY>