<DIV>&#12298;&#27491;&#27668;&#27468;&#12299;</DIV>
<DIV><BR>&nbsp;</DIV>
<DIV>&#20313;&#22234;&#21271;&#24237;&#65292;&#22352;&#19968;&#22303;&#23460;&#12290;&#23460;&#24191;&#20843;&#23610;&#65292;&#28145;&#21487;&#22235;&#23547;&#12290;&#21333;&#25161;&#20302;&#23567;&#65292;&#30333;&#38388;&#30701;&#31364;&#65292;&#27745;&#19979;&#32780;&#24189;&#26263;&#12290;&#24403;&#27492;&#22799;&#26085;&#65292;&#35832;&#27668;&#33795;&#28982;&#65306;&#38632;&#28518;&#22235;&#38598;&#65292;&#28014;&#21160;&#24202;&#20960;&#65292;&#26102;&#21017;&#20026;&#27700;&#27668;&#65307;&#28034;&#27877;&#21322;&#26397;&#65292;&#33976;&#27812;&#21382;&#28572;&#65292;&#26102;&#21017;&#20026;&#22303;&#27668;&#65307;&#20045;&#26228;&#26292;&#28909;&#65292;&#39118;&#36947;&#22235;&#22622;&#65292;&#26102;&#21017;&#20026;&#26085;&#27668;&#65307;&#27280;&#38452;&#34218;&#29224;&#65292;&#21161;&#38271;&#28814;&#34384;&#65292;&#26102;&#21017;&#20026;&#28779;&#27668;&#65307;&#20179;&#33104;&#23492;&#39039;&#65292;&#38472;&#38472;&#36924;&#20154;&#65292;&#26102;&#21017;&#20026;&#31859;&#27668;&#65307;&#39560;&#32937;&#26434;&#36957;&#65292;&#33125;&#33226;&#27735;&#22434;&#65292;&#26102;&#21017;&#20026;&#20154;&#27668;&#65307;&#25110;&#22282;&#28343;&#12289;&#25110;&#27585;&#23608;&#12289;&#25110;&#33104;&#40736;&#65292;&#24694;&#27668;&#26434;&#20986;&#65292;&#26102;&#21017;&#20026;&#31229;&#27668;&#12290;&#21472;&#26159;&#25968;&#27668;&#65292;&#24403;&#20043;&#32773;&#40092;&#19981;&#20026;&#21385;&#12290;&#32780;&#20104;&#20197;&#23409;&#24369;&#65292;&#20463;&#20208;&#20854;&#38388;&#65292;&#26044;&#20857;&#20108;&#24180;&#30691;&#65292;&#24184;&#32780;&#26080;&#24665;&#65292;&#26159;&#27526;&#26377;&#20859;&#33268;&#28982;&#23572;&#12290;&#28982;&#20134;&#23433;&#30693;&#25152;&#20859;&#20309;&#21705;&#65311;<B>&#23391;&#23376;&#26352;&#65306;&#12300;&#21566;&#21892;&#20859;&#21566;&#28009;&#28982;&#20043;&#27668;&#12290;&#12301;&#24444;&#27668;&#26377;&#19971;&#65292;&#21566;&#27668;&#26377;&#19968;&#65292;&#20197;&#19968;&#25932;&#19971;&#65292;&#21566;&#20309;&#24739;&#28937;&#65281;&#20917;&#28009;&#28982;&#32773;&#65292;&#20035;&#22825;&#22320;&#20043;&#27491;&#27668;&#20063;&#65292;&#20316;&#27491;&#27668;&#27468;&#19968;&#39318;&#12290;</B><BR><BR>&#22825;&#22320;&#26377;&#27491;&#27668;&#65292;&#26434;&#28982;&#36171;&#27969;&#24418;&#12290;&#19979;&#21017;&#20026;&#27827;&#23731;&#65292;&#19978;&#21017;&#20026;&#26085;&#26143;&#12290;<BR>&#20110;&#20154;&#26352;&#28009;&#28982;&#65292;&#27803;&#20046;&#22622;&#33485;&#20901;&#12290;&#30343;&#36335;&#24403;&#28165;&#22839;&#65292;&#21547;&#21644;&#21520;&#26126;&#24237;&#12290;<BR>&#26102;&#31351;&#33410;&#20035;&#35265;&#65292;&#19968;&#19968;&#22402;&#20025;&#38738;&#12290;&#22312;&#40784;&#22826;&#21490;&#31616;&#65292;&#22312;&#26187;&#33891;&#29392;&#31508;&#12290;<BR>&#22312;&#31206;&#24352;&#33391;&#26894;&#65292;&#22312;&#27721;&#33487;&#27494;&#33410;&#12290;&#20026;&#20005;&#23558;&#20891;&#22836;&#65292;&#20026;&#23879;&#20365;&#20013;&#34880;&#12290;<BR>&#20026;&#24352;&#30562;&#38451;&#40831;&#65292;&#20026;&#39068;&#24120;&#23665;&#33292;&#12290;&#25110;&#20026;&#36797;&#19996;&#24125;&#65292;&#28165;&#25805;&#21385;&#20912;&#38634;&#12290;<BR>&#25110;&#20026;&#20986;&#24072;&#34920;&#65292;&#39740;&#31070;&#27875;&#22766;&#28872;&#12290;&#25110;&#20026;&#28193;&#27743;&#26987;&#65292;&#24951;&#24936;&#21534;&#32993;&#32687;&#12290;<BR>&#25110;&#20026;&#20987;&#36156;&#31503;&#65292;&#36870;&#31446;&#22836;&#30772;&#35010;&#12290;&#26159;&#27668;&#25152;&#30917;&#31028;&#65292;&#20955;&#28872;&#19975;&#21476;&#23384;&#12290;<BR>&#24403;&#20854;&#36143;&#26085;&#26376;&#65292;&#29983;&#27515;&#23433;&#36275;&#35770;&#12290;&#22320;&#32500;&#36182;&#20197;&#31435;&#65292;&#22825;&#26609;&#36182;&#20197;&#23562;&#12290;<BR>&#19977;&#32434;&#23454;&#31995;&#21629;&#65292;&#36947;&#20041;&#20026;&#20043;&#26681;&#12290;&#21983;&#20104;&#36952;&#38451;&#20061;&#65292;&#38582;&#20063;&#23454;&#19981;&#21147;&#12290;<BR>&#26970;&#22234;&#32552;&#20854;&#20896;&#65292;&#20256;&#36710;&#36865;&#31351;&#21271;&#12290;&#40718;&#38252;&#29976;&#22914;&#39284;&#65292;&#27714;&#20043;&#19981;&#21487;&#24471;&#12290;<BR>&#38452;&#25151;&#38423;&#39740;&#28779;&#65292;&#26149;&#38498;&#38303;&#22825;&#40657;&#12290;&#29275;&#39589;&#21516;&#19968;&#30338;&#65292;&#40481;&#26646;&#20964;&#20976;&#39135;&#12290;<BR>&#19968;&#26397;&#33945;&#38654;&#38706;&#65292;&#20998;&#20316;&#27807;&#20013;&#30240;&#12290;&#22914;&#27492;&#20877;&#23506;&#26257;&#65292;&#30334;&#27828;&#33258;&#36767;&#26131;&#12290;<BR>&#21983;&#21705;&#27822;&#27955;&#22330;&#65292;&#20026;&#25105;&#23433;&#20048;&#22269;&#12290;&#23682;&#26377;&#20182;&#32554;&#24039;&#65292;&#38452;&#38451;&#19981;&#33021;&#36156;&#12290;<BR>&#39038;&#27492;&#32831;&#32831;&#22312;&#65292;&#20208;&#35270;&#28014;&#20113;&#30333;&#12290;&#24736;&#24736;&#25105;&#24515;&#24754;&#65292;&#33485;&#22825;&#26359;&#26377;&#26497;&#12290;<BR>&#21746;&#20154;&#26085;&#24050;&#36828;&#65292;&#20856;&#21009;&#22312;&#22809;&#26132;&#12290;&#39118;&#27280;&#23637;&#20070;&#35835;&#65292;&#21476;&#36947;&#29031;&#39068;&#33394;&#12290;</DIV>