&#31532;&#19968;&#27425;&#65306;&#24403;&#23427;&#26412;&#21487;&#36827;&#21462;&#26102;&#65292;&#21364;&#25925;&#20316;&#35878;&#21329;&#65307; 
<P></P>
<P><FONT class=extract>The first time when I saw her being meek that she might attain height </FONT></P>
<P>&#31532;&#20108;&#27425;&#65306;&#24403;&#23427;&#22312;&#31354;&#34394;&#26102;&#65292;&#29992;&#29233;&#27442;&#26469;&#22635;&#20805;&#65307; </P>
<P><FONT class=extract>The second time when I saw her limping before the crippled </FONT></P>
<P>&#31532;&#19977;&#27425;&#65306;&#22312;&#22256;&#38590;&#21644;&#23481;&#26131;&#20043;&#38388;&#65292;&#23427;&#36873;&#25321;&#20102;&#23481;&#26131;&#65307; </P>
<P>The third time when she was given to choose between the hard and the easy, and she chose the easy. </P>
<P>&#31532;&#22235;&#27425;&#65306;&#23427;&#29359;&#20102;&#38169;&#65292;&#21364;&#20511;&#30001;&#21035;&#20154;&#20063;&#20250;&#29359;&#38169;&#26469;&#23485;&#24944;&#33258;&#24049;&#65307; </P>
<P><FONT class=extract>The fourth time when she committed a wrong, and comforted herself that others also commit wrong </FONT></P>
<P>&#31532;&#20116;&#27425;&#65306;&#23427;&#33258;&#30001;&#36719;&#24369;&#65292;&#21364;&#25226;&#23427;&#35748;&#20026;&#26159;&#29983;&#21629;&#30340;&#22362;&#38887;&#65307; </P>
<P><FONT class=extract>The fifth time when she forbore for weakness, and attributed her patience to strength </FONT></P>
<P>&#31532;&#20845;&#27425;&#65306;&#24403;&#23427;&#37145;&#22839;&#19968;&#24352;&#19985;&#24694;&#30340;&#22068;&#33080;&#26102;&#65292;&#21364;&#19981;&#30693;&#37027;&#27491;&#26159;&#33258;&#24049;&#38754;&#20855;&#20013;&#30340;&#19968;&#21103;&#65307; </P>
<P><FONT class=extract>The sixth time when she despised the ugliness of a face, and knew not that it was one of her own masks </FONT></P>
<P>&#31532;&#19971;&#27425;&#65306;&#23427;&#20391;&#36523;&#20110;&#29983;&#27963;&#30340;&#27745;&#27877;&#20013;&#65292;&#34429;&#19981;&#29976;&#24515;&#65292;&#21364;&#21448;&#30031;&#39318;&#30031;&#23614;&#12290; </P>
<P><FONT class=extract>And the seventh time when she sang a song of praise, and deemed it a virtue.</FONT>