<FONT color=#080000 size=3 face=&#24494;&#36719;&#38597;&#40657;>1&#65292;const_cast&#25805;&#20316;&#31526;&#65306;&#21363;&#20379;&#31243;&#24207;&#35774;&#35745;&#24072;&#22312;&#29305;&#27530;&#24773;&#20917;&#19979;&#23558;&#38480;&#21046;&#20026;const&#25104;&#21592;&#20989;&#25968;&#30340;const&#23450;&#20041;&#35299;&#38500;&#65292;&#20351;&#20854;&#21487;&#20197;&#26356;&#25913;&#29305;&#23450;&#23646;&#24615;&#12290;</FONT> 
<P></P>
<P><FONT color=#080000 size=3 face=&#24494;&#36719;&#38597;&#40657;>2&#65292;dynamic_cast&#25805;&#20316;&#31526;&#65306;&#22914;&#26524;&#21551;&#21160;&#20102;&#25903;&#25345;&#36816;&#34892;&#26102;&#38388;&#31867;&#22411;&#20449;&#24687;&#65288;RTTI&#65289;&#65292;dynamic_cast&#26377;&#21161;&#20110;&#21028;&#26029;&#22312;&#36816;&#34892;&#26102;&#25152;&#25351;&#21521;&#23545;&#35937;&#30340;&#30830;&#23450;&#31867;&#22411;&#12290;&#23427;&#19982;typeid&#36816;&#31639;&#31526;&#26377;&#20851;&#65292;&#21487;&#20197;&#23558;&#19968;&#20010;&#22522;&#31867;&#30340;&#25351;&#38024;&#25351;&#21521;&#19981;&#21516;&#30340;&#23376;&#31867;&#22411;&#65288;&#27966;&#29983;&#31867;&#65289;&#65292;&#28982;&#21518;&#23558;&#34987;&#36716;&#22411;&#20316;&#20026;&#22522;&#30784;&#31867;&#30340;&#23545;&#35937;&#36824;&#21407;&#25104;&#21407;&#26469;&#30340;&#31867;&#12290;&#19981;&#36807;&#65292;&#20165;&#38480;&#20110;&#23545;&#35937;&#25351;&#38024;&#30340;&#31867;&#22411;&#36716;&#25442;&#12290;</FONT> 
<P><FONT size=2>dynamic_cast &lt; type-id &gt; ( expression )<BR>&#12288;&#12288;&#35813;&#36816;&#31639;&#31526;&#25226;expression&#36716;&#25442;&#25104;type-id&#31867;&#22411;&#30340;&#23545;&#35937;&#12290;Type-id&#24517;&#39035;&#26159;&#31867;&#30340;&#25351;&#38024;&#12289;&#31867;&#30340;&#24341;&#29992;&#25110;&#32773;void*&#65307;<BR>&#12288;&#12288;&#22914;&#26524;type-id&#26159;&#31867;&#25351;&#38024;&#31867;&#22411;&#65292;&#37027;&#20040;expression&#20063;&#24517;&#39035;&#26159;&#19968;&#20010;&#25351;&#38024;&#65292;&#22914;&#26524;type-id&#26159;&#19968;&#20010;&#24341;&#29992;&#65292;&#37027;&#20040;expression&#20063;&#24517;&#39035;&#26159;&#19968;&#20010;&#24341;&#29992;&#12290;<BR>&#12288;&#12288;dynamic_cast&#36816;&#31639;&#31526;&#21487;&#20197;&#22312;&#25191;&#34892;&#26399;&#20915;&#23450;&#30495;&#27491;&#30340;&#31867;&#22411;&#12290;&#22914;&#26524;downcast&#26159;&#23433;&#20840;&#30340;&#65288;&#20063;&#23601;&#35828;&#65292;&#22914;&#26524;&#22522;&#31867;&#25351;&#38024;&#25110;&#32773;&#24341;&#29992;&#30830;&#23454;&#25351;&#21521;&#19968;&#20010;&#27966;&#29983;&#31867;&#23545;&#35937;&#65289;&#36825;&#20010;&#36816;&#31639;&#31526;&#20250;&#20256;&#22238;&#36866;&#24403;&#36716;&#22411;&#36807;&#30340;&#25351;&#38024;&#12290;&#22914;&#26524;downcast&#19981;&#23433;&#20840;&#65292;&#36825;&#20010;&#36816;&#31639;&#31526;&#20250;&#20256;&#22238;&#31354;&#25351;&#38024;&#65288;&#20063;&#23601;&#26159;&#35828;&#65292;&#22522;&#31867;&#25351;&#38024;&#25110;&#32773;&#24341;&#29992;&#27809;&#26377;&#25351;&#21521;&#19968;&#20010;&#27966;&#29983;&#31867;&#23545;&#35937;&#65289;&#12290;<BR>&#12288;&#12288;dynamic_cast&#20027;&#35201;&#29992;&#20110;&#31867;&#23618;&#27425;&#38388;&#30340;&#19978;&#34892;&#36716;&#25442;&#21644;&#19979;&#34892;&#36716;&#25442;&#65292;&#36824;&#21487;&#20197;&#29992;&#20110;&#31867;&#20043;&#38388;&#30340;&#20132;&#21449;&#36716;&#25442;&#12290;<BR>&#12288;&#12288;&#22312;&#31867;&#23618;&#27425;&#38388;&#36827;&#34892;&#19978;&#34892;&#36716;&#25442;&#26102;&#65292;dynamic_cast&#21644;static_cast&#30340;&#25928;&#26524;&#26159;&#19968;&#26679;&#30340;&#65307;<BR>&#12288;&#12288;&#22312;&#36827;&#34892;&#19979;&#34892;&#36716;&#25442;&#26102;&#65292;dynamic_cast&#20855;&#26377;&#31867;&#22411;&#26816;&#26597;&#30340;&#21151;&#33021;&#65292;&#27604;static_cast&#26356;&#23433;&#20840;&#12290;<BR>&#12288;&#12288;class B{<BR>&#12288;&#12288;public:<BR>&#12288;&#12288;int m_iNum;<BR>&#12288;&#12288;virtual void foo();<BR>&#12288;&#12288;};<BR>&#12288;&#12288;class D:public B{<BR>&#12288;&#12288;public:<BR>&#12288;&#12288;char *m_szName[100];<BR>&#12288;&#12288;};<BR>&#12288;&#12288;void func(B *pb){<BR>&#12288;&#12288;D *pd1 = static_cast&lt;D *&gt;(pb);<BR>&#12288;&#12288;D *pd2 = dynamic_cast&lt;D *&gt;(pb);<BR>&#12288;&#12288;}<BR>&#12288;&#12288;&#22312;&#19978;&#38754;&#30340;&#20195;&#30721;&#27573;&#20013;&#65292;&#22914;&#26524;pb&#25351;&#21521;&#19968;&#20010;D&#31867;&#22411;&#30340;&#23545;&#35937;&#65292;pd1&#21644;pd2&#26159;&#19968;&#26679;&#30340;&#65292;&#24182;&#19988;&#23545;&#36825;&#20004;&#20010;&#25351;&#38024;&#25191;&#34892;D&#31867;&#22411;&#30340;&#20219;&#20309;&#25805;&#20316;&#37117;&#26159;&#23433;&#20840;&#30340;&#65307;<BR>&#12288;&#12288;&#20294;&#26159;&#65292;&#22914;&#26524;pb&#25351;&#21521;&#30340;&#26159;&#19968;&#20010;B&#31867;&#22411;&#30340;&#23545;&#35937;&#65292;&#37027;&#20040;pd1&#23558;&#26159;&#19968;&#20010;&#25351;&#21521;&#35813;&#23545;&#35937;&#30340;&#25351;&#38024;&#65292;&#23545;&#23427;&#36827;&#34892;D&#31867;&#22411;&#30340;&#25805;&#20316;&#23558;&#26159;&#19981;&#23433;&#20840;&#30340;&#65288;&#22914;&#35775;&#38382;m_szName&#65289;&#65292;<BR>&#12288;&#12288;&#32780;pd2&#23558;&#26159;&#19968;&#20010;&#31354;&#25351;&#38024;&#12290;</FONT></P>
<P><FONT color=#080000 size=3>3&#65292;reinterpret_cast&#25805;&#20316;&#31526;&#65306;&#23558;&#19968;&#20010;&#25351;&#38024;&#36716;&#25442;&#25104;&#20854;&#20182;&#31867;&#22411;&#30340;&#25351;&#38024;&#65292;&#26032;&#31867;&#22411;&#30340;&#25351;&#38024;&#19982;&#26087;&#25351;&#38024;&#21487;&#20197;&#27627;&#19981;&#30456;&#24178;&#12290;&#36890;&#24120;&#29992;&#20110;&#38750;&#26631;&#20934;&#30340;&#25351;&#38024;&#25968;&#25454;&#31867;&#22411;&#36716;&#25442;&#65292;&#20363;&#22914;&#23558;void *&#36716;&#25442;&#20026;char *&#12290;&#23427;&#20063;&#21487;&#20197;&#29992;&#20110;&#25351;&#38024;&#21644;&#25972;&#22411;&#25968;&#20043;&#38388;&#30340;&#31867;&#22411;&#36716;&#25442;&#12290;&#27880;&#24847;&#65306;&#23427;&#23384;&#22312;&#28508;&#22312;&#30340;&#21361;&#38505;&#65292;&#38500;&#38750;&#26377;&#20351;&#29992;&#23427;&#30340;&#20805;&#20998;&#29702;&#30001;&#65292;&#21542;&#21017;&#23601;&#19981;&#35201;&#20351;&#29992;&#23427;&#12290;</FONT></P>
<P><FONT size=2>reinterpret_cast&#26159;C++&#37324;&#30340;&#24378;&#21046;&#31867;&#22411;&#36716;&#25442;&#31526;&#12290;<BR>&#12288;&#12288;&#25805;&#20316;&#31526;&#20462;&#25913;&#20102;&#25805;&#20316;&#25968;&#31867;&#22411;,&#20294;&#20165;&#20165;&#26159;&#37325;&#26032;&#35299;&#37322;&#20102;&#32473;&#20986;&#30340;&#23545;&#35937;&#30340;&#27604;&#29305;&#27169;&#22411;&#32780;&#27809;&#26377;&#36827;&#34892;&#20108;&#36827;&#21046;&#36716;&#25442;&#12290;</FONT></P>
<P><FONT color=#080000 size=3>4&#65292;static_cast&#25805;&#20316;&#31526;&#65306;&#22312;&#30456;&#20851;&#23545;&#35937;&#30340;&#25351;&#38024;&#31867;&#22411;&#20043;&#38388;&#36827;&#34892;&#31867;&#22411;&#36716;&#25442;&#12290;&#26377;&#20851;&#30340;&#31867;&#20043;&#38388;&#24517;&#39035;&#36890;&#36807;&#32487;&#25215;&#26500;&#36896;&#20989;&#25968;&#25110;&#32773;&#36716;&#25442;&#20989;&#25968;&#36827;&#34892;&#32852;&#31995;&#12290;static_cast&#25805;&#20316;&#31526;&#36824;&#33021;&#22312;&#25968;&#23383;&#65288;&#21407;&#22987;&#30340;&#65289;&#31867;&#22411;&#20043;&#38388;&#36827;&#34892;&#31867;&#22411;&#36716;&#25442;&#12290;&#36890;&#24120;&#24773;&#20917;&#19979;&#65292;static_cast&#25805;&#20316;&#31526;&#29992;&#22312;&#23558;&#25968;&#22495;&#36739;&#22823;&#30340;&#31867;&#22411;&#36716;&#25442;&#20026;&#36739;&#23567;&#30340;&#31867;&#22411;&#12290;&#24403;&#36716;&#25442;&#30340;&#31867;&#22411;&#26159;&#21407;&#22987;&#25968;&#25454;&#31867;&#22411;&#26102;&#65292;&#36825;&#31181;&#25805;&#20316;&#21487;&#20197;&#26377;&#25928;&#22320;&#31105;&#27490;&#32534;&#35793;&#26399;&#21457;&#20986;&#35686;&#21578;&#12290;</FONT> 
<P><FONT size=2>&#29992;&#27861;&#65306;static_cast &lt; type-id &gt; ( expression )<BR>&#12288;&#12288;&#35813;&#36816;&#31639;&#31526;&#25226;expression&#36716;&#25442;&#20026;type-id&#31867;&#22411;&#65292;&#20294;&#27809;&#26377;&#36816;&#34892;&#26102;&#31867;&#22411;&#26816;&#26597;&#26469;&#20445;&#35777;&#36716;&#25442;&#30340;&#23433;&#20840;&#24615;&#12290;&#23427;&#20027;&#35201;&#26377;&#22914;&#19979;&#20960;&#31181;&#29992;&#27861;&#65306;<BR>&#12288;&#12288;&#9312;&#29992;&#20110;&#31867;&#23618;&#27425;&#32467;&#26500;&#20013;&#22522;&#31867;&#65288;&#29238;&#31867;&#65289;&#21644;&#27966;&#29983;&#31867;&#65288;&#23376;&#31867;&#65289;&#20043;&#38388;&#25351;&#38024;&#25110;&#24341;&#29992;&#30340;&#36716;&#25442;&#12290;<BR>&#12288;&#12288;&#36827;&#34892;&#19978;&#34892;&#36716;&#25442;&#65288;&#25226;&#27966;&#29983;&#31867;&#30340;&#25351;&#38024;&#25110;&#24341;&#29992;&#36716;&#25442;&#25104;&#22522;&#31867;&#34920;&#31034;&#65289;&#26159;&#23433;&#20840;&#30340;&#65307;<BR>&#12288;&#12288;&#36827;&#34892;&#19979;&#34892;&#36716;&#25442;&#65288;&#25226;&#22522;&#31867;&#25351;&#38024;&#25110;&#24341;&#29992;&#36716;&#25442;&#25104;&#27966;&#29983;&#31867;&#34920;&#31034;&#65289;&#26102;&#65292;&#30001;&#20110;&#27809;&#26377;&#21160;&#24577;&#31867;&#22411;&#26816;&#26597;&#65292;&#25152;&#20197;&#26159;&#19981;&#23433;&#20840;&#30340;&#12290;<BR>&#12288;&#12288;&#9313;&#29992;&#20110;&#22522;&#26412;&#25968;&#25454;&#31867;&#22411;&#20043;&#38388;&#30340;&#36716;&#25442;&#65292;&#22914;&#25226;int&#36716;&#25442;&#25104;char&#65292;&#25226;int&#36716;&#25442;&#25104;enum&#12290;&#36825;&#31181;&#36716;&#25442;&#30340;&#23433;&#20840;&#24615;&#20063;&#35201;&#24320;&#21457;&#20154;&#21592;&#26469;&#20445;&#35777;&#12290;<BR>&#12288;&#12288;&#9314;&#25226;&#31354;&#25351;&#38024;&#36716;&#25442;&#25104;&#30446;&#26631;&#31867;&#22411;&#30340;&#31354;&#25351;&#38024;&#12290;<BR>&#12288;&#12288;&#9315;&#25226;&#20219;&#20309;&#31867;&#22411;&#30340;&#34920;&#36798;&#24335;&#36716;&#25442;&#25104;void&#31867;&#22411;&#12290;<BR>&#12288;&#12288;&#27880;&#24847;&#65306;static_cast&#19981;&#33021;&#36716;&#25442;&#25481;expression&#30340;const&#12289;volatile&#12289;&#25110;&#32773;__unaligned&#23646;&#24615;&#12290;</FONT>