&#22312;Linux&#35774;&#22791;&#27169;&#22411;&#30340;&#25277;&#35937;&#20013;&#65292;&#23384;&#22312;&#30528;&#19968;&#31867;&#31216;&#20316;&#8220;Platform Device&#8221;&#30340;&#35774;&#22791;&#65292;&#20869;&#26680;&#26159;&#36825;&#26679;&#25551;&#36848;&#23427;&#20204;&#30340;&#65288;Documentation/driver-model/platform.txt&#65289;&#65306; </P>
<BLOCKQUOTE>
<P>Platform devices are devices that typically appear as autonomous entities in the system. This includes legacy port-based devices and host bridges to peripheral buses, and most controllers integrated into system-on-chip platforms.&nbsp; What they usually have in common is direct addressing from a CPU bus.&nbsp; Rarely, a platform_device will be connected through a segment of some other kind of bus; but its registers will still be directly addressable. </P></BLOCKQUOTE>
<P>&#27010;&#25324;&#26469;&#35828;&#65292;Platform&#35774;&#22791;&#21253;&#25324;&#65306;&#22522;&#20110;&#31471;&#21475;&#30340;&#35774;&#22791;&#65288;&#24050;&#19981;&#25512;&#33616;&#20351;&#29992;&#65292;&#20445;&#30041;&#19979;&#26469;&#21482;&#20026;&#20860;&#23481;&#26087;&#35774;&#22791;&#65292;legacy&#65289;&#65307;&#36830;&#25509;&#29289;&#29702;&#24635;&#32447;&#30340;&#26725;&#35774;&#22791;&#65307;&#38598;&#25104;&#22312;SOC&#24179;&#21488;&#19978;&#38754;&#30340;&#25511;&#21046;&#22120;&#65307;&#36830;&#25509;&#22312;&#20854;&#23427;bus&#19978;&#30340;&#35774;&#22791;&#65288;&#24456;&#23569;&#35265;&#65289;&#12290;&#31561;&#31561;&#12290; </P>
<P>&#36825;&#20123;&#35774;&#22791;&#26377;&#19968;&#20010;&#22522;&#26412;&#30340;&#29305;&#24449;&#65306;&#21487;&#20197;&#36890;&#36807;CPU bus&#30452;&#25509;&#23547;&#22336;&#65288;&#20363;&#22914;&#22312;&#23884;&#20837;&#24335;&#31995;&#32479;&#24120;&#35265;&#30340;&#8220;&#23492;&#23384;&#22120;&#8221;&#65289;&#12290;&#22240;&#27492;&#65292;&#30001;&#20110;&#36825;&#20010;&#20849;&#24615;&#65292;&#20869;&#26680;&#22312;&#35774;&#22791;&#27169;&#22411;&#30340;&#22522;&#30784;&#19978;&#65288;device&#21644;device_driver&#65289;&#65292;&#23545;&#36825;&#20123;&#35774;&#22791;&#36827;&#34892;&#20102;&#26356;&#36827;&#19968;&#27493;&#30340;&#23553;&#35013;&#65292;&#25277;&#35937;&#20986;paltform bus&#12289;platform device&#21644;platform driver&#65292;&#20197;&#20415;&#39537;&#21160;&#24320;&#21457;&#20154;&#21592;&#21487;&#20197;&#26041;&#20415;&#30340;&#24320;&#21457;&#36825;&#31867;&#35774;&#22791;&#30340;&#39537;&#21160;&#12290; </P>
<P>&#21487;&#20197;&#35828;&#65292;paltform&#35774;&#22791;&#23545;Linux&#39537;&#21160;&#24037;&#31243;&#24072;&#26159;&#38750;&#24120;&#37325;&#35201;&#30340;&#65292;&#22240;&#20026;&#25105;&#20204;&#32534;&#20889;&#30340;&#22823;&#22810;&#25968;&#35774;&#22791;&#39537;&#21160;&#65292;&#37117;&#26159;&#20026;&#20102;&#39537;&#21160;plaftom&#35774;&#22791;&#12290;