&#38754;&#21521;&#23545;&#35937;&#31243;&#24207;&#35774;&#35745;&#20013;&#30340;&#27010;&#24565;&#20027;&#35201;&#21253;&#25324;&#65306;&#23545;&#35937;&#12289;&#31867;&#12289;&#25968;&#25454;&#25277;&#35937;&#12289;&#32487;&#25215;&#12289;&#21160;&#24577;&#32465;&#23450;&#12289;&#25968;&#25454;&#23553;&#35013;&#12289;&#22810;&#24577;&#24615;&#12289;&#28040;&#24687;&#20256;&#36882;&#12290;&#36890;&#36807;&#36825;&#20123;&#27010;&#24565;&#38754;&#21521;&#23545;&#35937;&#30340;&#24605;&#24819;&#24471;&#21040;&#20102;&#20855;&#20307;&#30340;&#20307;&#29616;&#12290; &#12288;&#12288;</P>
<P>1&#65289;&#23545;&#35937; &#23545;&#35937;&#26159;&#36816;&#34892;&#26399;&#30340;&#22522;&#26412;&#23454;&#20307;&#65292;&#23427;&#26159;&#19968;&#20010;&#23553;&#35013;&#20102;&#25968;&#25454;&#21644;&#25805;&#20316;&#36825;&#20123;&#25968;&#25454;&#30340;&#20195;&#30721;&#30340;&#36923;&#36753;&#23454;&#20307;&#12290; &#12288;&#12288;</P>
<P>2&#65289;&#31867; &#31867;&#26159;&#20855;&#26377;&#30456;&#21516;&#31867;&#22411;&#30340;&#23545;&#35937;&#30340;&#25277;&#35937;&#12290;&#19968;&#20010;&#23545;&#35937;&#25152;&#21253;&#21547;&#30340;&#25152;&#26377;&#25968;&#25454;&#21644;&#20195;&#30721;&#21487;&#20197;&#36890;&#36807;&#31867;&#26469;&#26500;&#36896;&#12290; &#12288;&#12288;</P>
<P>3&#65289;&#23553;&#35013; &#23553;&#35013;&#26159;&#23558;&#25968;&#25454;&#21644;&#20195;&#30721;&#25414;&#32465;&#21040;&#19968;&#36215;&#65292;&#36991;&#20813;&#20102;&#22806;&#30028;&#30340;&#24178;&#25200;&#21644;&#19981;&#30830;&#23450;&#24615;&#12290;&#23545;&#35937;&#30340;&#26576;&#20123;&#25968;&#25454;&#21644;&#20195;&#30721;&#21487;&#20197;&#26159;&#31169;&#26377;&#30340;&#65292;&#19981;&#33021;&#34987;&#22806;&#30028;&#35775;&#38382;&#65292;&#20197;&#27492;&#23454;&#29616;&#23545;&#25968;&#25454;&#21644;&#20195;&#30721;&#19981;&#21516;&#32423;&#21035;&#30340;&#35775;&#38382;&#26435;&#38480;&#12290; &#12288;&#12288;</P>
<P>4&#65289;&#32487;&#25215; &#32487;&#25215;&#26159;&#35753;&#26576;&#20010;&#31867;&#22411;&#30340;&#23545;&#35937;&#33719;&#24471;&#21478;&#19968;&#20010;&#31867;&#22411;&#30340;&#23545;&#35937;&#30340;&#29305;&#24449;&#12290;&#36890;&#36807;&#32487;&#25215;&#21487;&#20197;&#23454;&#29616;&#20195;&#30721;&#30340;&#37325;&#29992;&#65306;&#20174;&#24050;&#23384;&#22312;&#30340;&#31867;&#27966;&#29983;&#20986;&#30340;&#19968;&#20010;&#26032;&#31867;&#23558;&#33258;&#21160;&#20855;&#26377;&#21407;&#26469;&#37027;&#20010;&#31867;&#30340;&#29305;&#24615;&#65292;&#21516;&#26102;&#65292;&#23427;&#36824;&#21487;&#20197;&#25317;&#26377;&#33258;&#24049;&#30340;&#26032;&#29305;&#24615;&#12290; &#12288;&#12288;</P>
<P>5&#65289;&#22810;&#24577; &#22810;&#24577;&#26159;&#25351;&#19981;&#21516;&#20107;&#29289;&#20855;&#26377;&#19981;&#21516;&#34920;&#29616;&#24418;&#24335;&#30340;&#33021;&#21147;&#12290;&#22810;&#24577;&#26426;&#21046;&#20351;&#20855;&#26377;&#19981;&#21516;&#20869;&#37096;&#32467;&#26500;&#30340;&#23545;&#35937;&#21487;&#20197;&#20849;&#20139;&#30456;&#21516;&#30340;&#22806;&#37096;&#25509;&#21475;&#65292;&#36890;&#36807;&#36825;&#31181;&#26041;&#24335;&#20943;&#23569;&#20195;&#30721;&#30340;&#22797;&#26434;&#24230;&#12290; &#12288;&#12288;</P>
<P>6&#65289;&#21160;&#24577;&#32465;&#23450; &#32465;&#23450;&#25351;&#30340;&#26159;&#23558;&#19968;&#20010;&#36807;&#31243;&#35843;&#29992;&#19982;&#30456;&#24212;&#20195;&#30721;&#38142;&#25509;&#36215;&#26469;&#30340;&#34892;&#20026;&#12290;&#21160;&#24577;&#32465;&#23450;&#26159;&#25351;&#19982;&#32473;&#23450;&#30340;&#36807;&#31243;&#35843;&#29992;&#30456;&#20851;&#32852;&#30340;&#20195;&#30721;&#21482;&#26377;&#22312;&#36816;&#34892;&#26399;&#25165;&#21487;&#30693;&#30340;&#19968;&#31181;&#32465;&#23450;&#65292;&#23427;&#26159;&#22810;&#24577;&#23454;&#29616;&#30340;&#20855;&#20307;&#24418;&#24335;&#12290; &#12288;&#12288;</P>
<P>7&#65289;&#28040;&#24687;&#20256;&#36882; &#23545;&#35937;&#20043;&#38388;&#38656;&#35201;&#30456;&#20114;&#27807;&#36890;&#65292;&#27807;&#36890;&#30340;&#36884;&#24452;&#23601;&#26159;&#23545;&#35937;&#20043;&#38388;&#25910;&#21457;&#20449;&#24687;&#12290;&#28040;&#24687;&#20869;&#23481;&#21253;&#25324;&#25509;&#25910;&#28040;&#24687;&#30340;&#23545;&#35937;&#30340;&#26631;&#35782;&#65292;&#38656;&#35201;&#35843;&#29992;&#30340;&#20989;&#25968;&#30340;&#26631;&#35782;&#65292;&#20197;&#21450;&#24517;&#35201;&#30340;&#20449;&#24687;&#12290;&#28040;&#24687;&#20256;&#36882;&#30340;&#27010;&#24565;&#20351;&#24471;&#23545;&#29616;&#23454;&#19990;&#30028;&#30340;&#25551;&#36848;&#26356;&#23481;&#26131;&#12290; &#12288;&#12288;</P>
<P>8&#65289;&#26041;&#27861; &#26041;&#27861;&#65288;Method&#65289;&#26159;&#23450;&#20041;&#19968;&#20010;&#31867;&#21487;&#20197;&#20570;&#30340;&#65292;&#20294;&#19981;&#19968;&#23450;&#20250;&#21435;&#20570;&#30340;&#20107;&#12290;</FONT>