<STRONG>&#29305;&#24615;8&#65306;sizeof&#27714;&#24471;&#30340;&#32467;&#26500;&#20307;(&#21450;&#20854;&#23545;&#35937;)&#30340;&#22823;&#23567;&#24182;&#19981;&#31561;&#20110;&#21508;&#20010;&#25968;&#25454;&#25104;&#21592;&#23545;&#35937;&#30340;&#22823;&#23567;&#20043;&#21644;&#65281;</STRONG></P>
<P>&#32467;&#26500;&#20307;&#30340;&#22823;&#23567;&#36319;&#32467;&#26500;&#20307;&#25104;&#21592;&#23545;&#40784;&#26377;&#23494;&#20999;&#20851;&#31995;&#65292;&#32780;&#24182;&#38750;&#31616;&#21333;&#22320;&#31561;&#20110;&#21508;&#20010;&#25104;&#21592;&#30340;&#22823;&#23567;&#20043;&#21644;&#65281;&#27604;&#22914;&#23545;&#22914;&#19979;&#32467;&#26500;&#20307;&#20004;&#20010;&#32467;&#26500;&#20307;A&#12289;B&#20351;&#29992;sizeof&#30340;&#32467;&#26524;&#20998;&#21035;&#26159;&#65306;16,24&#12290;&#21487;&#20197;&#30475;&#20986;sizeof(B)&#24182;&#19981;&#31561;&#20110;sizeof(int)+sizeof(double)+sizeof(int)=16&#12290;</P>
<P><A href="http://jbcdn2.b0.upaiyun.com/2016/11/4eeac7f9d0a7ed9a466b7fdcdb98c461.jpg"><IMG class="size-full wp-image-107865 aligncenter" alt=%e8%a1%a8 src="http://jbcdn2.b0.upaiyun.com/2016/11/4eeac7f9d0a7ed9a466b7fdcdb98c461.jpg"></A></P>
<P>&#22914;&#26524;&#24744;&#19981;&#20102;&#35299;&#32467;&#26500;&#20307;&#30340;&#25104;&#21592;&#23545;&#40784;&#65292;&#20320;&#20250;&#24863;&#21040;&#38750;&#24120;&#24778;&#35766;&#65306;&#32467;&#26500;&#20307;A&#21644;B&#20013;&#21253;&#21547;&#30340;&#25104;&#21592;&#37117;&#19968;&#26679;&#65292;&#21482;&#19981;&#36807;&#39034;&#24207;&#19981;&#21516;&#32780;&#24050;&#65292;&#20026;&#20160;&#20040;&#20854;&#22823;&#23567;&#19981;&#19968;&#26679;&#21602;&#65311;&#35201;&#35299;&#37322;&#36825;&#20010;&#38382;&#39064;&#65292;&#23601;&#35201;&#20102;&#35299;&#32467;&#26500;&#20307;&#25104;&#21592;&#23545;&#40784;&#30340;&#35268;&#21017;&#65292;&#30001;&#20110;&#32467;&#26500;&#20307;&#25104;&#21592;&#23545;&#40784;&#38750;&#24120;&#22797;&#26434;&#65292;<STRONG>&#25105;&#23558;&#29992;&#19987;&#39064;&#8212;&#8212;C/C++&#20993;&#38075;&#38382;&#39064;&#21508;&#20010;&#20987;&#30772;&#20043;&#20301;&#22495;&#21644;&#25104;&#21592;&#23545;&#40784;</STRONG>&#8212;&#8212;&#36827;&#34892;&#35762;&#35299;&#65292;&#36825;&#37324;&#25105;&#21482;&#31616;&#21333;&#22320;&#20171;&#32461;&#20854;&#35268;&#21017;&#65306;</P>
<P>1&#12289;&nbsp; &#32467;&#26500;&#20307;&#30340;&#22823;&#23567;&#31561;&#20110;&#32467;&#26500;&#20307;&#20869;&#26368;&#22823;&#25104;&#21592;&#22823;&#23567;&#30340;&#25972;&#25968;&#20493;</P>
<P>2&#12289;&nbsp; &#32467;&#26500;&#20307;&#20869;&#30340;&#25104;&#21592;&#30340;&#39318;&#22320;&#22336;&#30456;&#23545;&#20110;&#32467;&#26500;&#20307;&#39318;&#22320;&#22336;&#30340;&#20559;&#31227;&#37327;&#26159;&#20854;&#31867;&#22411;&#22823;&#23567;&#30340;&#25972;&#25968;&#20493;&#65292;&#27604;&#22914;&#35828;double&#22411;&#25104;&#21592;&#30456;&#23545;&#20110;&#32467;&#26500;&#20307;&#30340;&#39318;&#22320;&#22336;&#30340;&#22320;&#22336;&#20559;&#31227;&#37327;&#24212;&#35813;&#26159;8&#30340;&#20493;&#25968;&#12290;</P>
<P>3&#12289;&nbsp; &#20026;&#20102;&#28385;&#36275;&#35268;&#21017;1&#21644;2&#32534;&#35793;&#22120;&#20250;&#22312;&#32467;&#26500;&#20307;&#25104;&#21592;&#20043;&#21518;&#36827;&#34892;&#23383;&#33410;&#22635;&#20805;&#65281;</P>
<P>&#22522;&#20110;&#19978;&#38754;&#19977;&#20010;&#35268;&#21017;&#25105;&#20204;&#26469;&#30475;&#30475;&#20026;&#20160;&#20040;sizeof(B)&#31561;&#20110;24&#65306;&#39318;&#20808;&#20551;&#35774;&#32467;&#26500;&#20307;&#30340;&#39318;&#22320;&#22336;&#20026;0&#65292;&#31532;&#19968;&#20010;&#25104;&#21592;num1&#30340;&#39318;&#22320;&#22336;&#26159;0(&#28385;&#36275;&#35268;&#21017;2&#65292;&#21069;&#38754;&#26080;&#39035;&#23383;&#33410;&#22635;&#20805;&#65292;&#20107;&#23454;&#19978;&#32467;&#26500;&#20307;&#32477;&#23545;&#19981;&#20250;&#22312;&#31532;&#19968;&#20010;&#25968;&#25454;&#25104;&#21592;&#21069;&#38754;&#36827;&#34892;&#23383;&#33410;&#22635;&#20805;)&#65292;&#23427;&#30340;&#31867;&#22411;&#26159;int&#65292;&#22240;&#27492;&#23427;&#21344;&#29992;&#22320;&#22336;&#31354;&#38388;0&#8212;&#8212;3&#12290;&#31532;&#20108;&#20010;&#25104;&#21592;num3&#26159;double&#31867;&#22411;&#65292;&#23427;&#21344;&#29992;8&#20010;&#23383;&#33410;&#65292;&#30001;&#20110;&#20043;&#21069;&#30340;num1&#21482;&#21344;&#29992;&#20102;4&#20010;&#23383;&#33410;&#65292;&#20026;&#20102;&#28385;&#36275;&#35268;&#21017;2&#65292;&#38656;&#35201;&#20351;&#29992;&#35268;&#21017;3&#22312;num1&#21518;&#38754;&#22635;&#20805;4&#20010;&#23383;&#33410;&#65288;4&#8212;&#8212;7&#65289;&#65292;&#20351;&#24471;num3&#30340;&#36215;&#22987;&#22320;&#22336;&#20559;&#31227;&#37327;&#20026;8&#65292;&#22240;&#27492;num3&#21344;&#29992;&#30340;&#22320;&#22336;&#31354;&#38388;&#26159;&#65306;8&#8212;&#8212;15&#12290;&#31532;&#19977;&#20010;&#25104;&#21592;num2&#26159;int&#22411;&#65292;&#20854;&#22823;&#23567;&#20026;4&#65292;&#30001;&#20110;num1&#21644;num3&#19968;&#20849;&#21344;&#29992;&#20102;16&#20010;&#23383;&#33410;&#65292;&#27492;&#26102;&#26080;&#39035;&#20219;&#20309;&#22635;&#20805;&#23601;&#33021;&#28385;&#36275;&#35268;&#21017;2&#12290;&#22240;&#27492;num2&#21344;&#29992;&#30340;&#22320;&#22336;&#31354;&#38388;&#26159;16&#8212;&#8212;19&#12290;&#37027;&#20040;&#26159;&#19981;&#26159;&#32467;&#26500;&#20307;&#30340;&#24635;&#22823;&#23567;&#23601;&#26159;0&#8212;&#8212;19&#20849;20&#20010;&#23383;&#33410;&#21602;&#65311;&#35831;&#27880;&#24847;&#65292;&#21035;&#24536;&#20102;&#35268;&#21017;1&#65281;&#30001;&#20110;&#32467;&#26500;&#20307;&#20869;&#26368;&#22823;&#25104;&#21592;&#26159;double&#21344;&#29992;8&#20010;&#23383;&#33410;&#65292;&#22240;&#27492;&#26368;&#21518;&#36824;&#38656;&#35201;&#22312;num2&#21518;&#38754;&#22635;&#20805;4&#20010;&#23383;&#33410;&#65292;&#20351;&#24471;&#32467;&#26500;&#20307;&#24635;&#20307;&#22823;&#23567;&#20026;24&#12290;</P>
<P>&#25353;&#29031;&#19978;&#38754;&#30340;&#19977;&#20010;&#35268;&#21017;&#21644;&#20998;&#26512;&#36807;&#31243;&#65292;&#20320;&#21487;&#20197;&#24456;&#23481;&#26131;&#22320;&#30693;&#36947;&#20026;&#20160;&#20040;sizeof(A)&#31561;&#20110;16&#12290;<STRONG>&#29305;&#21035;&#38656;&#35201;&#35828;&#26126;&#30340;&#26159;</STRONG>&#65292;&#25105;&#36825;&#37324;&#32473;&#20986;&#20102;&#19977;&#20010;&#32467;&#35770;&#24615;&#30340;&#35268;&#21017;&#65292;&#32780;&#27809;&#26377;&#38416;&#36848;&#20026;&#20160;&#20040;&#35201;&#36825;&#26679;&#12290;&#20320;&#25110;&#35768;&#26377;&#24456;&#22810;&#30097;&#38382;&#65306;&#20026;&#20160;&#20040;&#35201;&#32467;&#26500;&#20307;&#25104;&#21592;&#23545;&#40784;&#65292;&#20026;&#20160;&#20040;&#35201;&#23450;&#20041;&#35268;&#21017;1&#31561;&#12290;&#22914;&#26524;&#20320;&#26377;&#36825;&#26679;&#30340;&#30097;&#38382;&#65292;&#24182;&#23581;&#35797;&#21435;&#24324;&#28165;&#26970;&#30340;&#35805;&#65292;&#37027;&#20040;&#25105;&#25954;&#26029;&#35328;&#65292;&#19981;&#20037;&#30340;&#23558;&#26469;&#20320;&#24517;&#23450;&#20250;&#26377;&#22823;&#25104;&#23601;&#65292;&#33267;&#23569;&#22312;&#23398;&#20064;c++&#19978;&#26159;&#36825;&#26679;&#12290;&#21069;&#38754;&#35828;&#36807;&#65292;&#25105;&#20250;&#20877;&#20889;&#19968;&#31687;&#19987;&#39064;&#65306;<STRONG>C/C++&#20993;&#38075;&#38382;&#39064;&#21508;&#20010;&#20987;&#30772;&#20043;&#20301;&#22495;&#21644;&#25104;&#21592;&#23545;&#40784;</STRONG>&#26469;&#35814;&#32454;&#22238;&#31572;&#36825;&#20123;&#38382;&#39064;&#65292;&#22914;&#26524;&#20320;&#24613;&#20110;&#35201;&#24324;&#26126;&#30333;&#65292;&#37027;&#20040;&#20320;&#21487;&#20197;&#21442;&#32771;&#20854;&#20182;&#36164;&#26009;&#65292;&#27604;&#22914;&#35828;&#12298;&#39640;&#36136;&#37327;c++&#31243;&#24207;&#35774;&#35745;&#25351;&#21335;&#12299;&#12290;</P>
<P>&#26368;&#21518;&#20877;&#25552;&#37266;&#19968;&#28857;&#65292;&#22312;&#36827;&#34892;&#35774;&#35745;&#26102;&#65292;&#26368;&#22909;&#20180;&#32454;&#23433;&#25490;&#32467;&#26500;&#20307;&#20013;&#21508;&#20010;&#25104;&#21592;&#30340;&#39034;&#24207;&#65292;&#22240;&#20026;&#20320;&#24050;&#32463;&#30475;&#21040;&#20102;&#19978;&#38754;&#30340;&#32467;&#26500;&#20307;B&#19982;&#32467;&#26500;&#20307;A&#21253;&#21547;&#30340;&#25104;&#21592;&#30456;&#21516;&#65292;&#21482;&#19981;&#36807;&#39034;&#24207;&#30053;&#26377;&#24046;&#24322;&#65292;&#26368;&#32456;&#23601;&#23548;&#33268;&#20102;B&#27604;A&#22810;&#28040;&#32791;&#20102;50%&#30340;&#31354;&#38388;&#65292;&#20551;&#22914;&#22312;&#24037;&#31243;&#20013;&#38656;&#35201;&#23450;&#20041;&#35813;&#32467;&#26500;&#20307;&#30340;&#25968;&#32452;&#65292;&#22810;&#28040;&#32791;&#30340;&#31354;&#38477;&#23558;&#26159;&#24040;&#22823;&#30340;&#12290;&#21363;&#20351;&#23558;&#26469;&#20869;&#23384;&#38477;&#20215;&#20026;&#30333;&#33756;&#20215;&#26684;&#65292;&#20320;&#20063;&#19981;&#35201;&#24573;&#35270;&#36825;&#20010;&#38382;&#39064;&#65292;&#21220;&#20461;&#33410;&#32422;&#26159;&#20013;&#22269;&#20154;&#27665;&#30340;&#20248;&#33391;&#20256;&#32479;&#65292;&#25105;&#20204;&#24212;&#35813;&#32487;&#25215;&#21644;&#20445;&#25345;&#65281;