Linux&#35774;&#22791;&#27169;&#22411;&#30340;&#26680;&#24515;&#24605;&#24819;&#26159;&#65288;&#36890;&#36807;xxx&#25163;&#27573;&#65292;&#23454;&#29616;xxx&#30446;&#30340;&#65289;&#65306; 
<P></P>
<P>1. <FONT class=extract>&#29992;Device&#65288;struct device&#65289;&#21644;Device Driver&#65288;struct device_driver&#65289;&#20004;&#20010;&#25968;&#25454;&#32467;&#26500;&#65292;&#20998;&#21035;&#20174;&#8220;&#26377;&#20160;&#20040;&#29992;&#8221;&#21644;&#8220;&#24590;&#20040;&#29992;&#8221;&#20004;&#20010;&#35282;&#24230;&#25551;&#36848;&#30828;&#20214;&#35774;&#22791;&#12290;&#36825;&#26679;&#23601;&#32479;&#19968;&#20102;&#32534;&#20889;&#35774;&#22791;&#39537;&#21160;&#30340;&#26684;&#24335;&#65292;&#20351;&#39537;&#21160;&#24320;&#21457;&#20174;&#35770;&#36848;&#39064;&#21464;&#20026;&#22635;&#31354;&#20307;&#65292;&#20174;&#32780;&#31616;&#21270;&#20102;&#35774;&#22791;&#39537;&#21160;&#30340;&#24320;&#21457;&#12290;</FONT> </P>
<P>2. &#21516;&#26679;&#20351;&#29992;Device&#21644;Device Driver&#20004;&#20010;&#25968;&#25454;&#32467;&#26500;&#65292;&#23454;&#29616;&#30828;&#20214;&#35774;&#22791;&#30340;&#21363;&#25554;&#21363;&#29992;&#65288;&#28909;&#25300;&#25554;&#65289;&#12290; <BR>&#22312;Linux&#20869;&#26680;&#20013;&#65292;&#21482;&#35201;&#20219;&#20309;Device&#21644;Device Driver&#20855;&#26377;&#30456;&#21516;&#30340;&#21517;&#23383;&#65292;&#20869;&#26680;&#23601;&#20250;&#25191;&#34892;Device Driver&#32467;&#26500;&#20013;&#30340;&#21021;&#22987;&#21270;&#20989;&#25968;&#65288;probe&#65289;&#65292;&#35813;&#20989;&#25968;&#20250;&#21021;&#22987;&#21270;&#35774;&#22791;&#65292;&#20351;&#20854;&#20026;&#21487;&#29992;&#29366;&#24577;&#12290; <BR>&#32780;&#23545;&#22823;&#22810;&#25968;&#28909;&#25300;&#25554;&#35774;&#22791;&#32780;&#35328;&#65292;&#23427;&#20204;&#30340;Device Driver&#19968;&#30452;&#23384;&#22312;&#20869;&#26680;&#20013;&#12290;&#24403;&#35774;&#22791;&#27809;&#26377;&#25554;&#20837;&#26102;&#65292;&#20854;Device&#32467;&#26500;&#19981;&#23384;&#22312;&#65292;&#22240;&#32780;&#20854;Driver&#20063;&#23601;&#19981;&#25191;&#34892;&#21021;&#22987;&#21270;&#25805;&#20316;&#12290;&#24403;&#35774;&#22791;&#25554;&#20837;&#26102;&#65292;&#20869;&#26680;&#20250;&#21019;&#24314;&#19968;&#20010;Device&#32467;&#26500;&#65288;&#21517;&#31216;&#21644;Driver&#30456;&#21516;&#65289;&#65292;&#27492;&#26102;&#23601;&#20250;&#35302;&#21457;Driver&#30340;&#25191;&#34892;&#12290;&#36825;&#23601;&#26159;&#21363;&#25554;&#21363;&#29992;&#30340;&#27010;&#24565;&#12290; </P>
<P>3. <FONT class=extract>&#36890;&#36807;"Bus--&gt;Device&#8221;&#31867;&#22411;&#30340;&#26641;&#29366;&#32467;&#26500;&#65288;&#35265;2.1&#31456;&#33410;&#30340;&#22270;&#20363;&#65289;&#35299;&#20915;&#35774;&#22791;&#20043;&#38388;&#30340;&#20381;&#36182;&#65292;&#32780;&#36825;&#31181;&#20381;&#36182;&#22312;&#24320;&#20851;&#26426;&#12289;&#30005;&#28304;&#31649;&#29702;&#31561;&#36807;&#31243;&#20013;&#23588;&#20026;&#37325;&#35201;&#12290; <BR>&#35797;&#24819;&#65292;&#19968;&#20010;&#35774;&#22791;&#25346;&#36733;&#22312;&#19968;&#26465;&#24635;&#32447;&#19978;&#65292;&#35201;&#21551;&#21160;&#36825;&#20010;&#35774;&#22791;&#65292;&#24517;&#39035;&#20808;&#21551;&#21160;&#23427;&#25152;&#25346;&#36733;&#30340;&#24635;&#32447;&#12290;&#24456;&#26174;&#28982;&#65292;&#22914;&#26524;&#31995;&#32479;&#20013;&#35774;&#22791;&#38750;&#24120;&#22810;&#12289;&#20381;&#36182;&#20851;&#31995;&#38750;&#24120;&#22797;&#26434;&#30340;&#26102;&#20505;&#65292;&#26080;&#35770;&#26159;&#20869;&#26680;&#36824;&#26159;&#39537;&#21160;&#30340;&#24320;&#21457;&#20154;&#21592;&#65292;&#37117;&#26080;&#21147;&#32500;&#25252;&#36825;&#31181;&#20851;&#31995;&#12290; <BR>&#32780;&#35774;&#22791;&#27169;&#22411;&#20013;&#30340;&#36825;&#31181;&#26641;&#29366;&#32467;&#26500;&#65292;&#21487;&#20197;&#33258;&#21160;&#22788;&#29702;&#36825;&#31181;&#20381;&#36182;&#20851;&#31995;&#12290;&#21551;&#21160;&#26576;&#19968;&#20010;&#35774;&#22791;&#21069;&#65292;&#20869;&#26680;&#20250;&#26816;&#26597;&#35813;&#35774;&#22791;&#26159;&#21542;&#20381;&#36182;&#20854;&#23427;&#35774;&#22791;&#25110;&#32773;&#24635;&#32447;&#65292;&#22914;&#26524;&#20381;&#36182;&#65292;&#21017;&#26816;&#26597;&#25152;&#20381;&#36182;&#30340;&#23545;&#35937;&#26159;&#21542;&#24050;&#32463;&#21551;&#21160;&#65292;&#22914;&#26524;&#27809;&#26377;&#65292;&#21017;&#20250;&#20808;&#21551;&#21160;&#23427;&#20204;&#65292;&#30452;&#21040;&#21551;&#21160;&#35813;&#35774;&#22791;&#30340;&#26465;&#20214;&#20855;&#22791;&#20026;&#27490;&#12290;&#32780;&#39537;&#21160;&#24320;&#21457;&#20154;&#21592;&#38656;&#35201;&#20570;&#30340;&#65292;&#23601;&#26159;&#22312;&#32534;&#20889;&#35774;&#22791;&#39537;&#21160;&#26102;&#65292;&#21578;&#30693;&#20869;&#26680;&#35813;&#35774;&#22791;&#30340;&#20381;&#36182;&#20851;&#31995;&#21363;&#21487;&#12290;</FONT> </P>
<P>4. <FONT class=extract>&#20351;&#29992;Class&#32467;&#26500;&#65292;&#22312;&#35774;&#22791;&#27169;&#22411;&#20013;&#24341;&#20837;&#38754;&#21521;&#23545;&#35937;&#30340;&#27010;&#24565;&#65292;&#36825;&#26679;&#21487;&#20197;&#26368;&#22823;&#38480;&#24230;&#22320;&#25277;&#35937;&#20849;&#24615;&#65292;&#20943;&#23569;&#39537;&#21160;&#24320;&#21457;&#36807;&#31243;&#20013;&#30340;&#37325;&#22797;&#21171;&#21160;&#65292;&#38477;&#20302;&#24037;&#20316;&#37327;&#12290;</FONT>