<SPAN style="FONT-SIZE: 12pt; FONT-FAMILY: &#23435;&#20307;; mso-bidi-font-family: &#23435;&#20307;; mso-font-kerning: 0pt">&#36825;&#28041;&#21450;&#21040;&#25945;&#32946;&#29702;&#24565;&#12290;&#31532;&#19968;&#31181;&#21487;&#31216;&#20026;&#8220;&#38750;&#31934;&#33521;&#25945;&#32946;&#8221;&#65292;&#31532;&#20108;&#31181;&#21487;&#31216;&#20026;&#8220;&#31934;&#33521;&#25945;&#32946;&#8221;&#12290;<SPAN lang=EN-US><BR><BR></SPAN>&#36825;&#20004;&#20010;&#27010;&#24565;&#25105;&#25552;&#20986;&#26469;&#65292;&#20294;&#26080;&#27861;&#22909;&#22909;&#22320;&#20570;&#35299;&#37322;&#65292;&#31616;&#32780;&#35328;&#20043;&#65292;&#21069;&#32773;&#30340;&#37325;&#28857;&#26159;&#8220;&#24179;&#20961;&#8221;&#65292;&#21518;&#32773;&#30340;&#37325;&#28857;&#26159;&#8220;&#36229;&#32676;&#8221;&#12290;<SPAN lang=EN-US><BR><BR></SPAN>&#25454;&#25105;&#35266;&#23519;&#65292;&#37319;&#21462;&#8220;&#38750;&#31934;&#33521;&#25945;&#32946;&#8221;&#65292;&#20063;&#26377;&#20004;&#31181;&#65306;&#19968;&#31181;&#26159;&#32570;&#20047;&#25945;&#32946;&#36164;&#28304;&#65292;&#27604;&#22914;&#29238;&#27597;&#24537;&#30860;&#65292;&#27809;&#26377;&#23478;&#24237;&#25945;&#32946;&#24847;&#35782;&#65292;&#27809;&#26377;&#25945;&#32946;&#26041;&#27861;&#65292;&#19981;&#24471;&#19981;&#23545;&#23401;&#23376;&#21548;&#20043;&#20219;&#20043;&#65292;&#24403;&#28982;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#26377;&#30340;&#23478;&#24237;&#29238;&#27597;&#21697;&#26684;&#20248;&#33391;&#65292;&#26377;&#30340;&#23401;&#23376;&#33258;&#25105;&#22859;&#26007;&#30340;&#24847;&#35782;&#28949;&#21457;&#24471;&#26089;&#65292;&#28176;&#28176;&#27493;&#20837;&#31934;&#33521;&#36947;&#36335;&#65307;&#19968;&#31181;&#26159;&#29238;&#27597;&#26159;&#30456;&#24403;&#26174;&#36203;&#30340;&#25104;&#21151;&#20154;&#22763;&#65292;&#28145;&#30693;&#25104;&#21151;&#36335;&#19978;&#30340;&#33392;&#36763;&#21644;&#19981;&#22570;&#65292;&#21448;&#31215;&#32047;&#20102;&#30456;&#24403;&#30340;&#36130;&#23500;&#65292;&#24076;&#26395;&#32473;&#23401;&#23376;&#19968;&#20010;&#30456;&#23545;&#24179;&#38745;&#30340;&#12289;&#27809;&#26377;&#22859;&#26007;&#33510;&#30171;&#30340;&#20154;&#29983;&#12290;&#20063;&#23601;&#26159;&#20182;&#20204;&#24120;&#24120;&#35828;&#8220;&#24076;&#26395;&#23401;&#23376;&#20570;&#20010;&#26222;&#36890;&#20154;&#8221;&#12290;&#24403;&#28982;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#24456;&#22810;&#23401;&#23376;&#30001;&#20110;&#25104;&#38271;&#29615;&#22659;&#22909;&#65292;&#31038;&#20250;&#36164;&#28304;&#22810;&#65292;&#33258;&#25105;&#28608;&#21169;&#24847;&#35782;&#24378;&#65292;&#20063;&#36731;&#32780;&#26131;&#20030;&#22320;&#27493;&#20837;&#31934;&#33521;&#36947;&#36335;&#12290;<SPAN lang=EN-US><BR><BR></SPAN>&#8220;&#31934;&#33521;&#25945;&#32946;&#8221;&#65292;&#20063;&#26377;&#20004;&#31181;&#12290;&#19968;&#31181;&#26159;&#29238;&#27597;&#21644;&#23401;&#23376;&#26377;&#20849;&#35782;&#65292;&#23401;&#23376;&#26377;&#20869;&#21147;&#65292;&#26377;&#30446;&#26631;&#65292;&#38194;&#32780;&#19981;&#33293;&#65307;&#19968;&#31181;&#26159;&#29238;&#27597;&#21644;&#23401;&#23376;&#27809;&#26377;&#20849;&#35782;&#65292;&#38752;&#39640;&#21387;&#24378;&#36843;&#65292;&#20063;&#35848;&#19981;&#19978;&#31185;&#23398;&#30340;&#26041;&#27861;&#21644;&#21338;&#22823;&#30340;&#24515;&#24576;&#65292;&#26368;&#21518;&#19981;&#24471;&#19981;&#25918;&#20302;&#35201;&#27714;&#65292;&#29978;&#33267;&#36896;&#25104;&#23401;&#23376;&#20010;&#24615;&#25197;&#26354;&#21644;&#20154;&#29983;&#24754;&#21095;&#12290;<SPAN lang=EN-US><BR><BR></SPAN>&#25152;&#35859;&#8220;&#33258;&#28982;&#25104;&#38271;&#8221;&#21482;&#26159;&#21160;&#21548;&#26102;&#39654;&#30340;&#21517;&#35789;&#21644;&#23545;&#25945;&#32946;&#30340;&#20005;&#37325;&#35823;&#35299;&#12290;&#21363;&#20415;&#26159;&#8220;&#38750;&#31934;&#33521;&#25945;&#32946;&#8221;&#65292;&#20063;&#20381;&#28982;&#35201;&#22521;&#20859;&#23401;&#23376;&#30340;&#8220;&#31934;&#33521;&#21697;&#26684;&#8221;&#65292;&#25152;&#35859;&#8220;&#31934;&#33521;&#21697;&#26684;&#8221;&#65292;&#20063;&#23601;&#26159;&#24120;&#35828;&#30340;&#8220;&#27714;&#30693;&#12289;&#19987;&#27880;&#12289;&#24525;&#32784;&#12289;&#21892;&#33391;&#12289;&#21512;&#20316;&#12289;&#21220;&#22859;&#12289;&#24320;&#26391;&#12289;&#32416;&#38169;&#8230;&#8230;&#8221;&#20035;&#33267;&#26356;&#20255;&#22823;&#30340;&#35832;&#22914;&#8220;&#21338;&#23398;&#12289;&#22362;&#23450;&#12289;&#38544;&#24525;&#12289;&#24754;&#24751;&#12289;&#20048;&#35266;&#12289;&#33258;&#30465;&#8230;&#8230;&#8221;&#12290;<SPAN lang=EN-US><BR><BR><BR></SPAN>&#25152;&#20197;&#35828;&#65292;&#8220;&#31934;&#33521;&#25945;&#32946;&#8221;&#30340;&#30446;&#26631;&#65292;&#24182;&#38750;&#26159;&#20570;&#8220;&#20154;&#19978;&#20154;&#8221;&#65292;&#32780;&#26159;&#25104;&#20026;&#19968;&#20010;&#8220;&#20154;&#26684;&#20581;&#20840;&#30340;&#20154;&#8221;&#65292;&#24182;&#22240;&#20026;&#20182;&#20154;&#26684;&#20581;&#20840;&#65292;&#32780;&#26356;&#23481;&#26131;&#24471;&#21040;&#36175;&#35782;&#12289;&#24471;&#21040;&#26426;&#20250;&#65292;&#24471;&#21040;&#25104;&#21151;&#65292;&#25104;&#20026;&#19968;&#33324;&#24847;&#20041;&#19978;&#30340;&#8220;&#31038;&#20250;&#31934;&#33521;&#8221;&#65288;&#33267;&#20110;&#20160;&#20040;&#26679;&#30340;&#20154;&#31639;&#8220;&#31038;&#20250;&#31934;&#33521;&#8221;&#21644;&#8220;&#25104;&#21151;&#20154;&#22763;&#8221;&#65292;&#36825;&#37324;&#19981;&#20570;&#35752;&#35770;&#65289;&#12290;&#22312;&#25945;&#32946;&#36164;&#28304;&#24182;&#19981;&#24179;&#34913;&#30340;&#20013;&#22269;&#65292;&#40723;&#21169;&#23401;&#23376;&#25509;&#21463;&#26356;&#22909;&#30340;&#25945;&#32946;&#65292;&#29305;&#21035;&#26159;&#22312;&#26377;&#33021;&#21147;&#19978;&#21271;&#22823;&#28165;&#21326;&#21704;&#20315;&#30340;&#24773;&#20917;&#19979;&#65292;&#24403;&#28982;&#24212;&#24403;&#36873;&#25321;&#21644;&#20105;&#21462;&#26368;&#22909;&#30340;&#25945;&#32946;&#65288;&#21738;&#24597;&#36825;&#20123;&#39030;&#23574;&#22823;&#23398;&#33258;&#36523;&#38382;&#39064;&#19981;&#23569;&#65292;&#20063;&#34987;&#39554;&#24471;&#22815;&#21595;&#65289;&#65307;&#24403;&#28982;&#65292;&#30001;&#20110;&#20013;&#22269;&#30340;&#23398;&#26657;&#34913;&#37327;&#26631;&#20934;&#21333;&#19968;&#65288;&#20197;&#32771;&#35797;&#25104;&#32489;&#20026;&#21807;&#19968;&#26816;&#39564;&#26631;&#20934;&#65289;&#65292;&#32780;&#32771;&#35797;&#21448;&#25104;&#20026;&#26497;&#31471;&#20047;&#21619;&#12289;&#26497;&#31471;&#30130;&#32047;&#12289;&#26497;&#31471;&#27531;&#37239;&#65292;&#29978;&#33267;&#25212;&#26432;&#20010;&#24615;&#21644;&#21019;&#36896;&#21147;&#30340;&#19996;&#35199;&#65288;&#22914;&#26524;&#23401;&#23376;&#30340;&#20010;&#24615;&#21697;&#26684;&#22909;&#65292;&#20855;&#26377;&#19987;&#27880;&#24525;&#32784;&#31934;&#31070;&#65292;&#20154;&#26684;&#29420;&#31435;&#12289;&#25209;&#21028;&#24615;&#24378;&#65292;&#21487;&#20197;&#38477;&#20302;&#21644;&#23631;&#34109;&#36825;&#31867;&#24433;&#21709;&#65289;&#65292;&#25152;&#20197;&#26368;&#32456;&#26377;&#24456;&#22810;&#20248;&#31168;&#30340;&#23401;&#23376;&#34987;&#25380;&#19979;&#36825;&#26465;&#21435;&#24448;&#39030;&#23574;&#22823;&#23398;&#30340;&#36947;&#36335;&#65292;&#25110;&#32773;&#21478;&#23547;&#20182;&#36335;&#65288;&#27604;&#22914;&#20986;&#22269;&#30041;&#23398;&#65292;&#25110;&#32773;&#31227;&#27665;&#25104;&#20026;&#22806;&#31821;&#32771;&#29983;&#65289;&#65292;&#20854;&#23454;&#24819;&#36890;&#20102;&#20063;&#27809;&#20160;&#20040;&#65292;&#29616;&#22312;&#30340;&#31038;&#20250;&#65292;&#20063;&#35768;&#24050;&#32463;&#19981;&#26159;&#37027;&#20040;&#30475;&#37325;&#39030;&#23574;&#22823;&#23398;&#30340;&#25991;&#20973;&#65292;&#21487;&#24796;&#30340;&#20007;&#22833;&#20102;&#20248;&#31168;&#30340;&#25945;&#32946;&#24179;&#21488;&#21644;&#26657;&#21451;&#36164;&#28304;&#12290;<SPAN lang=EN-US><BR><BR><BR></SPAN>&#22312;&#20013;&#22269;&#30340;&#25945;&#32946;&#29615;&#22659;&#20013;&#65292;&#29238;&#27597;&#19981;&#24212;&#35813;&#35266;&#24565;&#28151;&#20081;&#65292;&#24038;&#21491;&#25671;&#25670;&#65292;&#33258;&#30456;&#30683;&#30462;&#65292;&#25351;&#19996;&#25171;&#35199;&#12290;&#25105;&#35748;&#20026;&#24212;&#35813;&#22362;&#23450;&#8220;&#31934;&#33521;&#25945;&#32946;&#8221;&#25110;&#8220;&#31934;&#33521;&#21697;&#26684;&#8221;&#25945;&#32946;&#65292;&#22914;&#26524;&#25945;&#32946;&#36164;&#28304;&#21644;&#25945;&#32946;&#26041;&#27861;&#19981;&#22815;&#65292;&#37027;&#20040;&#23601;&#24212;&#24403;&#40723;&#21169;&#23401;&#23376;&#21435;&#20570;&#33021;&#28608;&#21457;&#28508;&#33021;&#65292;&#33719;&#24471;&#25104;&#23601;&#24863;&#30340;&#20107;&#24773;&#65292;&#22312;&#36825;&#26679;&#30340;&#36807;&#31243;&#20013;&#65292;&#24471;&#21040;&#26356;&#26377;&#20462;&#20026;&#30340;&#20154;&#30340;&#24110;&#21161;&#65288;&#20063;&#23601;&#26159;&#24248;&#20439;&#35828;&#27861;&#37324;&#30340;&#8220;&#36149;&#20154;&#8221;&#65289;&#65292;&#22521;&#20859;&#25152;&#35859;&#30340;&#8220;&#31934;&#33521;&#21697;&#26684;&#8221;&#65292;&#24182;&#35753;&#36825;&#20123;&#21697;&#26684;&#25104;&#20026;&#23401;&#23376;&#20869;&#22312;&#30340;&#33258;&#25105;&#35201;&#27714;&#65292;&#24182;&#28176;&#28176;&#22266;&#21270;&#19979;&#26469;&#65292;&#25104;&#20026;&#20182;&#33258;&#36523;&#20154;&#26684;&#30340;&#19968;&#37096;&#20998;&#12290;<SPAN lang=EN-US></SPAN></SPAN> 
<P></P>
<P><SPAN lang=EN-US><FONT size=3>&nbsp;</FONT></SPAN>