<H2>Device Tree&#65288;&#19968;&#65289;&#65306;&#32972;&#26223;&#20171;&#32461;</H2>
<P class=date>&#20316;&#32773;&#65306;<A href="http://www.wowotech.net/author/3">linuxer</A> &#21457;&#24067;&#20110;&#65306;2014-5-22 16:46 &#20998;&#31867;&#65306;<A href="http://www.wowotech.net/sort/device_model">&#32479;&#19968;&#35774;&#22791;&#27169;&#22411;</A> </P>
<P>&#19968;&#12289;&#21069;&#35328; </P>
<P>&#20316;&#20026;&#19968;&#20010;&#22810;&#24180;&#32789;&#32792;&#22312;linux 2.6.23&#20869;&#26680;&#30340;&#24320;&#21457;&#32773;&#65292;&#21508;&#20010;&#19981;&#21516;&#39033;&#30446;&#20013;&#21508;&#31181;&#19981;&#21516;&#21608;&#36793;&#22806;&#35774;&#39537;&#21160;&#30340;&#24320;&#21457;&#20197;&#21450;&#21508;&#31181;&#29712;&#30862;&#30340;&#12289;&#25199;&#30382;&#30340;&#20439;&#21153;&#21344;&#25454;&#20102;&#22823;&#37096;&#20998;&#30340;&#26102;&#38388;&#12290;&#24403;&#26377;&#26426;&#20250;&#19979;&#36733;3.14&#30340;&#20869;&#26680;&#24182;&#20934;&#22791;&#23398;&#20064;&#30340;&#26102;&#20505;&#65292;&#31361;&#28982;&#21457;&#29616;linux kernel&#23545;&#20110;&#25105;&#20284;&#20046;&#21464;&#24471;&#38750;&#24120;&#30340;&#38476;&#29983;&#20102;&#65292;&#21508;&#31181;&#26032;&#30340;&#26426;&#21046;&#65292;&#21508;&#31181;framework&#12289;&#21508;&#31181;&#26032;&#30340;&#27010;&#24565;&#35753;&#25105;&#24863;&#21040;&#38405;&#35835;&#20869;&#26680;&#20195;&#30721;&#21464;&#24471;&#20030;&#27493;&#32500;&#33392;&#12290; &#36824;&#22909;&#65292;&#21078;&#26512;&#20869;&#26680;&#30340;&#28909;&#24773;&#36824;&#22312;&#65292;&#21097;&#19979;&#30340;&#23601;&#20132;&#32473;&#26102;&#38388;&#30340;&#12290;&#39318;&#20808;&#36827;&#20837;&#35270;&#32447;&#30340;&#26159;Device Tree&#26426;&#21046;&#65292;&#36825;&#26159;&#21644;porting&#20869;&#26680;&#38750;&#24120;&#30456;&#20851;&#30340;&#26426;&#21046;&#65292;&#22914;&#26524;&#24819;&#35753;&#23558;&#25105;&#20204;&#30340;&#30828;&#20214;&#24179;&#21488;&#36801;&#31227;&#21040;&#39640;&#29256;&#26412;&#30340;&#20869;&#26680;&#19978;&#65292;Device Tree&#26159;&#19968;&#20010;&#24517;&#39035;&#35201;&#25195;&#28165;&#30340;&#38556;&#30861;&#12290; </P>
<P>&#25105;&#24819;&#20174;&#19979;&#38754;&#19977;&#20010;&#26041;&#38754;&#26469;&#20102;&#35299;Device Tree&#65306; </P>
<P>1&#12289;&#20026;&#20309;&#35201;&#24341;&#20837;Device Tree&#65292;&#36825;&#20010;&#26426;&#21046;&#26159;&#29992;&#26469;&#35299;&#20915;&#20160;&#20040;&#38382;&#39064;&#30340;&#65311;&#65288;&#36825;&#26159;&#26412;&#25991;&#30340;&#20027;&#39064;&#65289; </P>
<P>2&#12289;Device Tree&#30340;&#22522;&#30784;&#27010;&#24565;&#65288;&#35831;&#21442;&#32771;<A href="http://www.wowotech.net/linux_kenrel/dt_basic_concept.html" target=_blank>DT&#22522;&#30784;&#27010;&#24565;</A>&#65289; </P>
<P>3&#12289;ARM linux&#20013;&#21644;Device Tree&#30456;&#20851;&#30340;&#20195;&#30721;&#20998;&#26512;&#65288;&#35831;&#21442;&#32771;<A href="http://www.wowotech.net/linux_kenrel/dt-code-analysis.html" target=_blank>DT&#20195;&#30721;&#20998;&#26512;</A>&#65289; </P>
<P>&#38405;&#35835;linux&#20869;&#26680;&#20195;&#30721;&#23601;&#20687;&#27427;&#36175;&#20912;&#23665;&#65292;&#26377;&#30475;&#24471;&#21040;&#30340;&#32654;&#26223;&#65288;&#21508;&#31181;&#20869;&#26680;&#26426;&#21046;&#21450;&#20854;&#20195;&#30721;&#65289;&#65292;&#20063;&#26377;&#22475;&#22312;&#27700;&#38754;&#20043;&#19979;&#30475;&#19981;&#21040;&#30340;&#22522;&#30784;&#65288;&#26426;&#21046;&#32972;&#21518;&#30340;&#28304;&#30001;&#21644;&#30446;&#30340;&#65289;&#12290;&#27785;&#37257;&#20110;&#21508;&#31181;&#20869;&#26680;&#26426;&#21046;&#30340;&#20195;&#30721;&#22266;&#28982;&#26377;&#26080;&#38480;&#20048;&#36259;&#65292;&#20294;&#26356;&#37325;&#35201;&#30340;&#26159;&#27880;&#20837;&#26356;&#22810;&#30340;&#24605;&#32771;&#65292;&#24605;&#32771;&#20854;&#32972;&#21518;&#30340;&#26426;&#29702;&#65292;&#30495;&#27491;&#29702;&#35299;&#36719;&#20214;&#25277;&#35937;&#12290;&#36825;&#26679;&#25165;&#33021;&#20030;&#19968;&#21453;&#19977;&#65292;&#24182;&#24212;&#29992;&#22312;&#20855;&#20307;&#30340;&#24037;&#20316;&#21644;&#29983;&#27963;&#20013;&#12290; </P>
<P>&#26412;&#25991;&#20027;&#35201;&#20174;&#19979;&#38754;&#20960;&#20010;&#26041;&#38754;&#38416;&#36848;&#20026;&#20309;ARM linux&#20250;&#24341;&#20837;Device Tree&#65306; </P>
<P>1&#12289;&#27809;&#26377;Device Tree&#30340;ARM linux&#26159;&#22914;&#20309;&#36816;&#36716;&#30340;&#65311; </P>
<P>2&#12289;&#28151;&#20081;&#30340;ARM architecture&#20195;&#30721;&#21644;&#23384;&#22312;&#30340;&#38382;&#39064; </P>
<P>3&#12289;&#26032;&#20869;&#26680;&#30340;&#35299;&#20915;&#20043;&#36947; </P>
<P>&nbsp; </P>
<P>&#20108;&#12289;&#27809;&#26377;Device Tree&#30340;ARM linux&#26159;&#22914;&#20309;&#36816;&#36716;&#30340;&#65311; </P>
<P>&#25105;&#26366;&#32463;porting&#20869;&#26680;&#21040;&#20004;&#20010;ARM-based&#30340;&#24179;&#21488;&#19978;&#12290;&#19968;&#20010;&#26159;&#23567;&#30340;&#33455;&#29255;&#20844;&#21496;&#30340;&#24212;&#29992;&#22788;&#29702;&#22120;&#65292;&#20844;&#21496;&#33258;&#24049;&#36141;&#20080;&#20102;CPU core&#65292;&#35813;CPU core&#20351;&#29992;ARM&#20860;&#23481;&#30340;&#25351;&#20196;&#38598;&#65288;&#20294;&#19981;&#26159;ARM&#65289;&#21152;&#19978;&#21508;&#31181;&#20844;&#21496;&#33258;&#34892;&#35774;&#35745;&#30340;&#22810;&#23186;&#20307;&#22806;&#35774;&#25972;&#21512;&#25104;&#20844;&#21496;&#30340;&#20135;&#21697;&#36827;&#34892;&#38144;&#21806;&#12290;&#32780;&#25105;&#30340;&#20219;&#21153;&#23601;&#26159;porting 2.4.18&#20869;&#26680;&#21040;&#35813;&#24179;&#21488;&#19978;&#12290;&#22312;&#40657;&#30333;&#23631;&#24149;&#30340;&#25163;&#26426;&#26102;&#20195;&#65292;&#37027;&#39063;AP&#65288;application process&#65289;&#25903;&#25345;&#20102;&#24425;&#23631;&#12289;camera&#12289;JPEG&#30828;&#20214;&#21152;&#36895;&#12289;2D/3D&#21152;&#36895;&#12289;MMC/SD&#21345;&#12289;&#21508;&#31181;&#38899;&#39057;&#21152;&#36895;&#65288;&#20869;&#32622;DSP&#65289;&#31561;&#31561;&#29305;&#24615;&#65292;&#21151;&#33021;&#24378;&#22823;&#21040;&#26080;&#27861;&#30452;&#35270;&#12290;&#21478;&#22806;&#19968;&#27425;&#31227;&#26893;&#32463;&#21382;&#26159;&#35753;2.6.23&#20869;&#26680;&#36305;&#22312;&#19968;&#20010;&#22823;&#20844;&#21496;&#30340;&#20919;&#38376;BP&#65288;baseband processor&#65289;&#19978;&#12290;&#20855;&#20307;porting&#30340;&#26041;&#27861;&#26159;&#24456;&#31616;&#21333;&#30340;&#65306; </P>
<P>1&#12289;&#33258;&#24049;&#25776;&#20889;&#19968;&#20010;bootloader&#24182;&#20256;&#36882;&#36866;&#24403;&#30340;&#21442;&#25968;&#32473;kernel&#12290;&#38500;&#20102;&#20256;&#32479;&#30340;command line&#20197;&#21450;tag list&#20043;&#31867;&#30340;&#65292;&#26368;&#37325;&#35201;&#30340;&#26159;&#30003;&#35831;&#19968;&#20010;machine type&#65292;&#24403;&#25343;&#21040;&#23646;&#20110;&#33258;&#24049;&#39033;&#30446;&#30340;machine type ID&#30340;&#26102;&#20505;&#65292;&#24403;&#26102;&#24515;&#24773;&#38592;&#36291;&#65292;&#20284;&#20046;&#33258;&#24049;&#24050;&#32463;&#26159;&#24320;&#28304;&#31038;&#21306;&#30340;&#19968;&#20221;&#23376;&#20102;&#65288;&#20854;&#23454;&#24403;&#26102;&#26159;&#26377;&#24847;&#24895;&#65292;&#25110;&#32773;&#35828;&#26377;&#30446;&#26631;&#26159;&#24819;&#23558;&#22823;&#23478;&#30340;&#20195;&#30721;&#24182;&#20837;&#21040;linux kernel main line&#30340;&#65289;&#12290; </P>
<P>2&#12289;&#22312;&#20869;&#26680;&#30340;arch/arm&#30446;&#24405;&#19979;&#24314;&#31435;mach-xxx&#30446;&#24405;&#65292;&#36825;&#20010;&#30446;&#24405;&#19979;&#65292;&#25918;&#20837;&#35813;SOC&#30340;&#30456;&#20851;&#20195;&#30721;&#65292;&#20363;&#22914;&#20013;&#26029;controller&#30340;&#20195;&#30721;&#65292;&#26102;&#38388;&#30456;&#20851;&#30340;&#20195;&#30721;&#65292;&#20869;&#23384;&#26144;&#23556;&#65292;&#30561;&#30496;&#30456;&#20851;&#30340;&#20195;&#30721;&#31561;&#31561;&#12290;&#27492;&#22806;&#65292;&#26368;&#37325;&#35201;&#30340;&#26159;&#24314;&#31435;&#19968;&#20010;board specific&#25991;&#20214;&#65292;&#23450;&#20041;&#19968;&#20010;machine&#30340;&#23439;&#65306; </P>
<BLOCKQUOTE>
<P>MACHINE_START(project name, "xxx&#20844;&#21496;&#30340;xxx&#30828;&#20214;&#24179;&#21488;") <BR>&nbsp;&nbsp;&nbsp; .phys_io&nbsp;&nbsp;&nbsp; = 0x40000000, <BR>&nbsp;&nbsp;&nbsp; .boot_params&nbsp;&nbsp;&nbsp; = 0xa0000100,&nbsp;&nbsp; <BR>&nbsp;&nbsp;&nbsp; .io_pg_offst&nbsp;&nbsp;&nbsp; = (io_p2v(0x40000000) &gt;&gt; 18) &amp; 0xfffc, <BR>&nbsp;&nbsp;&nbsp; .map_io&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; = xxx_map_io, <BR>&nbsp;&nbsp;&nbsp; .init_irq&nbsp;&nbsp;&nbsp; = xxx_init_irq, <BR>&nbsp;&nbsp;&nbsp; .timer&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; = &amp;xxx_timer, <BR>&nbsp;&nbsp;&nbsp; .init_machine&nbsp;&nbsp;&nbsp; = xxx_init, <BR>MACHINE_END </P></BLOCKQUOTE>
<P>&#22312;xxx_init&#20989;&#25968;&#20013;&#65292;&#19968;&#33324;&#20250;&#21152;&#20837;&#24456;&#22810;&#30340;platform device&#12290;&#22240;&#27492;&#65292;&#20276;&#38543;&#36825;&#20010;board specific&#25991;&#20214;&#20013;&#26159;&#22823;&#37327;&#30340;&#38745;&#24577;table&#65292;&#25551;&#36848;&#20102;&#21508;&#31181;&#30828;&#20214;&#35774;&#22791;&#20449;&#24687;&#12290; </P>
<P>3&#12289;&#35843;&#36890;&#20102;system level&#30340;driver&#65288;timer&#65292;&#20013;&#26029;&#22788;&#29702;&#65292;clock&#31561;&#65289;&#20197;&#21450;&#20018;&#21475;terminal&#20043;&#21518;&#65292;linux kernel&#22522;&#26412;&#26159;&#21487;&#20197;&#36215;&#26469;&#20102;&#65292;&#21518;&#32493;&#21508;&#31181;driver&#19981;&#26029;&#30340;&#28155;&#21152;&#65292;&#30452;&#21040;&#31995;&#32479;&#36719;&#20214;&#25903;&#25345;&#25152;&#26377;&#30340;&#30828;&#20214;&#12290; </P>
<P>&#32508;&#19978;&#25152;&#36848;&#65292;&#22312;linux kernel&#20013;&#25903;&#25345;&#19968;&#20010;SOC&#24179;&#21488;&#20854;&#23454;&#26159;&#38750;&#24120;&#31616;&#21333;&#30340;&#65292;&#35753;linux kernel&#22312;&#19968;&#20010;&#29305;&#23450;&#30340;&#24179;&#21488;&#19978;&#8220;&#36305;&#8221;&#36215;&#26469;&#20063;&#26159;&#38750;&#24120;&#31616;&#21333;&#30340;&#65292;&#38382;&#39064;&#30340;&#37325;&#28857;&#26159;&#22914;&#20309;&#20248;&#38597;&#30340;&#8221;&#36305;&#8221;&#12290; </P>
<P>&nbsp; </P>
<P>&#19977;&#12289;&#28151;&#20081;&#30340;ARM architecture&#20195;&#30721;&#21644;&#23384;&#22312;&#30340;&#38382;&#39064; </P>
<P>&#27599;&#27425;&#27491;&#24335;&#30340;linux kernel release&#20043;&#21518;&#37117;&#20250;&#26377;&#20004;&#21608;&#30340;merge window&#65292;&#22312;&#36825;&#20010;&#31383;&#21475;&#26399;&#38388;&#65292;kernel&#21508;&#20010;&#37096;&#20998;&#30340;&#32500;&#25252;&#32773;&#37117;&#20250;&#25552;&#20132;&#21508;&#33258;&#30340;patch&#65292;&#23558;&#33258;&#24049;&#27979;&#35797;&#31283;&#23450;&#30340;&#20195;&#30721;&#35831;&#27714;&#24182;&#20837;kernel main line&#12290;&#27599;&#21040;&#36825;&#20010;&#26102;&#20505;&#65292;Linus&#23601;&#20250;&#27604;&#36739;&#32321;&#24537;&#65292;&#20182;&#38656;&#35201;&#20174;&#21508;&#20010;&#20869;&#26680;&#32500;&#25252;&#32773;&#30340;&#20998;&#25903;&#19978;&#21462;&#24471;&#26368;&#26032;&#20195;&#30721;&#24182;merge&#21040;&#33258;&#24049;&#30340;kernel source tree&#20013;&#12290;Tony Lindgren&#65292;&#20869;&#26680;OMAP development tree&#30340;&#32500;&#25252;&#32773;&#65292;&#21457;&#36865;&#20102;&#19968;&#20010;&#37038;&#20214;&#32473;Linus&#65292;&#35831;&#27714;&#25552;&#20132;OMAP&#24179;&#21488;&#20195;&#30721;&#20462;&#25913;&#65292;&#24182;&#32473;&#20986;&#20102;&#19968;&#20123;&#32454;&#33410;&#25551;&#36848;&#65306; </P>
<P>1&#12289;&#31616;&#21333;&#20171;&#32461;&#26412;&#27425;&#25913;&#21160; </P>
<P>2&#12289;&#20851;&#20110;&#22914;&#20309;&#35299;&#20915;merge conficts&#12290;&#26377;&#20123;git mergetool&#23601;&#21487;&#20197;&#22788;&#29702;&#65292;&#19981;&#33021;&#22788;&#29702;&#30340;&#65292;&#32473;&#20986;&#20102;&#35814;&#32454;&#20171;&#32461;&#21644;&#35299;&#20915;&#26041;&#26696; </P>
<P>&#19968;&#20999;&#37117;&#24456;&#24179;&#24120;&#65292;&#20063;&#32473;&#20986;&#20102;&#36275;&#22815;&#30340;&#20449;&#24687;&#65292;&#28982;&#32780;&#65292;&#27491;&#26159;&#36825;&#20010;pull request&#24341;&#21457;&#20102;&#19968;&#22330;&#38024;&#23545;ARM linux&#30340;&#20869;&#26680;&#20195;&#30721;&#30340;&#20105;&#35770;&#12290;&#25105;&#30456;&#20449;Linus&#19968;&#23450;&#26159;&#23545;ARM&#30456;&#20851;&#30340;&#20195;&#30721;&#26089;&#23601;&#19981;&#29245;&#20102;&#65292;ARM&#30340;merge&#24037;&#20316;&#37327;&#36739;&#22823;&#20498;&#22312;&#20854;&#27425;&#65292;&#20027;&#35201;&#26159;&#20182;&#35748;&#20026;ARM&#24456;&#22810;&#30340;&#20195;&#30721;&#37117;&#26159;&#22403;&#22334;&#65292;&#20195;&#30721;&#37324;&#38754;&#26377;&#33509;&#24178;&#24858;&#34850;&#30340;table&#65292;&#32780;&#22810;&#20010;&#20154;&#22312;&#32500;&#25252;&#36825;&#20010;table&#65292;&#20174;&#32780;&#23548;&#33268;&#20102;&#20914;&#31361;&#12290;&#22240;&#27492;&#65292;&#22312;&#22788;&#29702;&#23436;OMAP&#30340;pull request&#20043;&#21518;&#65288;Linus&#24182;&#38750;&#38024;&#23545;OMAP&#24179;&#21488;&#65292;&#21482;&#26159;Tony Lindgren&#25758;&#22312;&#26538;&#21475;&#19978;&#20102;&#65289;&#65292;&#20182;&#21457;&#20986;&#20102;&#24594;&#21564;&#65306; </P>
<BLOCKQUOTE><PRE>Gaah. Guys, this whole ARM thing is a f*cking pain in the ass.</PRE></BLOCKQUOTE>
<P>&#36127;&#36131;ARM linux&#24320;&#21457;&#30340;Russell King&#33080;&#19978;&#25346;&#19981;&#20303;&#65292;&#36827;&#34892;&#20102;&#21453;&#39539;&#65306;&#20107;&#24773;&#27809;&#26377;&#37027;&#20040;&#20005;&#37325;&#65292;&#36825;&#27425;&#30340;merge conficts&#23601;&#26159;OMAP&#21644;IMX/MXC&#20043;&#38388;&#19968;&#28857;&#21327;&#35843;&#30340;&#38382;&#39064;&#65292;&#19981;&#33021;&#25273;&#26432;&#25972;&#20010;ARM linux&#22242;&#38431;&#30340;&#21162;&#21147;&#12290;&#20854;&#20182;&#30340;&#21508;&#20010;ARM&#24179;&#21488;&#32500;&#25252;&#32773;&#20063;&#21152;&#20837;&#35752;&#35770;&#65306;ARM&#24179;&#21488;&#22914;&#20309;&#22797;&#26434;&#65292;&#22914;&#20309;&#24222;&#22823;&#65292;&#23545;&#20110;arm linux code&#25105;&#20204;&#24050;&#32463;&#26377;&#19968;&#20123;&#24605;&#32771;&#65292;&#27491;&#22312;&#36827;&#34892;&#20013;&#8230;&#8230;&#19968;&#26102;&#38388;&#65292;&#35752;&#35770;&#30340;&#27668;&#27675;&#26377;&#20123;&#23574;&#38160;&#65292;&#20294;&#24635;&#20307;&#26159;&#22374;&#35802;&#21644;&#21451;&#22909;&#30340;&#12290; </P>
<P>&#23545;&#20110;&#19968;&#20214;&#20107;&#24773;&#65292;&#19981;&#21516;&#23618;&#27425;&#30340;&#20154;&#26377;&#19981;&#21516;&#23618;&#27425;&#30340;&#24605;&#32771;&#12290;&#36825;&#27425;&#20105;&#35770;&#28041;&#21450;&#30340;&#20154;&#21253;&#25324;&#65306; </P>
<P>1&#12289;&#20869;&#26680;&#32500;&#25252;&#32773;&#65288;CPU&#20307;&#31995;&#32467;&#26500;&#26080;&#20851;&#30340;&#20195;&#30721;&#65289; </P>
<P>2&#12289;&#32500;&#25252;ARM&#31995;&#32479;&#32467;&#26500;&#20195;&#30721;&#30340;&#20154; </P>
<P>3&#12289;&#32500;&#25252;ARM sub architecture&#30340;&#20154;&#65288;&#26469;&#33258;&#21508;&#20010;ARM SOC vendor&#65289; </P>
<P>&#32500;&#25252;ARM sub architecture&#30340;&#20154;&#24182;&#27809;&#26377;&#24378;&#28872;&#30340;&#20351;&#21629;&#24863;&#65292;&#20316;&#20026;&#20844;&#21496;&#30340;&#19968;&#21592;&#65292;&#20182;&#20204;&#26368;&#22823;&#30340;&#30446;&#26631;&#26159;&#20197;&#26368;&#24555;&#30340;&#36895;&#24230;&#25903;&#25345;&#33258;&#24049;&#20844;&#21496;&#30340;SOC&#65292;&#23613;&#24555;&#30340;&#21344;&#39046;&#24066;&#22330;&#12290;&#36825;&#20123;&#20154;&#30340;&#36719;&#20214;&#21151;&#21147;&#26410;&#24517;&#24378;&#65292;&#23545;linux kernel&#30340;&#29702;&#35299;&#26410;&#24517;&#28145;&#20837;&#65288;&#26377;&#20123;&#20154;&#21487;&#33021;&#24456;&#24378;&#65292;&#20294;&#26159;&#20154;&#22312;&#27743;&#28246;&#36523;&#19981;&#30001;&#24049;&#65289;&#12290;&#22312;&#36825;&#26679;&#30340;&#24773;&#20917;&#19979;&#65292;&#24456;&#22810;SOC specific&#30340;&#20195;&#30721;&#37117;&#26159;&#36890;&#36807;copy and paste&#65292;&#28982;&#21518;&#31245;&#21152;&#20462;&#25913;&#20195;&#30721;&#23601;&#25552;&#20132;&#20102;&#12290;&#27492;&#22806;&#65292;&#21508;&#20010;ARM vendor&#30340;SOC family&#26159;&#19968;&#38271;&#20018;&#30340;CPU list&#65292;&#27599;&#20010;CPU&#22810;&#22810;&#23569;&#23569;&#26377;&#20123;&#19981;&#21516;&#65292;&#36825;&#26102;&#20505;&#65283;ifdef&#23601;&#20805;&#26021;&#20102;&#21508;&#20010;&#28304;&#20195;&#30721;&#20013;&#65292;&#35753;ARM mach-&#21644;plat-&#30446;&#24405;&#19979;&#30340;&#20195;&#30721;&#26377;&#20123;&#19981;&#24525;&#30452;&#35270;&#12290; </P>
<P>&#20316;&#20026;&#32500;&#25252;ARM&#20307;&#31995;&#32467;&#26500;&#30340;&#20154;&#65292;&#20854;&#33021;&#21147;&#19981;&#23481;&#32622;&#30097;&#12290;&#20197;Russell King&#20026;&#39318;&#30340;team&#24456;&#22909;&#30340;&#32500;&#25252;&#20102;ARM&#20307;&#31995;&#32467;&#26500;&#30340;&#20195;&#30721;&#12290;&#22522;&#26412;&#19978;&#65292;&#38500;&#20102;mach-&#21644;plat-&#30446;&#24405;&#65292;&#20854;&#20182;&#30340;&#30446;&#24405;&#20013;&#30340;&#20195;&#30721;&#21644;&#30446;&#24405;&#32452;&#32455;&#26159;&#24456;&#22909;&#30340;&#12290;&#20316;&#20026;ARM linux&#30340;&#32500;&#25252;&#32773;&#65292;&#32500;&#25252;&#19968;&#20010;&#19981;&#26029;&#26377;&#26032;&#30340;SOC&#21152;&#20837;&#30340;CPU architecture code&#30340;&#30830;&#26159;&#19968;&#20010;&#25361;&#25112;&#12290;&#22312;Intel X86&#30340;&#26550;&#26500;&#19968;&#32479;&#22825;&#19979;&#30340;&#26102;&#20505;&#65292;&#20219;&#20309;&#24819;&#27491;&#38754;&#25915;&#20987;Intel&#30340;&#23545;&#25163;&#37117;&#36133;&#19979;&#38453;&#26469;&#12290;&#24819;&#35201;&#20987;&#20498;&#24040;&#20154;&#65288;&#25110;&#32773;&#35828;&#24819;&#35201;&#21644;&#24040;&#20154;&#24182;&#23384;&#65289;&#24517;&#39035;&#21478;&#36767;&#36426;&#24452;&#12290;ARM&#30340;&#31574;&#30053;&#26377;&#20004;&#20010;&#65292;&#19968;&#20010;&#26159;focus&#22312;&#23884;&#20837;&#24335;&#24212;&#29992;&#19978;&#65292;&#20063;&#23601;&#24847;&#21619;&#30528;&#35201;&#27714;&#20302;&#21151;&#32791;&#65292;&#21516;&#26102;&#20063;&#36991;&#20813;&#20102;&#21644;Intel&#30340;&#27491;&#38754;&#23545;&#25239;&#12290;&#21478;&#22806;&#19968;&#20010;&#23601;&#26159;&#21338;&#37319;&#20247;&#23478;&#20043;&#38271;&#65292;&#37319;&#29992;license IP&#30340;&#26041;&#24335;&#65292;&#35753;&#26356;&#22810;&#30340;&#21378;&#21830;&#21152;&#20837;ARM&#24314;&#31435;&#30340;&#29983;&#24577;&#31995;&#32479;&#12290;&#27627;&#26080;&#30097;&#38382;&#65292;ARM&#20844;&#21496;&#26159;&#25104;&#21151;&#30340;&#65292;&#20294;&#26159;&#36825;&#31181;&#27169;&#24335;&#20063;&#32473;ARM linux&#30340;&#32500;&#25252;&#32773;&#24102;&#26469;&#20102;&#22121;&#26790;&#12290;&#36234;&#26469;&#36234;&#22810;&#30340;&#33455;&#29255;&#21378;&#21830;&#21152;&#20837;ARM&#38453;&#33829;&#65292;&#36234;&#26469;&#36234;&#22810;&#30340;ARM platform&#30456;&#20851;&#30340;&#20195;&#30721;&#34987;&#21152;&#20837;&#21040;&#20869;&#26680;&#65292;&#19981;&#21516;&#21378;&#21830;&#30340;&#21608;&#36793;HW block&#35774;&#35745;&#21448;&#21508;&#19981;&#30456;&#21516;&#8230;&#8230; </P>
<P>&#20869;&#26680;&#32500;&#25252;&#32773;&#26159;&#30495;&#27491;&#23545;&#25805;&#20316;&#31995;&#32479;&#20869;&#26680;&#36719;&#20214;&#26377;&#28145;&#20837;&#29702;&#35299;&#30340;&#20154;&#65292;&#20182;&#20204;&#24448;&#24448;&#33021;&#31449;&#22312;&#26356;&#39640;&#30340;&#23618;&#27425;&#19978;&#21435;&#35266;&#23519;&#38382;&#39064;&#65292;&#21457;&#29616;&#38382;&#39064;&#12290;Linus&#27880;&#24847;&#21040;&#27599;&#27425;merge window&#20013;&#65292;ARM&#30340;&#20195;&#30721;&#21464;&#21270;&#22823;&#32422;&#21344;&#25972;&#20010;ARCH&#30446;&#24405;&#30340;60&#65285;&#65292;&#20182;&#35748;&#20026;&#36825;&#26159;&#19968;&#20010;&#24456;&#26126;&#26174;&#30340;&#31526;&#21495;&#65292;&#24847;&#21619;&#30528;ARM linux&#30340;&#20195;&#30721;&#21487;&#33021;&#23384;&#22312;&#38382;&#39064;&#12290;&#20854;&#23454;&#65292;60&#65285;&#36825;&#20010;&#27604;&#29575;&#30340;&#30830;&#24456;&#22840;&#24352;&#65292;&#22240;&#20026;unicore32&#26159;&#22312;2.6.39 merge window&#20013;&#31532;&#19968;&#27425;&#20840;&#26032;&#25552;&#20132;&#65292;&#23427;&#30340;&#20195;&#30721;&#26159;&#20840;&#26032;&#30340;&#65292;&#20294;&#26159;&#20854;&#20195;&#30721;&#21464;&#21270;&#22823;&#32422;&#21344;&#25972;&#20010;ARCH&#30446;&#24405;&#30340;9.6&#65285;&#65288;&#38656;&#35201;&#25552;&#21450;&#30340;&#26159;unicore32&#26159;&#19968;&#20010;&#20013;&#22269;&#33455;&#65289;&#12290;&#26377;&#20123;&#32500;&#25252;ARM linux&#30340;&#20154;&#35748;&#20026;&#36825;&#26159;CPU&#24066;&#22330;&#21344;&#29992;&#29575;&#30340;&#20307;&#29616;&#65292;&#19981;&#26159;&#38382;&#39064;&#65292;&#30452;&#21040;&#20869;&#26680;&#32500;&#25252;&#32773;&#36148;&#20986;&#23454;&#38469;&#30340;&#20195;&#30721;&#24182;&#25351;&#20986;&#38382;&#39064;&#25152;&#22312;&#12290;&#20869;&#26680;&#32500;&#25252;&#32773;&#24403;&#28982;&#24819;linux kernel&#25903;&#25345;&#26356;&#22810;&#30340;&#30828;&#20214;&#24179;&#21488;&#65292;&#20294;&#26159;&#20182;&#20204;&#26356;&#24895;&#24847;&#20026;linux kernel&#21046;&#23450;&#26356;&#38271;&#36828;&#30340;&#35268;&#21010;&#12290;&#20363;&#22914;&#65306;&#23545;&#20110;&#21508;&#31181;&#32321;&#26434;&#30340;ARM&#24179;&#21488;&#65292;&#29992;&#19968;&#20010;kernel image&#26469;&#25903;&#25345;&#12290; </P>
<P>&#32463;&#36807;&#20105;&#35770;&#65292;&#30830;&#23450;&#30340;&#38382;&#39064;&#22914;&#19979;&#65306; </P>
<P>1&#12289;ARM linux&#32570;&#23569;platform&#65288;&#21508;&#20010;ARM sub architecture&#65292;&#25110;&#32773;&#35828;&#21508;&#20010;SOC&#65289;&#20043;&#38388;&#30340;&#21327;&#35843;&#65292;&#23548;&#33268;arm linux&#30340;&#20195;&#30721;&#26377;&#37325;&#22797;&#12290;&#20540;&#24471;&#19968;&#25552;&#30340;&#26159;&#22312;&#26412;&#27425;&#20105;&#35770;&#20043;&#21069;&#65292;ARM&#32500;&#25252;&#32773;&#24050;&#32463;&#36827;&#34892;&#20102;&#19981;&#23569;&#30456;&#20851;&#30340;&#24037;&#20316;&#65288;&#20363;&#22914;PM&#21644;clock tree&#65289;&#26469;&#25277;&#35937;&#30456;&#21516;&#30340;&#21151;&#33021;&#27169;&#22359;&#12290; </P>
<P>2&#12289;ARM linux&#20013;&#22823;&#37327;&#30340;board specific&#30340;&#28304;&#20195;&#30721;&#24212;&#35813;&#36386;&#20986;kernel&#65292;&#21542;&#21017;&#36825;&#20123;&#22403;&#22334;&#20195;&#30721;&#21644;table&#20250;&#24433;&#21709;linux kernel&#30340;&#38271;&#26399;&#30446;&#26631;&#12290; </P>
<P>3&#12289;&#21508;&#20010;sub architecture&#30340;&#32500;&#25252;&#32773;&#30452;&#25509;&#25552;&#20132;&#32473;Linux&#24182;&#20837;&#20027;&#32447;&#30340;&#26426;&#21046;&#32570;&#20047;&#23618;&#27425;&#12290; </P>
<P>&nbsp; </P>
<P>&#22235;&#12289;&#26032;&#20869;&#26680;&#30340;&#35299;&#20915;&#20043;&#36947; </P>
<P>&#38024;&#23545;ARM linux&#30340;&#29616;&#29366;&#65292;&#26368;&#38656;&#35201;&#35299;&#20915;&#30340;&#26159;&#20154;&#21592;&#38382;&#39064;&#65292;&#20063;&#23601;&#26159;&#22914;&#20309;&#25972;&#21512;ARM sub architecture&#65288;&#21508;&#20010;ARM Vendor&#65289;&#30340;&#36164;&#28304;&#12290;&#22240;&#27492;&#65292;&#20869;&#26680;&#31038;&#21306;&#25104;&#31435;&#20102;&#19968;&#20010;ARM sub architecture&#30340;team&#65292;&#35813;team&#20027;&#35201;&#36127;&#36131;&#21327;&#35843;&#21508;&#20010;ARM&#21378;&#21830;&#30340;&#20195;&#30721;&#65288;not ARM core part&#65289;&#65292;Russell King&#32487;&#32493;&#36127;&#36131;ARM core part&#30340;&#20195;&#30721;&#12290;&#27492;&#22806;&#65292;&#24314;&#31435;&#19968;&#20010;ARM platform consolidation tree&#12290;ARM sub architecture team&#36127;&#36131;review&#21508;&#20010;sub architecture&#32500;&#25252;&#32773;&#25552;&#20132;&#30340;&#20195;&#30721;&#65292;&#24182;&#22312;ARM platform consolidation tree&#19978;&#32500;&#25252;&#12290;&#22312;&#19979;&#19968;&#20010;merge window&#21040;&#26469;&#30340;&#26102;&#20505;&#65292;&#23558;patch&#21457;&#36865;&#32473;Linus&#12290; </P>
<P>&#38024;&#23545;&#37325;&#22797;&#30340;&#20195;&#30721;&#38382;&#39064;&#65292;&#22914;&#26524;&#19981;&#21516;&#30340;SOC&#20351;&#29992;&#20102;&#30456;&#21516;&#30340;IP block&#65288;&#20363;&#22914;I2C controller&#65289;&#65292;&#37027;&#20040;&#36825;&#20010;driver&#30340;code&#35201;&#20174;&#21508;&#20010;arch/arm/mach-xxx&#20013;&#29420;&#31435;&#20986;&#26469;&#65292;&#21464;&#25104;&#19968;&#20010;&#36890;&#29992;&#30340;&#27169;&#22359;&#20379;&#21508;&#20010;SOC specific&#30340;&#27169;&#22359;&#20351;&#29992;&#12290;&#31227;&#21160;&#21040;&#21738;&#20010;&#30446;&#24405;&#21602;&#65311;&#23545;&#20110;I2C&#25110;&#32773;USB OTG&#32780;&#35328;&#65292;&#36825;&#20123;HW block&#30340;&#39537;&#21160;&#24403;&#28982;&#24212;&#35813;&#31227;&#21160;&#21040;kernel/drivers&#30446;&#24405;&#12290;&#22240;&#20026;&#65292;&#23545;&#20110;&#36825;&#20123;&#22806;&#35774;&#65292;&#21487;&#33021;&#26159;in-chip&#65292;&#20063;&#21487;&#33021;&#26159;off-chip&#30340;&#65292;&#20294;&#26159;&#23545;&#20110;&#36719;&#20214;&#32780;&#35328;&#65292;&#23427;&#20204;&#26159;&#27809;&#26377;&#24046;&#21035;&#30340;&#65288;&#25110;&#32773;&#35828;&#22909;&#30340;&#36719;&#20214;&#25277;&#35937;&#24212;&#35813;&#25513;&#30422;&#24213;&#23618;&#30828;&#20214;&#30340;&#19981;&#21516;&#65289;&#12290;&#23545;&#20110;&#37027;&#20123;system level&#30340;code&#21602;&#65311;&#20363;&#22914;clock control&#12289;interrupt control&#12290;&#20854;&#23454;&#36825;&#20123;&#20063;&#19981;&#26159;ARM-specific&#65292;&#24212;&#35813;&#23646;&#20110;linux kernel&#30340;&#26680;&#24515;&#20195;&#30721;&#65292;&#24212;&#35813;&#25918;&#21040;linux/kernel&#30446;&#24405;&#19979;&#65292;&#23646;&#20110;core-Linux-kernel frameworks&#12290;&#24403;&#28982;&#23545;&#20110;ARM&#24179;&#21488;&#65292;&#20063;&#38656;&#35201;&#20445;&#23384;&#19968;&#20123;&#21644;framework&#20132;&#20114;&#30340;code&#65292;&#36825;&#20123;code&#21483;&#20570;ARM SoC core architecture code&#12290;OK&#65292;&#24635;&#32467;&#19968;&#19979;&#65306; </P>
<P>1&#12289;ARM&#30340;&#26680;&#24515;&#20195;&#30721;&#20173;&#28982;&#20445;&#23384;&#22312;arch/arm&#30446;&#24405;&#19979; </P>
<P>2&#12289;ARM SoC core architecture code&#20445;&#23384;&#22312;arch/arm&#30446;&#24405;&#19979; </P>
<P>3&#12289;ARM SOC&#30340;&#21608;&#36793;&#22806;&#35774;&#27169;&#22359;&#30340;&#39537;&#21160;&#20445;&#23384;&#22312;drivers&#30446;&#24405;&#19979; </P>
<P>4&#12289;ARM SOC&#30340;&#29305;&#23450;&#20195;&#30721;&#22312;arch/arm/mach-xxx&#30446;&#24405;&#19979; </P>
<P>5&#12289;ARM SOC board specific&#30340;&#20195;&#30721;&#34987;&#31227;&#38500;&#65292;&#30001;Device Tree&#26426;&#21046;&#26469;&#36127;&#36131;&#20256;&#36882;&#30828;&#20214;&#25299;&#25169;&#21644;&#30828;&#20214;&#36164;&#28304;&#20449;&#24687;&#12290; </P>
<P>OK&#65292;&#32456;&#20110;&#26469;&#21040;&#20102;Device Tree&#20102;&#12290;&#26412;&#36136;&#19978;&#65292;Device Tree&#25913;&#21464;&#20102;&#21407;&#26469;&#29992;hardcode&#26041;&#24335;&#23558;HW &#37197;&#32622;&#20449;&#24687;&#23884;&#20837;&#21040;&#20869;&#26680;&#20195;&#30721;&#30340;&#26041;&#27861;&#65292;&#25913;&#29992;bootloader&#20256;&#36882;&#19968;&#20010;DB&#30340;&#24418;&#24335;&#12290;&#23545;&#20110;&#22522;&#20110;ARM CPU&#30340;&#23884;&#20837;&#24335;&#31995;&#32479;&#65292;&#25105;&#20204;&#20064;&#24815;&#20110;&#38024;&#23545;&#27599;&#19968;&#20010;platform&#36827;&#34892;&#20869;&#26680;&#30340;&#32534;&#35793;&#12290;&#20294;&#26159;&#38543;&#30528;ARM&#22312;&#28040;&#36153;&#31867;&#30005;&#23376;&#19978;&#30340;&#24191;&#27867;&#24212;&#29992;&#65288;&#29978;&#33267;&#26700;&#38754;&#31995;&#32479;&#12289;&#26381;&#21153;&#22120;&#31995;&#32479;&#65289;&#65292;&#25105;&#20204;&#26399;&#26395;ARM&#33021;&#22815;&#35937;X86&#37027;&#26679;&#29992;&#19968;&#20010;kernel image&#26469;&#25903;&#25345;&#22810;&#20010;platform&#12290;&#22312;&#36825;&#31181;&#24773;&#20917;&#19979;&#65292;&#22914;&#26524;&#25105;&#20204;&#35748;&#20026;kernel&#26159;&#19968;&#20010;black box&#65292;&#37027;&#20040;&#20854;&#36755;&#20837;&#21442;&#25968;&#24212;&#35813;&#21253;&#25324;&#65306; </P>
<P>1&#12289;&#35782;&#21035;platform&#30340;&#20449;&#24687; </P>
<P>2&#12289;runtime&#30340;&#37197;&#32622;&#21442;&#25968; </P>
<P>3&#12289;&#35774;&#22791;&#30340;&#25299;&#25169;&#32467;&#26500;&#20197;&#21450;&#29305;&#24615; </P>
<P>&#23545;&#20110;&#23884;&#20837;&#24335;&#31995;&#32479;&#65292;&#22312;&#31995;&#32479;&#21551;&#21160;&#38454;&#27573;&#65292;bootloader&#20250;&#21152;&#36733;&#20869;&#26680;&#24182;&#23558;&#25511;&#21046;&#26435;&#36716;&#20132;&#32473;&#20869;&#26680;&#65292;&#27492;&#22806;&#65292;&#36824;&#38656;&#35201;&#25226;&#19978;&#36848;&#30340;&#19977;&#20010;&#21442;&#25968;&#20449;&#24687;&#20256;&#36882;&#32473;kernel&#65292;&#20197;&#20415;kernel&#21487;&#20197;&#26377;&#36739;&#22823;&#30340;&#28789;&#27963;&#24615;&#12290;&#22312;linux kernel&#20013;&#65292;Device Tree&#30340;&#35774;&#35745;&#30446;&#26631;&#23601;&#26159;&#22914;&#27492;&#12290; </P>
<P><BR></P>
<P><EM><SPAN style="COLOR: rgb(128,128,128)">&#21407;&#21019;&#25991;&#31456;&#65292;&#36716;&#21457;&#35831;&#27880;&#26126;&#20986;&#22788;&#12290;&#34583;&#31389;&#31185;&#25216;</SPAN></EM>&#65292;<A href="http://www.wowotech.net/linux_kenrel/why-dt.html" target=_blank>www.wowotech.net</A>&#12290;