<FONT color=#080000 face=&#24494;&#36719;&#38597;&#40657;>
<P style="TEXT-INDENT: 21pt; MARGIN: 0cm 0cm 0pt" class=MsoNormal><FONT size=3><FONT color=#000000><SPAN style="FONT-FAMILY: &#23435;&#20307;; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-fareast-font-family: &#23435;&#20307;; mso-fareast-theme-font: minor-fareast; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin">&#38745;&#24577;&#25991;&#26723;&#30340;&#26368;&#22823;&#20248;&#28857;&#26159;&#31616;&#21333;&#12290;&#30001;&#20110;</SPAN><SPAN lang=EN-US><FONT face=Calibri>HTML</FONT></SPAN><SPAN style="FONT-FAMILY: &#23435;&#20307;; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-fareast-font-family: &#23435;&#20307;; mso-fareast-theme-font: minor-fareast; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin">&#26159;&#19968;&#31181;&#25490;&#29256;&#35821;&#35328;&#65292;&#22240;&#27492;&#38745;&#24577;&#25991;&#26723;&#21487;&#20197;&#30001;&#19981;&#25026;&#31243;&#24207;&#35774;&#35745;&#30340;&#20154;&#21592;&#26469;&#21019;&#24314;&#12290;&#20294;&#38745;&#24577;&#25991;&#26723;&#30340;&#32570;&#28857;&#26159;&#19981;&#22815;&#28789;&#27963;&#12290;&#24403;&#20449;&#24687;&#21464;&#21270;&#26102;&#23601;&#35201;&#30001;&#25991;&#26723;&#30340;&#20316;&#32773;&#25163;&#24037;&#23545;&#25991;&#26723;&#36827;&#34892;&#20462;&#25913;&#12290;&#21487;&#35265;&#65292;&#21464;&#21270;&#39057;&#32321;&#30340;&#25991;&#26723;&#19981;&#36866;&#20110;&#20570;&#25104;&#38745;&#24577;&#25991;&#26723;&#12290;</SPAN><SPAN lang=EN-US><?xml:namespace prefix = o ns = "urn:schemas-microsoft-com:office:office" /><o:p></o:p></SPAN></FONT></FONT></P>
<P style="TEXT-INDENT: 21pt; MARGIN: 0cm 0cm 0pt" class=MsoNormal><FONT size=3><FONT color=#000000><SPAN style="FONT-FAMILY: &#23435;&#20307;; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-fareast-font-family: &#23435;&#20307;; mso-fareast-theme-font: minor-fareast; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin">&#21160;&#24577;&#25991;&#26723;</SPAN><SPAN lang=EN-US><FONT face=Calibri>({dynamic document)</FONT></SPAN><SPAN style="FONT-FAMILY: &#23435;&#20307;; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-fareast-font-family: &#23435;&#20307;; mso-fareast-theme-font: minor-fareast; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin">&#26159;&#25351;&#25991;&#26723;&#30340;&#20869;&#23481;&#26159;&#22312;&#27983;&#35272;&#22120;&#35775;&#38382;&#19975;&#32500;&#32593;&#26381;&#21153;&#22120;&#26102;&#25165;&#30001;&#24212;&#29992;&#31243;&#24207;&#21160;&#24577;&#21019;&#24314;&#12290;&#24403;&#27983;&#35272;&#22120;&#35831;&#27714;&#21040;&#36798;&#26102;&#65292;&#19975;&#32500;&#32593;&#26381;&#21153;&#22120;&#35201;&#36816;&#34892;&#21478;&#19968;&#20010;&#24212;&#29992;&#31243;&#24207;&#65292;&#24182;&#25226;&#25511;&#21046;&#36716;&#31227;&#21040;&#27492;&#24212;&#29992;&#31243;&#24207;&#12290;&#25509;&#30528;&#65292;&#35813;&#24212;&#29992;&#31243;&#24207;&#23545;&#27983;&#35272;&#22120;&#21457;&#26469;&#30340;&#25968;&#25454;&#36827;&#34892;&#22788;&#29702;&#65292;&#24182;&#36755;&#20986;</SPAN><SPAN lang=EN-US><FONT face=Calibri>HTTP</FONT></SPAN><SPAN style="FONT-FAMILY: &#23435;&#20307;; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-fareast-font-family: &#23435;&#20307;; mso-fareast-theme-font: minor-fareast; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin">&#26684;&#24335;&#30340;&#25991;&#26723;&#65292;&#19975;&#32500;&#32593;&#26381;&#21153;&#22120;&#25226;&#24212;&#29992;&#31243;&#24207;&#30340;&#36755;&#20986;&#20316;&#20026;&#23545;&#27983;&#35272;&#22120;&#30340;&#21709;&#24212;&#12290;&#30001;&#20110;&#23545;&#27983;&#35272;&#22120;&#27599;&#27425;&#35831;&#27714;&#30340;&#21709;&#24212;&#37117;&#26159;&#20020;&#26102;&#29983;&#25104;&#30340;&#65292;&#22240;&#27492;&#29992;&#25143;&#36890;&#36807;&#21160;&#24577;&#25991;&#26723;&#25152;&#30475;&#21040;&#30340;&#20869;&#23481;&#26159;&#19981;&#26029;&#21464;&#21270;&#30340;&#12290;&#21160;&#24577;&#25991;&#26723;&#30340;&#20027;&#35201;&#20248;&#28857;&#26159;&#20855;&#26377;&#25253;&#21578;&#24403;&#21069;&#26368;&#26032;&#20449;&#24687;&#30340;&#33021;&#21147;&#12290;&#20363;&#22914;&#65292;&#21160;&#24577;&#25991;&#26723;&#21487;&#29992;&#26469;&#25253;&#21578;&#32929;&#24066;&#34892;&#24773;&#12289;&#22825;&#27668;&#39044;&#25253;&#25110;&#27665;&#33322;&#21806;&#31080;&#24773;&#20917;&#31561;&#20869;&#23481;&#12290;&#20294;&#21160;&#24577;&#25991;&#26723;&#30340;&#21019;&#24314;&#38590;&#24230;&#27604;&#38745;&#24577;&#25991;&#26723;&#30340;&#39640;&#65292;&#22240;&#20026;&#21160;&#24577;&#25991;&#26723;&#30340;&#24320;&#21457;&#19981;&#26159;&#30452;&#25509;&#32534;&#20889;&#25991;&#26723;&#26412;&#36523;&#65292;&#32780;&#26159;&#32534;&#20889;&#29992;&#20110;&#29983;&#25104;&#25991;&#26723;&#30340;&#24212;&#29992;&#31243;&#24207;&#65292;&#36825;&#23601;&#35201;&#27714;&#21160;&#24577;&#25991;&#26723;&#30340;&#24320;&#21457;&#20154;&#21592;&#24517;&#39035;&#20250;&#32534;&#31243;&#65292;&#32780;&#25152;&#32534;&#20889;&#30340;&#31243;&#24207;&#36824;&#35201;&#36890;&#36807;&#22823;&#33539;&#22260;&#30340;&#27979;&#35797;&#65292;&#20197;&#20445;&#35777;&#36755;&#20837;&#30340;&#26377;&#25928;&#24615;&#12290;</SPAN><SPAN lang=EN-US><o:p></o:p></SPAN></FONT></FONT></P>
<P style="TEXT-INDENT: 21pt; MARGIN: 0cm 0cm 0pt" class=MsoNormal><FONT size=3><FONT color=#000000><SPAN style="FONT-FAMILY: &#23435;&#20307;; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-fareast-font-family: &#23435;&#20307;; mso-fareast-theme-font: minor-fareast; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin">&#21160;&#24577;&#25991;&#26723;&#21644;&#38745;&#24577;&#25991;&#26723;&#20043;&#38388;&#30340;&#20027;&#35201;&#24046;&#21035;&#20307;&#29616;&#22312;&#26381;&#21153;&#22120;&#19968;&#31471;&#12290;&#36825;&#20027;&#35201;&#26159;&#25991;&#26723;&#20869;&#23481;&#30340;&#29983;&#25104;&#26041;&#27861;&#19981;&#21516;&#12290;&#32780;&#20174;&#27983;&#35272;&#22120;&#30340;&#35282;&#24230;&#30475;&#65292;&#36825;&#20004;&#31181;&#25991;&#26723;&#24182;&#27809;&#26377;&#21306;&#21035;&#12290;&#21160;&#24577;&#25991;&#26723;&#21644;&#38745;&#24577;&#25991;&#26723;&#30340;&#20869;&#23481;&#37117;&#36981;&#24490;</SPAN><SPAN lang=EN-US><FONT face=Calibri>HTML</FONT></SPAN><SPAN style="FONT-FAMILY: &#23435;&#20307;; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-fareast-font-family: &#23435;&#20307;; mso-fareast-theme-font: minor-fareast; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin">&#25152;&#35268;&#23450;&#30340;&#26684;&#24335;&#65292;&#27983;&#35272;&#22120;&#20165;&#26681;&#25454;&#22312;&#23631;&#24149;&#19978;&#30475;&#21040;&#30340;&#20869;&#23481;&#24182;&#26080;&#27861;&#21028;&#23450;&#26381;&#21153;&#22120;&#36865;&#26469;&#30340;&#26159;&#21738;&#19968;&#31181;&#25991;&#26723;&#65292;&#21482;&#26377;&#25991;&#26723;&#30340;&#24320;&#21457;&#32773;&#25165;&#30693;&#36947;&#12290;</SPAN><SPAN lang=EN-US><o:p></o:p></SPAN></FONT></FONT></P>
<P style="TEXT-INDENT: 21pt; MARGIN: 0cm 0cm 0pt" class=MsoNormal><FONT size=3><FONT color=#000000><SPAN style="FONT-FAMILY: &#23435;&#20307;; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-fareast-font-family: &#23435;&#20307;; mso-fareast-theme-font: minor-fareast; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin">&#20174;&#20197;&#19978;&#25152;&#36848;&#21487;&#20197;&#30475;&#20986;&#65292;&#35201;&#23454;&#29616;&#21160;&#24577;&#25991;&#26723;&#23601;&#24517;&#39035;&#22312;&#20197;&#19979;&#20004;&#20010;&#26041;&#38754;&#23545;&#19975;&#32500;&#32593;&#26381;&#21153;&#22120;&#30340;&#21151;&#33021;&#36827;&#34892;&#25193;&#20805;</SPAN><SPAN lang=EN-US><FONT face=Calibri>:<o:p></o:p></FONT></SPAN></FONT></FONT></P>
<P style="TEXT-INDENT: 21pt; MARGIN: 0cm 0cm 0pt" class=MsoNormal><FONT size=3><FONT color=#000000><SPAN lang=EN-US><FONT face=Calibri>(1)</FONT></SPAN><SPAN style="FONT-FAMILY: &#23435;&#20307;; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-fareast-font-family: &#23435;&#20307;; mso-fareast-theme-font: minor-fareast; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin">&#24212;&#22686;&#21152;&#21478;&#19968;&#20010;&#24212;&#29992;&#31243;&#24207;&#65292;&#29992;&#26469;&#22788;&#29702;&#27983;&#35272;&#22120;&#21457;&#26469;&#30340;&#25968;&#25454;&#65292;&#24182;&#21019;&#24314;&#21160;&#24577;&#25991;&#26723;&#12290;</SPAN><SPAN lang=EN-US><o:p></o:p></SPAN></FONT></FONT></P>
<P style="TEXT-INDENT: 21pt; MARGIN: 0cm 0cm 0pt" class=MsoNormal><FONT size=3><FONT color=#000000><SPAN lang=EN-US><FONT face=Calibri>(2)</FONT></SPAN><SPAN style="FONT-FAMILY: &#23435;&#20307;; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-fareast-font-family: &#23435;&#20307;; mso-fareast-theme-font: minor-fareast; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin">&#24212;&#22686;&#21152;&#19968;&#20010;&#26426;&#21046;&#65292;&#29992;&#26469;&#20351;&#19975;&#32500;&#32593;&#26381;&#21153;&#22120;&#23558;&#27983;&#35272;&#22120;&#21457;&#26469;&#30340;&#25968;&#25454;&#20256;&#36865;&#32473;&#36825;&#20010;&#24212;&#29992;&#31243;&#24207;&#65292;</SPAN><SPAN lang=EN-US><o:p></o:p></SPAN></FONT></FONT></P>
<P style="TEXT-INDENT: 21pt; MARGIN: 0cm 0cm 0pt" class=MsoNormal><FONT size=3><FONT color=#000000><SPAN style="FONT-FAMILY: &#23435;&#20307;; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-fareast-font-family: &#23435;&#20307;; mso-fareast-theme-font: minor-fareast; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin">&#28982;&#21518;&#19975;&#32500;&#32593;&#26381;&#21153;&#22120;&#33021;&#22815;&#35299;&#37322;&#36825;&#20010;&#24212;&#29992;&#31243;&#24207;&#30340;&#36755;&#20986;&#65292;&#24182;&#21521;&#27983;&#35272;&#22120;&#36820;&#22238;</SPAN><SPAN lang=EN-US><FONT face=Calibri>HTML</FONT></SPAN><SPAN style="FONT-FAMILY: &#23435;&#20307;; mso-ascii-font-family: Calibri; mso-ascii-theme-font: minor-latin; mso-fareast-font-family: &#23435;&#20307;; mso-fareast-theme-font: minor-fareast; mso-hansi-font-family: Calibri; mso-hansi-theme-font: minor-latin">&#25991;&#26723;&#12290;</SPAN><SPAN lang=EN-US><o:p></o:p></SPAN></FONT></FONT></P></FONT>