<DIV><BR>
<BLOCKQUOTE>&#33635;&#35465;&#19981;&#23646;&#20110;&#25209;&#35780;&#32773;&#65307;&#20063;&#19981;&#23646;&#20110;&#37027;&#20123;&#25351;&#20986;&#24378;&#32773;&#22914;&#20309;&#36300;&#20498;&#65292;&#25110;&#34892;&#21160;&#32773;&#22914;&#20309;&#33021;&#22815;&#20570;&#24471;&#26356;&#22909;&#30340;&#20154;&#12290;&#33635;&#35465;&#23646;&#20110;&#37027;&#20123;&#30495;&#27491;&#31449;&#22312;&#31454;&#25216;&#22330;&#20013;&#30340;&#20154;&#65292;&#20182;&#30340;&#33080;&#34987;&#28784;&#23576;&#12289;&#27735;&#27700;&#12289;&#21644;&#34880;&#27745;&#35206;&#30422;&#65307;&#20182;&#21191;&#25954;&#22320;&#22859;&#26007;&#65292;&#29359;&#38169;&#35823;&#65292;&#23649;&#36133;&#23649;&#25112;&#65292;&#22240;&#20026;&#20813;&#20110;&#38169;&#35823;&#21644;&#22833;&#36133;&#30340;&#21162;&#21147;&#26159;&#19981;&#21487;&#33021;&#30340;&#65307;&#20294;&#20182;&#30495;&#27491;&#20184;&#20986;&#21162;&#21147;&#65307;&#20182;&#20102;&#35299;&#20255;&#22823;&#30340;&#28909;&#24773;&#21644;&#28145;&#21051;&#30340;&#22857;&#29486;&#65307;&#20182;&#23558;&#20182;&#30340;&#29983;&#21629;&#29992;&#22312;&#20540;&#24403;&#30340;&#20107;&#19994;&#19978;&#65307;&#22312;&#26368;&#22909;&#30340;&#24773;&#20917;&#19979;&#20182;&#23558;&#20250;&#36798;&#21040;&#32988;&#21033;&#65292;&#32780;&#21363;&#20351;&#20182;&#22833;&#36133;&#65292;&#33267;&#23569;&#20182;&#25112;&#26007;&#21040;&#24213;&#65292;&#25152;&#20197;&#20182;&#30340;&#22320;&#20301;&#23558;&#27704;&#36828;&#39640;&#20110;&#37027;&#20123;&#26082;&#19981;&#30693;&#36947;&#25104;&#21151;&#20063;&#19981;&#30693;&#36947;&#22833;&#36133;&#30340;&#20919;&#28448;&#32780;&#25062;&#24369;&#30340;&#28789;&#39746;&#12290;<BR>&#8212;&#8212;&#35199;&#22885;&#22810;.&#32599;&#26031;&#31119;<BR><BR>It is not the critic who counts; not the man who points out how the strong man stumbles, or where the doer of deeds could have done them better. The credit belongs to the man who is actually in the arena, whose face is marred by dust and sweat and blood; who strives valiantly; who errs, who comes short again and again, because there is no effort without error and shortcoming; but who does actually strive to do the deeds; who knows great enthusiasms, the great devotions; who spends himself in a worthy cause; who at the best knows in the end the triumph of high achievement, and who at the worst, if he fails, at least fails while daring greatly, so that his place shall never be with those cold and timid souls who neither know victory nor defeat. <BR>- T. Roosevelt</BLOCKQUOTE></DIV>