1. static &#21464;&#37327; &#12288;&#12288; 
<P></P>
<P>&#38745;&#24577;&#21464;&#37327;&#30340;&#31867;&#22411; &#35828;&#26126;&#31526;&#26159;static&#12290; &#38745;&#24577;&#21464;&#37327;&#24403;&#28982;&#26159;&#23646;&#20110;&#38745;&#24577;&#23384;&#20648;&#26041;&#24335;&#65292;&#20294;&#26159;&#23646;&#20110;&#38745;&#24577;&#23384;&#20648;&#26041;&#24335;&#30340;&#37327;&#19981;&#19968;&#23450;&#23601;&#26159;&#38745;&#24577;&#21464;&#37327;&#12290; &#20363;&#22914;&#22806;&#37096;&#21464;&#37327;&#34429;&#23646;&#20110;&#38745;&#24577; &#23384;&#20648;&#26041;&#24335;&#65292;&#20294;&#19981;&#19968;&#23450;&#26159;&#38745;&#24577;&#21464;&#37327;&#65292;&#24517;&#39035;&#30001; static&#21152;&#20197;&#23450;&#20041;&#21518;&#25165;&#33021;&#25104;&#20026;&#38745;&#24577;&#22806;&#37096;&#21464;&#37327;&#65292;&#25110;&#31216;&#38745;&#24577;&#20840;&#23616;&#21464;&#37327;&#12290; </P>
<P>2. &#38745;&#24577;&#23616;&#37096;&#21464;&#37327;&#12288;&#12288;</P>
<P>&#38745;&#24577;&#23616;&#37096;&#21464;&#37327;&#23646;&#20110;&#38745;&#24577;&#23384;&#20648;&#26041;&#24335;&#65292;&#23427;&#20855;&#26377;&#20197;&#19979;&#29305;&#28857;&#65306;(1)&#38745;&#24577;&#23616;&#37096;&#21464;&#37327;&#22312;&#20989;&#25968;&#20869;&#23450;&#20041; &#23427;&#30340;&#29983;&#23384;&#26399;&#20026;&#25972;&#20010;&#28304;&#31243;&#24207;&#65292;&#20294;&#26159;&#20854;&#20316;&#29992;&#22495;&#20173;&#19982;&#33258;&#21160;&#21464;&#37327;&#30456;&#21516;&#65292;&#21482;&#33021;&#22312;&#23450;&#20041;&#35813;&#21464;&#37327;&#30340;&#20989;&#25968;&#20869;&#20351;&#29992;&#35813;&#21464;&#37327;&#12290;&#36864;&#20986;&#35813;&#20989;&#25968;&#21518;&#65292; &#23613;&#31649;&#35813;&#21464;&#37327;&#36824;&#32487;&#32493;&#23384;&#22312;&#65292;&#20294;&#19981;&#33021;&#20351;&#29992;&#23427;&#12290;(2)&#20801;&#35768;&#23545;&#26500;&#36896;&#31867;&#38745;&#24577;&#23616;&#37096;&#37327;&#36171;&#21021;&#20540; &#20363;&#22914;&#25968;&#32452;&#65292;&#33509;&#26410;&#36171;&#20197;&#21021;&#20540;&#65292;&#21017;&#30001;&#31995;&#32479;&#33258;&#21160;&#36171;&#20197;0&#20540;&#12290;&#12288;&#12288;(3)&#23545;&#22522;&#26412;&#31867;&#22411;&#30340;&#38745;&#24577;&#23616;&#37096;&#21464;&#37327;&#33509;&#22312;&#35828;&#26126;&#26102;&#26410;&#36171;&#20197;&#21021;&#20540;&#65292;&#21017;&#31995;&#32479;&#33258;&#21160;&#36171;&#20104;0&#20540;&#12290;&#32780;&#23545;&#33258;&#21160;&#21464;&#37327;&#19981;&#36171;&#21021;&#20540;&#65292;&#21017;&#20854;&#20540;&#26159;&#19981;&#23450;&#30340;&#12290; &#26681;&#25454;&#38745;&#24577;&#23616;&#37096;&#21464;&#37327;&#30340;&#29305;&#28857;&#65292; &#21487;&#20197; &#30475;&#20986;&#23427;&#26159;&#19968;&#31181;&#29983;&#23384;&#26399;&#20026;&#25972;&#20010;&#28304;&#31243;&#24207;&#30340;&#37327;&#12290;&#34429;&#28982;&#31163;&#24320;&#23450;&#20041;&#23427;&#30340;&#20989;&#25968;&#21518;&#19981;&#33021;&#20351;&#29992;&#65292;&#20294;&#22914;&#20877;&#27425;&#35843;&#29992;&#23450;&#20041;&#23427;&#30340;&#20989;&#25968;&#26102;&#65292;&#23427;&#21448;&#21487;&#32487;&#32493;&#20351;&#29992;&#65292; &#32780;&#19988;&#20445;&#23384;&#20102;&#21069;&#27425;&#34987;&#35843;&#29992;&#21518;&#30041;&#19979;&#30340; &#20540;&#12290; &#22240;&#27492;&#65292;&#24403;&#22810;&#27425;&#35843;&#29992;&#19968;&#20010;&#20989;&#25968;&#19988;&#35201;&#27714;&#22312;&#35843;&#29992;&#20043;&#38388;&#20445;&#30041;&#26576;&#20123;&#21464;&#37327;&#30340;&#20540;&#26102;&#65292;&#21487;&#32771;&#34385;&#37319;&#29992;&#38745;&#24577;&#23616;&#37096;&#21464;&#37327;&#12290;&#34429;&#28982;&#29992;&#20840;&#23616;&#21464;&#37327;&#20063;&#21487;&#20197;&#36798;&#21040;&#19978;&#36848;&#30446;&#30340;&#65292;&#20294;&#20840;&#23616;&#21464;&#37327;&#26377;&#26102;&#20250;&#36896;&#25104; &#24847;&#22806;&#30340;&#21103;&#20316;&#29992;&#65292;&#22240;&#27492;&#20173;&#20197;&#37319;&#29992;&#23616;&#37096;&#38745;&#24577;&#21464;&#37327;&#20026;&#23452;&#12290;&#12288;&#12288;</P>
<P>3.&#38745;&#24577;&#20840;&#23616;&#21464;&#37327;&#12288;&#12288;</P>
<P>&#20840;&#23616;&#21464;&#37327;(&#22806;&#37096;&#21464;&#37327;)&#30340;&#35828;&#26126;&#20043;&#21069;&#20877;&#20896;&#20197;static &#23601;&#26500; &#25104;&#20102;&#38745;&#24577;&#30340;&#20840;&#23616;&#21464;&#37327;&#12290;&#20840;&#23616;&#21464;&#37327;&#26412;&#36523;&#23601;&#26159;&#38745;&#24577;&#23384;&#20648;&#26041;&#24335;&#65292; &#38745;&#24577;&#20840;&#23616;&#21464;&#37327;&#24403;&#28982;&#20063;&#26159;&#38745;&#24577;&#23384;&#20648;&#26041;&#24335;&#12290; &#36825;&#20004;&#32773;&#22312;&#23384;&#20648;&#26041;&#24335;&#19978;&#24182;&#26080;&#19981;&#21516;&#12290;&#36825;&#20004;&#32773;&#30340;&#21306;&#21035;&#34429;&#22312;&#20110;&#38750;&#38745;&#24577;&#20840;&#23616; &#21464;&#37327;&#30340;&#20316;&#29992;&#22495;&#26159;&#25972;&#20010;&#28304;&#31243;&#24207;&#65292; &#24403;&#19968;&#20010;&#28304;&#31243;&#24207;&#30001;&#22810;&#20010;&#28304;&#25991;&#20214;&#32452;&#25104;&#26102;&#65292;&#38750;&#38745;&#24577;&#30340;&#20840;&#23616;&#21464;&#37327;&#22312;&#21508;&#20010;&#28304;&#25991;&#20214;&#20013;&#37117;&#26159;&#26377;&#25928;&#30340;&#12290; &#32780;&#38745;&#24577;&#20840;&#23616;&#21464;&#37327;&#21017;&#38480;&#21046;&#20102;&#20854;&#20316;&#29992;&#22495;&#65292; &#21363;&#21482;&#22312; &#23450;&#20041;&#35813;&#21464;&#37327;&#30340;&#28304;&#25991;&#20214;&#20869;&#26377;&#25928;&#65292; &#22312;&#21516;&#19968;&#28304;&#31243;&#24207;&#30340;&#20854;&#23427;&#28304;&#25991;&#20214;&#20013;&#19981;&#33021;&#20351;&#29992;&#23427;&#12290;&#30001;&#20110;&#38745;&#24577;&#20840;&#23616;&#21464;&#37327;&#30340;&#20316;&#29992;&#22495;&#23616;&#38480;&#20110;&#19968;&#20010;&#28304;&#25991;&#20214;&#20869;&#65292;&#21482;&#33021;&#20026;&#35813;&#28304;&#25991;&#20214;&#20869;&#30340;&#20989;&#25968;&#20844;&#29992;&#65292; &#22240;&#27492; &#21487;&#20197;&#36991;&#20813;&#22312;&#20854;&#23427;&#28304;&#25991;&#20214;&#20013;&#24341;&#36215;&#38169;&#35823;&#12290;</P>
<P>&#20174;&#20197;&#19978;&#20998;&#26512;&#21487;&#20197;&#30475;&#20986;&#65292; <FONT class=extract>&#25226;&#23616;&#37096;&#21464;&#37327;&#25913;&#21464;&#20026;&#38745;&#24577;&#21464;&#37327;&#21518;&#26159;&#25913;&#21464;&#20102;&#23427;&#30340;&#23384;&#20648;&#26041;&#24335;&#21363;&#25913;&#21464;&#20102;&#23427;&#30340;&#29983;&#23384;&#26399;&#12290;&#25226;&#20840;&#23616;&#21464;&#37327;&#25913;&#21464;&#20026;&#38745;&#24577;&#21464;&#37327; &#21518;&#26159;&#25913;&#21464;&#20102;&#23427;&#30340;&#20316;&#29992;&#22495;&#65292; &#38480;&#21046;&#20102;&#23427;&#30340;&#20351;&#29992;&#33539;&#22260;&#12290;&#22240;&#27492;static &#36825;&#20010;&#35828;&#26126;&#31526;&#22312;&#19981;&#21516;&#30340;&#22320;&#26041;&#25152;&#36215;&#30340;&#20316;&#29992;&#26159;&#19981;&#21516;&#30340;&#12290;</FONT>&#12288;&#12288;</P>
<P>4. static &#20989;&#25968;&#8230;.. &#12288;&#12288;</P>
<P>&#20869;&#37096;&#20989;&#25968;&#21644;&#22806;&#37096;&#20989;&#25968;&#12288;&#12288;</P>
<P>&#24403;&#19968;&#20010;&#28304;&#31243;&#24207;&#30001;&#22810;&#20010;&#28304;&#25991;&#20214;&#32452;&#25104;&#26102;&#65292;&#65315;&#35821;&#35328;&#26681;&#25454;&#20989;&#25968;&#33021;&#21542;&#34987;&#20854;&#23427;&#28304;&#25991;&#20214;&#20013;&#30340;&#20989;&#25968;&#35843;&#29992;&#65292;&#23558;&#20989;&#25968;&#20998;&#20026;&#20869;&#37096;&#20989;&#25968;&#21644;&#22806;&#37096;&#20989;&#25968;&#12290;&#12288;&#12288;</P>
<P>1 &#20869;&#37096;&#20989;&#25968;&#65288;&#21448;&#31216;&#38745;&#24577;&#20989;&#25968;&#65289;&#65306;&#22914;&#26524;&#22312;&#19968;&#20010;&#28304;&#25991;&#20214;&#20013;&#23450;&#20041;&#30340;&#20989;&#25968;&#65292;&#21482;&#33021;&#34987;&#26412;&#25991;&#20214;&#20013;&#30340;&#20989;&#25968;&#35843;&#29992;&#65292;&#32780;&#19981;&#33021;&#34987;&#21516;&#19968;&#31243;&#24207;&#20854;&#23427;&#25991;&#20214;&#20013;&#30340;&#20989;&#25968;&#35843;&#29992;&#65292;&#36825;&#31181;&#20989;&#25968;&#31216;&#20026;&#20869;&#37096;&#20989;&#25968;&#12290;&#12288;&#12288;</P>
<P>&#23450;&#20041;&#19968;&#20010;&#20869;&#37096;&#20989;&#25968;&#65292;&#21482;&#38656;&#22312;&#20989;&#25968;&#31867;&#22411;&#21069;&#20877;&#21152;&#19968;&#20010;&#8220;static&#8221;&#20851;&#38190;&#23383;&#21363;&#21487;&#65292;&#22914;&#19979;&#25152;&#31034;&#65306;&#12288;&#12288;</P>
<P>static &#20989;&#25968;&#31867;&#22411; &#20989;&#25968;&#21517;(&#20989;&#25968;&#21442;&#25968;&#34920;) &#12288;&#12288;</P>
<P>{&#8230;&#8230;} &#12288;&#12288;</P>
<P>&#20851;&#38190;&#23383;&#8220;static&#8221;&#65292;&#35793;&#25104;&#20013;&#25991;&#23601;&#26159;&#8220;&#38745;&#24577;&#30340;&#8221;&#65292;&#25152;&#20197;&#20869;&#37096;&#20989;&#25968;&#21448;&#31216;&#38745;&#24577;&#20989;&#25968;&#12290;&#20294;&#27492;&#22788;&#8220;static&#8221;&#30340;&#21547;&#20041;&#19981;&#26159;&#25351;&#23384;&#20648;&#26041;&#24335;&#65292;&#32780;&#26159;&#25351;&#23545;&#20989;&#25968;&#30340;&#20316;&#29992;&#22495;&#20165;&#23616;&#38480;&#20110;&#26412;&#25991;&#20214;&#12290;&#12288;&#12288;</P>
<P>&#20351;&#29992;&#20869;&#37096;&#20989;&#25968;&#30340;&#22909;&#22788;&#26159;&#65306;&#19981;&#21516;&#30340;&#20154;&#32534;&#20889;&#19981;&#21516;&#30340;&#20989;&#25968;&#26102;&#65292;&#19981;&#29992;&#25285;&#24515;&#33258;&#24049;&#23450;&#20041;&#30340;&#20989;&#25968;&#65292;&#26159;&#21542;&#20250;&#19982;&#20854;&#23427;&#25991;&#20214;&#20013;&#30340;&#20989;&#25968;&#21516;&#21517;&#65292;&#22240;&#20026;&#21516;&#21517;&#20063;&#27809;&#26377;&#20851;&#31995;&#12290;&#12288;&#12288;</P>
<P>2 &#22806;&#37096;&#20989;&#25968;&#12288;&#12288;</P>
<P>&#22806;&#37096;&#20989;&#25968;&#30340;&#23450;&#20041;&#65306;&#22312;&#23450;&#20041;&#20989;&#25968;&#26102;&#65292;&#22914;&#26524;&#27809;&#26377;&#21152;&#20851;&#38190;&#23383;&#8220;static&#8221;&#65292;&#25110;&#20896;&#20197;&#20851;&#38190;&#23383;&#8220;extern&#8221;&#65292;&#34920;&#31034;&#27492;&#20989;&#25968;&#26159;&#22806;&#37096;&#20989;&#25968;&#65306;&#12288;&#12288;</P>
<P>[extern] &#20989;&#25968;&#31867;&#22411; &#20989;&#25968;&#21517;(&#20989;&#25968;&#21442;&#25968;&#34920;) &#12288;&#12288;</P>
<P>{&#8230;&#8230;} &#12288;&#12288;</P>
<P>&#35843;&#29992;&#22806;&#37096;&#20989;&#25968;&#26102;&#65292;&#38656;&#35201;&#23545;&#20854;&#36827;&#34892;&#35828;&#26126;&#65306;&#12288;&#12288;</P>
<P>[extern] &#20989;&#25968;&#31867;&#22411; &#20989;&#25968;&#21517;(&#21442;&#25968;&#31867;&#22411;&#34920;)[&#65292;&#20989;&#25968;&#21517;2(&#21442;&#25968;&#31867;&#22411;&#34920;2)&#8230;&#8230;]&#65307;&#12288;&#12288;</P>
<P>&#26696;&#20363;]&#22806;&#37096;&#20989;&#25968;&#24212;&#29992;&#12290;&#12288;&#12288;</P>
<P>&#65288;1&#65289;&#25991;&#20214;mainf.c &#12288;&#12288;</P>
<P>main() &#12288;&#12288;</P>
<P>{ </P>
<P>extern void input(&#8230;),process(&#8230;),output(&#8230;); &#12288;&#12288;</P>
<P>input(&#8230;); process(&#8230;); output(&#8230;); &#12288;&#12288;</P>
<P>} &#12288;&#12288;</P>
<P>&#65288;2&#65289;&#25991;&#20214;subf1.c &#12288;&#12288;</P>
<P>&#8230;&#8230; &#12288;&#12288;</P>
<P>extern void input(&#8230;&#8230;) /*&#23450;&#20041;&#22806;&#37096;&#20989;&#25968;*/ &#12288;&#12288;</P>
<P>{&#8230;&#8230;} &#12288;&#12288;</P>
<P>&#65288;3&#65289;&#25991;&#20214;subf2.c &#12288;&#12288;</P>
<P>&#8230;&#8230; &#12288;&#12288;</P>
<P>extern void process(&#8230;&#8230;) /*&#23450;&#20041;&#22806;&#37096; &#20989;&#25968;*/ &#12288;&#12288;</P>
<P>{&#8230;&#8230;} &#12288;&#12288;</P>
<P>&#65288;4&#65289;&#25991;&#20214;subf3.c &#12288;&#12288;</P>
<P>&#8230;&#8230; &#12288;&#12288;</P>
<P>extern void output(&#8230;&#8230;) /*&#23450;&#20041;&#22806;&#37096;&#20989;&#25968;*/ &#12288;&#12288;</P>
<P>{&#8230;&#8230;}