<DIV class=entry-header>
<H1>&#20174;&#29702;&#35770;&#21040;&#23454;&#36341;&#65292;&#20840;&#26041;&#20301;&#35748;&#35782;DNS&#65288;&#29702;&#35770;&#31687;&#65289;</H1></DIV>
<DIV class=entry-meta>
<P class=entry-meta-hide-on-mobile>2015/11/07 &#183; <A title="&#26597;&#30475; IT&#25216;&#26415; &#20013;&#30340;&#20840;&#37096;&#25991;&#31456;" href="http://blog.jobbole.com/category/it-tech/" rel="category tag">IT&#25216;&#26415;</A> &#183; <A href="http://blog.jobbole.com/94132/#article-comment">1 &#35780;&#35770; </A>&#183; <A href="http://blog.jobbole.com/tag/dns/">DNS</A>, <A href="http://blog.jobbole.com/tag/%e5%9f%9f%e5%90%8d/">&#22495;&#21517;</A> </P>
<DIV class=jiathis_style style="CLEAR: both; MARGIN: 0px; DISPLAY: block"><SPAN class=jiathis_txt>&#20998;&#20139;&#21040;&#65306;</SPAN> <A title=&#20998;&#20139;&#21040;&#26032;&#28010;&#24494;&#21338; class=jiathis_button_tsina><SPAN class="jiathis_txt jtico jtico_tsina"></SPAN></A><A title=&#20998;&#20139;&#21040;&#24494;&#20449; class=jiathis_button_weixin><SPAN class="jiathis_txt jtico jtico_weixin"></SPAN></A><A title=&#20998;&#20139;&#21040;QQ&#31354;&#38388; class=jiathis_button_qzone><SPAN class="jiathis_txt jtico jtico_qzone"></SPAN></A><A title=&#20998;&#20139;&#21040;Facebook class=jiathis_button_fb><SPAN class="jiathis_txt jtico jtico_fb"></SPAN></A><A title=&#20998;&#20139;&#21040;&#35910;&#29923; class=jiathis_button_douban><SPAN class="jiathis_txt jtico jtico_douban"></SPAN></A><A class=jiathis_button_readitlater></A><A title=&#20998;&#20139;&#21040;EverNote class=jiathis_button_evernote><SPAN class="jiathis_txt jtico jtico_evernote"></SPAN></A><A title=&#20998;&#20139;&#21040;&#26377;&#36947;&#20113;&#31508;&#35760; class=jiathis_button_ydnote><SPAN class="jiathis_txt jtico jtico_ydnote"></SPAN></A><A class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" href="http://www.jiathis.com/share?uid=1745061" target=_blank></A><A class=jiathis_counter_style><SPAN id=jiathis_counter_89 title=&#32047;&#35745;&#20998;&#20139;17&#27425; class="jiathis_button_expanded jiathis_counter jiathis_bubble_style">17</SPAN></A> </DIV></DIV>
<DIV class=entry>
<DIV class=imooc>
<UL>
<LI><A title=CSS&#28145;&#20837;&#29702;&#35299;&#20043;vertical-align href="http://www.imooc.com/view/542?from=jobboleblog" target=_blank>CSS&#28145;&#20837;&#29702;&#35299;&#20043;vertical-align</A> 
<LI><A title="PyConChina 2015 &#20013;&#22269;&#22823;&#20250; &#21271;&#20140;&#22330;" href="http://www.imooc.com/view/532?from=jobboleblog" target=_blank>PyConChina 2015 &#20013;&#22269;&#22823;&#20250; &#21271;&#20140;&#22330;</A> 
<LI><A title=&#21069;&#31471;&#24037;&#31243;&#24072;&#24517;&#22791;&#30340;PS&#25216;&#33021;&#8212;&#8212;&#20999;&#22270;&#31687; href="http://www.imooc.com/view/506?from=jobboleblog" target=_blank>&#21069;&#31471;&#24037;&#31243;&#24072;&#24517;&#22791;&#30340;PS&#25216;&#33021;&#8212;&#8212;&#20999;&#22270;&#31687;</A> 
<LI><A title=iOS-&#20581;&#24247;App&#31995;&#21015;&#20043;&#33026;&#32938;&#20320;&#21435;&#21738;&#20799; href="http://www.imooc.com/view/541?from=jobboleblog" target=_blank>iOS-&#20581;&#24247;App&#31995;&#21015;&#20043;&#33026;&#32938;&#20320;&#21435;&#21738;&#20799;</A></LI></UL></DIV><SPAN style="MARGIN-BOTTOM: 10px; DISPLAY: block"></SPAN>
<DIV class=copyright-area>&#26412;&#25991;&#20316;&#32773;&#65306; <A href="http://blog.jobbole.com/">&#20271;&#20048;&#22312;&#32447;</A> - <A href="http://www.jobbole.com/members/xuelang">selfboot</A> &#12290;&#26410;&#32463;&#20316;&#32773;&#35768;&#21487;&#65292;&#31105;&#27490;&#36716;&#36733;&#65281;<BR>&#27426;&#36814;&#21152;&#20837;&#20271;&#20048;&#22312;&#32447;<A href="http://group.jobbole.com/category/feedback/writer-team/" target=_blank>&#20316;&#32773;&#22242;&#38431;</A>&#12290;</DIV>
<P>&#23545;&#20110; <A href="https://en.wikipedia.org/wiki/Domain_Name_System">DNS(Domain Name System)</A> &#22823;&#23478;&#32943;&#23450;&#19981;&#38476;&#29983;&#65292;&#19981;&#23601;&#26159;&#29992;&#26469;&#23558;&#19968;&#20010;&#32593;&#31449;&#30340;&#22495;&#21517;&#36716;&#25442;&#20026;&#23545;&#24212;&#30340;IP&#21527;&#12290;&#24403;&#25105;&#20204;&#21457;&#29616;&#21487;&#20197;&#19978;QQ&#20294;&#19981;&#33021;&#27983;&#35272;&#32593;&#39029;&#26102;&#65292;&#25105;&#20204;&#20250;&#24819;&#21040;&#21487;&#33021;&#26159;&#22495;&#21517;&#26381;&#21153;&#22120;&#25346;&#25481;&#20102;&#65307;&#24403;&#25105;&#20204;&#29992;&#21035;&#20154;&#25552;&#20379;&#30340;hosts&#25991;&#20214;&#27983;&#35272;&#21040;&#19968;&#20010;&#8220;<CODE>&#19981;&#23384;&#22312;</CODE>&#8221;&#30340;&#32593;&#39029;&#26102;&#65292;&#25105;&#20204;&#20250;&#20102;&#35299;&#21040;&#22495;&#21517;&#35299;&#26512;&#31995;&#32479;&#30340;&#33030;&#24369;&#12290;</P>
<P>&#28982;&#32780;&#20851;&#20110;DNS&#36824;&#26377;&#19968;&#22823;&#22534;&#25925;&#20107;&#20540;&#24471;&#25105;&#20204;&#21435;&#20542;&#21548;&#65292;&#21435;&#24605;&#32771;&#12290;</P>
<H1>DNS &#28304;&#36215;</H1>
<P>&#35201;&#24819;&#35775;&#38382;&#32593;&#32476;&#19978;&#30340;&#19968;&#21488;&#35745;&#31639;&#26426;&#65292;&#25105;&#20204;&#24517;&#39035;&#35201;&#30693;&#36947;&#23427;&#30340;IP&#22320;&#22336;&#65292;&#20294;&#26159;&#36825;&#20123;&#22320;&#22336;&#65288;&#27604;&#22914;243.185.187.39&#65289;&#21482;&#26159;&#19968;&#20018;&#25968;&#23383;&#65292;&#27809;&#26377;&#35268;&#24459;&#65292;&#22240;&#27492;&#25105;&#20204;&#24456;&#38590;&#35760;&#20303;&#12290;&#24182;&#19988;&#22914;&#26524;&#19968;&#21488;&#35745;&#31639;&#26426;&#21464;&#26356;IP&#21518;&#65292;&#23427;&#24517;&#39035;&#36890;&#30693;&#25152;&#26377;&#30340;&#20154;&#12290;</P>
<P>&#26174;&#28982;&#65292;&#30452;&#25509;&#20351;&#29992;IP&#22320;&#22336;&#26159;&#19968;&#20010;&#24858;&#34850;&#30340;&#26041;&#26696;&#12290;&#20110;&#26159;&#20154;&#20204;&#24819;&#20986;&#20102;&#19968;&#20010;&#26367;&#20195;&#30340;&#26041;&#27861;&#65292;&#21363;&#20026;&#27599;&#19968;&#21488;&#35745;&#31639;&#26426;&#36215;&#19968;&#20010;&#21517;&#23383;&#65292;&#28982;&#21518;&#24314;&#31435;&#35745;&#31639;&#26426;&#21517;&#23383;&#21040;&#22320;&#22336;&#30340;&#19968;&#20010;&#26144;&#23556;&#20851;&#31995;&#12290;&#25105;&#20204;&#35775;&#38382;&#35745;&#31639;&#26426;&#30340;&#21517;&#23383;&#65292;&#21097;&#19979;&#30340;&#21517;&#23383;&#21040;&#22320;&#22336;&#30340;&#36716;&#25442;&#36807;&#31243;&#21017;&#30001;&#35745;&#31639;&#26426;&#33258;&#21160;&#23436;&#25104;&#12290;</P>
<H2>hosts&#26144;&#23556;</H2>
<P>&#26089;&#26399;&#65292;&#21517;&#23383;&#21040;&#22320;&#22336;&#30340;&#36716;&#25442;&#36807;&#31243;&#21313;&#20998;&#31616;&#21333;&#12290;&#27599;&#21488;&#35745;&#31639;&#26426;&#20445;&#23384;&#19968;&#20010;<CODE>hosts</CODE>&#25991;&#20214;&#65292;&#37324;&#38754;&#21015;&#20986;&#25152;&#26377;&#35745;&#31639;&#26426;&#21517;&#23383;&#21644;&#23545;&#24212;&#30340;IP&#22320;&#22336;&#65292;&#28982;&#21518;&#23450;&#26399;&#20174;&#19968;&#20010;&#32500;&#25252;&#27492;&#25991;&#20214;&#30340;&#31449;&#28857;&#26356;&#26032;&#37324;&#38754;&#30340;&#35760;&#24405;&#12290;&#24403;&#25105;&#20204;&#35775;&#38382;&#26576;&#20010;&#35745;&#31639;&#26426;&#21517;&#23383;&#26102;&#65292;&#20808;&#22312;hosts&#25991;&#20214;&#25214;&#21040;&#23545;&#24212;&#30340;IP&#65292;&#28982;&#21518;&#23601;&#21487;&#20197;&#24314;&#31435;&#36830;&#25509;&#12290;</P>
<P><IMG alt="" src="http://xuelangzf-github.qiniudn.com/20151105_hosts_local.png"></P>
<P>&#26089;&#26399;&#30340;<A href="https://en.wikipedia.org/wiki/ARPANET">ARPANET</A>&#23601;&#26159;&#36825;&#26679;&#20570;&#30340;&#65292;&#20294;&#26159;&#38543;&#30528;&#32593;&#32476;&#35268;&#27169;&#30340;&#25193;&#22823;&#65292;&#36825;&#31181;&#26041;&#27861;&#28176;&#28176;&#21507;&#19981;&#28040;&#20102;&#12290;&#20027;&#35201;&#26377;&#20197;&#19979;&#19977;&#20010;&#21407;&#22240;&#65306;</P>
<OL>
<LI>hosts&#25991;&#20214;&#21464;&#24471;&#38750;&#24120;&#22823;&#65307; 
<LI>&#20027;&#26426;&#21517;&#23383;&#20250;&#20914;&#31361;&#65307; 
<LI>&#38598;&#20013;&#30340;&#32500;&#25252;&#31449;&#28857;&#20250;&#19981;&#22570;&#37325;&#36127;&#65288;&#38656;&#35201;&#32473;&#20960;&#30334;&#19975;&#26426;&#22120;&#25552;&#20379;hosts&#25991;&#20214;&#65292;&#24819;&#24819;&#23601;&#21487;&#24597;&#65289;&#12290;</LI></OL>
<H2>&#22495;&#21517;&#31995;&#32479;</H2>
<P>&#20026;&#20102;&#35299;&#20915;&#19978;&#38754;&#30340;&#38382;&#39064;&#65292;1983&#24180;<A href="https://en.wikipedia.org/wiki/Paul_Mockapetris">Paul Mockapetris</A>&#25552;&#20986;&#20102;&#22495;&#21517;&#31995;&#32479;&#65288;DNS, Domain Name System)&#65292;&#36825;&#26159;&#19968;&#31181;<STRONG>&#23618;&#27425;&#30340;&#12289;&#22522;&#20110;&#22495;</STRONG>&#30340;&#21629;&#21517;&#26041;&#26696;&#65292;&#24182;&#19988;&#29992;&#19968;&#20010;&#20998;&#24067;&#24335;&#25968;&#25454;&#24211;&#31995;&#32479;&#21152;&#20197;&#23454;&#29616;&#12290;&#24403;&#25105;&#20204;&#38656;&#35201;&#35775;&#38382;&#19968;&#20010;&#22495;&#21517;&#65288;&#20854;&#23454;&#23601;&#26159;&#21069;&#38754;&#35828;&#30340;&#35745;&#31639;&#26426;&#30340;&#21517;&#23383;&#65289;&#26102;&#65292;&#24212;&#29992;&#31243;&#24207;&#20250;&#21521;DNS&#26381;&#21153;&#22120;&#21457;&#36215;&#19968;&#20010;DNS&#35831;&#27714;&#65292;DNS&#26381;&#21153;&#22120;&#36820;&#22238;&#35813;&#22495;&#21517;&#23545;&#24212;&#30340;IP&#22320;&#22336;&#12290;&#36890;&#36807;&#19979;&#38754;&#19977;&#31181;&#25163;&#27573;&#35299;&#20915;&#20102;&#19978;&#38754;&#30340;&#38382;&#39064;&#65306;</P>
<OL>
<LI>&#29992;&#25143;&#35745;&#31639;&#26426;&#19978;&#24182;&#27809;&#26377;&#23384;&#20648;&#25152;&#26377;&#30340;&#21517;&#23383;&#21040;IP&#30340;&#26144;&#23556;&#65292;&#36825;&#26679;&#36991;&#20813;&#20102;hosts&#25991;&#20214;&#36807;&#20110;&#24222;&#22823;&#65288;&#29616;&#22312;&#21508;&#25805;&#20316;&#31995;&#32479;&#20013;hosts&#25991;&#20214;&#40664;&#35748;&#37117;&#26159;&#31354;&#30340;&#65289;&#12290; 
<LI>&#35268;&#23450;&#20102;&#22495;&#21517;&#30340;&#21629;&#21517;&#35268;&#21017;&#65292;&#20445;&#35777;&#20027;&#26426;&#21517;&#23383;&#19981;&#20250;&#37325;&#22797;&#12290; 
<LI>DNS&#26381;&#21153;&#22120;&#19981;&#20877;&#26159;&#21333;&#19968;&#30340;&#19968;&#21488;&#26426;&#22120;&#65292;&#32780;&#26159;&#19968;&#20010;&#23618;&#27425;&#30340;&#12289;&#21512;&#29702;&#32452;&#32455;&#30340;&#26381;&#21153;&#22120;&#38598;&#32676;&#12290;</LI></OL>
<P>&#36825;&#26679;&#35775;&#38382;&#19968;&#20010;&#22495;&#21517;&#30340;&#36807;&#31243;&#21487;&#20197;&#31616;&#21270;&#20026;&#19979;&#22270;&#65306;</P>
<P><IMG alt="" src="http://xuelangzf-github.qiniudn.com/20151105_dns_concept.png"></P>
<H1>DNS &#21327;&#35758;</H1>
<P>&#37027;&#20040;&#22914;&#20309;&#20855;&#20307;&#23454;&#29616;&#36825;&#20010;&#25152;&#35859;&#30340;&#22495;&#21517;&#31995;&#32479;&#21602;&#65292;&#35201;&#30693;&#36947;&#31649;&#29702;&#19968;&#20010;&#36229;&#22823;&#22411;&#24182;&#19988;&#19981;&#26029;&#21464;&#21270;&#30340;&#22495;&#21517;&#21040;IP&#30340;&#26144;&#23556;&#38598;&#21512;&#21487;&#19981;&#26159;&#19968;&#20010;&#31616;&#21333;&#30340;&#20107;&#65292;&#20917;&#19988;&#36824;&#35201;&#21435;&#24212;&#20184;&#25104;&#21315;&#19978;&#19975;&#30340;DNS&#26597;&#35810;&#35831;&#27714;&#12290;&#20154;&#20204;&#26368;&#32456;&#24819;&#20986;&#20102;&#19968;&#22871;&#19981;&#38169;&#30340;&#21327;&#35758;&#65292;&#35268;&#23450;&#22914;&#20309;&#26469;&#23454;&#29616;&#36825;&#20010;&#31995;&#32479;&#65292;&#19979;&#38754;&#25105;&#20204;&#19968;&#36215;&#26469;&#30475;&#30475;&#21543;&#12290;</P>
<H2>&#22495;&#21517;&#31354;&#38388;</H2>
<P>&#39318;&#20808;&#25105;&#20204;&#38656;&#35201;&#21046;&#23450;&#19968;&#22871;&#21629;&#21517;&#35268;&#21017;&#65292;&#38450;&#27490;&#22495;&#21517;&#20986;&#29616;&#37325;&#22797;&#12290;DNS&#20851;&#20110;&#22495;&#21517;&#30340;&#35268;&#21017;&#21644;&#25105;&#20204;&#29983;&#27963;&#20013;&#30340;&#24555;&#36882;&#31995;&#32479;&#31867;&#20284;&#65292;&#20351;&#29992;&#23618;&#27425;&#30340;&#22320;&#22336;&#32467;&#26500;&#12290;&#24555;&#36882;&#31995;&#32479;&#20013;&#35201;&#32473;&#26576;&#20154;&#37038;&#23492;&#29289;&#21697;&#65292;&#22320;&#22336;&#21487;&#33021;&#26159;&#36825;&#26679;&#65306;&#20013;&#22269;&#12289;&#24191;&#19996;&#30465;&#12289;&#24191;&#24030;&#24066;&#12289;&#30058;&#31162;&#21306;&#12289;&#20013;&#23665;&#35199;&#36335;12&#21495; XXX&#12290;&#32780;&#19968;&#20010;&#22495;&#21517;&#30475;&#36215;&#26469;&#21017;&#26159;&#36825;&#26679;&#30340;groups.google.com&#65288;&#20026;&#20160;&#20040;&#19981;&#26159;com.google.groups&#65311;&#25105;&#29468;&#21487;&#33021;&#21644;&#32769;&#22806;&#20889;&#22320;&#22336;&#30340;&#20064;&#24815;&#26377;&#20851;&#65289;&#12290;</P>
<P>&#23545;&#20110;Internet&#26469;&#35828;&#65292;&#22495;&#21517;&#23618;&#27425;&#32467;&#26500;&#30340;&#39030;&#32423;&#65288;&#30456;&#24403;&#20110;&#22269;&#38469;&#24555;&#36882;&#22320;&#22336;&#20013;&#30340;&#22269;&#23478;&#37096;&#20998;&#65289;&#30001;<A href="https://www.icann.org/">ICANN</A>&#65288;&#20114;&#32852;&#32593;&#21517;&#31216;&#19982;&#25968;&#23383;&#22320;&#22336;&#20998;&#37197;&#26426;&#26500;&#65289;&#36127;&#36131;&#31649;&#29702;&#12290;&#30446;&#21069;&#65292;&#24050;&#32463;&#26377;&#36229;&#36807;250&#20010;&#39030;&#32423;&#22495;&#21517;&#65292;&#27599;&#20010;&#39030;&#32423;&#22495;&#21517;&#21487;&#20197;&#36827;&#19968;&#27493;&#21010;&#20026;&#19968;&#20123;&#23376;&#22495;&#65288;&#20108;&#32423;&#22495;&#21517;&#65289;&#65292;&#36825;&#20123;&#23376;&#22495;&#21487;&#34987;&#20877;&#27425;&#21010;&#20998;&#65288;&#19977;&#32423;&#22495;&#21517;&#65289;&#65292;&#20381;&#27492;&#31867;&#25512;&#12290;&#25152;&#26377;&#36825;&#20123;&#22495;&#21517;&#21487;&#20197;&#32452;&#32455;&#25104;&#19968;&#26869;&#26641;&#65292;&#22914;&#19979;&#22270;&#25152;&#31034;&#65288;&#22270;&#29255;&#26469;&#33258;Computer Networks: 7-1 &#65289;&#65306;</P>
<P><IMG alt="" src="http://xuelangzf-github.qiniudn.com/20151105_domain_tree.png"></P>
<H2>&#22495;&#21517;&#36164;&#28304;&#35760;&#24405;</H2>
<P>DNS&#35774;&#35745;&#20043;&#21021;&#26159;&#29992;&#26469;&#24314;&#31435;&#22495;&#21517;&#21040;IP&#22320;&#22336;&#30340;&#26144;&#23556;&#65292;&#29702;&#35770;&#19978;&#23545;&#20110;&#27599;&#19968;&#20010;&#22495;&#21517;&#25105;&#20204;&#21482;&#38656;&#35201;&#22312;&#22495;&#21517;&#26381;&#21153;&#22120;&#19978;&#20445;&#23384;&#19968;&#26465;&#35760;&#24405;&#21363;&#21487;&#12290;&#36825;&#37324;&#30340;&#35760;&#24405;&#19968;&#33324;&#21483;&#20316;&#22495;&#21517;&#36164;&#28304;&#35760;&#24405;&#65292;&#23427;&#26159;&#19968;&#20010;&#20116;&#20803;&#32452;&#65292;&#21487;&#20197;&#29992;&#20197;&#19979;&#26684;&#24335;&#34920;&#31034;&#65306;</P>
<P><CODE>Domain_name Time_to_live Class Type Value</CODE></P>
<P>&#20854;&#20013;&#65306;</P>
<OL>
<LI>Domain_name: &#25351;&#20986;&#36825;&#26465;&#35760;&#24405;&#36866;&#29992;&#20110;&#21738;&#20010;&#22495;&#21517;&#65307; 
<LI><CODE>Time_to_live</CODE>: &#29992;&#26469;&#34920;&#26126;&#35760;&#24405;&#30340;&#29983;&#23384;&#21608;&#26399;&#65292;&#20063;&#23601;&#26159;&#35828;&#26368;&#22810;&#21487;&#20197;&#32531;&#23384;&#35813;&#35760;&#24405;&#22810;&#38271;&#26102;&#38388;&#65288;&#21518;&#38754;&#20250;&#35762;&#21040;&#32531;&#23384;&#26426;&#21046;&#65289;&#65307; 
<LI>Class: &#19968;&#33324;&#24635;&#26159;IN&#65307; 
<LI>Type: &#35760;&#24405;&#30340;&#31867;&#22411;&#65307; 
<LI>Value: &#35760;&#24405;&#30340;&#20540;&#65292;&#22914;&#26524;&#26159;A&#35760;&#24405;&#65292;&#21017;value&#26159;&#19968;&#20010;IPv4&#22320;&#22336;&#12290;</LI></OL>
<P>&#25105;&#20204;&#30475;&#21040;&#22495;&#21517;&#36164;&#28304;&#35760;&#24405;&#26377;&#19968;&#20010;Type&#23383;&#27573;&#65292;&#29992;&#26469;&#34920;&#26126;&#35760;&#24405;&#30340;&#31867;&#22411;&#12290;&#36825;&#26159;&#20026;&#20160;&#20040;&#21602;&#65311;&#22240;&#20026;&#23545;&#20110;&#19968;&#20010;&#22495;&#21517;&#26469;&#35828;&#65292;&#36890;&#24120;&#24182;&#38750;&#21482;&#35760;&#24405;&#20854;IP&#22320;&#22336;&#65292;&#36824;&#21487;&#33021;&#38656;&#35201;&#19968;&#20123;&#20854;&#20182;&#31181;&#31867;&#30340;&#35760;&#24405;&#65292;&#19968;&#20123;&#24120;&#35265;&#30340;&#35760;&#24405;&#31867;&#22411;&#22914;&#19979;&#65306;</P>
<TABLE>
<THEAD>
<TR>
<TH>&#35760;&#24405;&#31867;&#22411;</TH>
<TH>&#21547;&#20041;</TH></TR></THEAD>
<TBODY>
<TR>
<TD>A</TD>
<TD>&#20027;&#26426;&#30340;IPv4&#22320;&#22336;</TD></TR>
<TR>
<TD>AAAA</TD>
<TD>&#20027;&#26426;&#30340;IPv6&#22320;&#22336;</TD></TR>
<TR>
<TD>NS</TD>
<TD>&#35813;&#22495;&#21517;&#25152;&#22312;&#22495;&#30340;&#26435;&#23041;&#22495;&#21517;&#26381;&#21153;&#22120;</TD></TR>
<TR>
<TD>MX</TD>
<TD>&#25509;&#21463;&#29305;&#23450;&#22495;&#21517;&#30005;&#23376;&#37038;&#20214;&#30340;&#26381;&#21153;&#22120;&#22495;&#21517;</TD></TR>
<TR>
<TD>CNAME</TD>
<TD>&#24403;&#21069;&#22495;&#21517;&#30340;&#19968;&#20010;&#21035;&#21517;</TD></TR></TBODY></TABLE>
<P>&#20851;&#20110;&#36825;&#20123;&#22495;&#21517;&#36164;&#28304;&#35760;&#24405;&#30340;&#23454;&#20363;&#25105;&#20204;&#23558;&#22312;&#19979;&#19968;&#31687;&#25991;&#31456;&#65288;&#23454;&#36341;&#31687;&#65289;&#30475;&#21040;&#12290;</P>
<H2>&#22495;&#21517;&#26381;&#21153;&#22120;</H2>
<P>&#25105;&#20204;&#30693;&#36947;&#19981;&#33021;&#21482;&#29992;&#19968;&#21488;&#22495;&#21517;&#26381;&#21153;&#22120;&#26469;&#21709;&#24212;&#25152;&#26377;&#30340;DNS&#26597;&#35810;&#65292;&#22240;&#20026;&#27809;&#26377;&#19968;&#21488;&#26426;&#22120;&#33021;&#22815;&#32473;&#20840;&#29699;&#30340;&#29992;&#25143;&#25552;&#20379;&#26597;&#35810;&#26381;&#21153;&#65292;&#35745;&#31639;&#33021;&#21147;&#12289;&#23384;&#20648;&#12289;&#24102;&#23485;&#37117;&#19981;&#20801;&#35768;&#12290;&#21482;&#33021;&#21512;&#29702;&#32452;&#32455;&#19968;&#20010;&#22495;&#21517;&#26381;&#21153;&#22120;&#38598;&#32676;&#65292;&#20351;&#20182;&#20204;&#21327;&#21516;&#24037;&#20316;&#65292;&#20849;&#21516;&#25552;&#20379;&#22495;&#21517;&#35299;&#26512;&#26381;&#21153;&#12290;&#25509;&#19979;&#26469;&#39318;&#20808;&#35201;&#38754;&#23545;&#30340;&#19968;&#20010;&#38382;&#39064;&#26159;<STRONG>&#22914;&#20309;&#21512;&#29702;&#22320;&#23558;&#25152;&#26377;&#30340;&#22495;&#21517;&#36164;&#28304;&#35760;&#24405;&#23384;&#20648;&#21040;&#19981;&#21516;&#30340;&#22495;&#21517;&#26381;&#21153;&#22120;&#19978;&#12290;</STRONG></P>
<P>&#21069;&#38754;&#35828;&#36807;&#22495;&#21517;&#30340;&#21517;&#23383;&#31354;&#38388;&#21487;&#20197;&#32452;&#32455;&#20026;&#19968;&#26869;&#26641;&#65292;&#36825;&#37324;&#25105;&#20204;&#21487;&#20197;&#36827;&#19968;&#27493;&#23558;&#20854;&#21010;&#20998;&#20026;&#19981;&#37325;&#21472;&#30340;&#21306;&#22495;&#65288;<A href="https://en.wikipedia.org/wiki/DNS_zone">DNS zone</A>&#65289;&#65292;&#38024;&#23545;&#19978;&#22270;&#30340;&#22495;&#21517;&#31354;&#38388;&#65292;&#19968;&#31181;&#21487;&#33021;&#30340;&#22495;&#21517;&#21010;&#20998;&#22914;&#19979;&#22270;&#65306;</P>
<P><IMG alt="" src="http://xuelangzf-github.qiniudn.com/20151105_domain_zone.png"></P>
<P>&#28982;&#21518;&#23558;&#27599;&#20010;&#21306;&#22495;&#19982;&#22810;&#20010;&#22495;&#21517;&#26381;&#21153;&#22120;&#65288;&#20854;&#20013;&#19968;&#20010;&#26159;master&#65292;&#20854;&#20182;slave&#26381;&#21153;&#22120;&#21017;&#29992;&#26469;&#25552;&#20379;&#25968;&#25454;&#22791;&#20221;&#12289;&#21152;&#24555;&#35299;&#26512;&#36895;&#24230;&#12289;&#20445;&#35777;&#26381;&#21153;&#21487;&#29992;&#24615;&#65289;&#20851;&#32852;&#36215;&#26469;&#65292;&#31216;&#36825;&#20123;&#22495;&#21517;&#26381;&#21153;&#22120;&#20026;&#35813;&#21306;&#22495;&#30340;<CODE>&#26435;&#23041;&#22495;&#21517;&#26381;&#21153;&#22120;(Authoritative Name Servers )</CODE>&#65292;&#23427;&#20445;&#23384;&#20004;&#31867;&#22495;&#21517;&#36164;&#28304;&#35760;&#24405;&#65306;</P>
<OL>
<LI>&#35813;&#21306;&#22495;&#20869;&#25152;&#26377;&#22495;&#21517;&#30340;&#22495;&#21517;&#36164;&#28304;&#35760;&#24405;&#12290; 
<LI>&#29238;&#21306;&#22495;&#21644;&#23376;&#21306;&#22495;&#30340;&#22495;&#21517;&#26381;&#21153;&#22120;&#23545;&#24212;&#30340;&#22495;&#21517;&#36164;&#28304;&#35760;&#24405;&#65288;&#20027;&#35201;&#26159;NS&#35760;&#24405;&#65289;&#12290;</LI></OL>
<P>&#36825;&#26679;&#65292;&#25152;&#26377;&#30340;&#22495;&#21517;&#36164;&#28304;&#35760;&#24405;&#37117;&#20445;&#23384;&#22312;&#22810;&#20010;&#22495;&#21517;&#26381;&#21153;&#22120;&#20013;&#65292;&#24182;&#19988;&#25152;&#26377;&#30340;&#22495;&#21517;&#26381;&#21153;&#22120;&#20063;&#32452;&#25104;&#20102;&#19968;&#20010;&#23618;&#27425;&#30340;&#32034;&#24341;&#32467;&#26500;&#65292;&#20415;&#20110;&#25105;&#20204;&#21518;&#38754;&#36827;&#34892;&#22495;&#21517;&#35299;&#26512;&#12290;&#19979;&#38754;&#20197;&#19968;&#20010;&#31616;&#21270;&#30340;&#22495;&#21517;&#31354;&#38388;&#20026;&#20363;&#23376;&#65292;&#35828;&#26126;&#22495;&#21517;&#36164;&#28304;&#35760;&#24405;&#26159;&#22914;&#20309;&#20445;&#23384;&#22312;&#22495;&#21517;&#26381;&#21153;&#22120;&#20013;&#30340;&#65292;&#22914;&#19979;&#22270;a&#65306;</P>
<P><IMG alt="" src="http://xuelangzf-github.qiniudn.com/20151105_name_servers.png"></P>
<P>&#22270;&#20013;&#22495;&#21517;&#31354;&#38388;&#21010;&#20998;&#20026;A, B, C, D, E, F, G&#19971;&#20010;DNS&#21306;&#22495;&#65292;&#27599;&#20010;DNS&#21306;&#22495;&#37117;&#26377;&#22810;&#20010;&#26435;&#23041;&#22495;&#21517;&#26381;&#21153;&#22120;&#65292;&#36825;&#20123;&#22495;&#21517;&#26381;&#21153;&#22120;&#37324;&#38754;&#20445;&#23384;&#20102;&#35768;&#22810;&#22495;&#21517;&#35299;&#26512;&#35760;&#24405;&#12290;&#23545;&#20110;&#19978;&#22270;&#30340;NDS&#21306;&#22495;E&#26469;&#35828;&#65292;&#23427;&#30340;&#26435;&#23041;&#22495;&#21517;&#26381;&#21153;&#22120;&#37324;&#38754;&#20445;&#23384;&#30340;&#35760;&#24405;&#22914;&#22270;&#20013;&#34920;&#26684;&#25152;&#31034;&#12290;</P>
<P>&#20180;&#32454;&#35266;&#23519;&#19978;&#22270;&#20320;&#21487;&#33021;&#20250;&#21457;&#29616;&#21306;&#22495;A&#12289;B&#24182;&#27809;&#26377;&#29238;&#21306;&#22495;&#65292;&#20182;&#20204;&#20043;&#38388;&#24182;&#27809;&#26377;&#19968;&#26465;&#36335;&#24452;&#36830;&#22312;&#19968;&#36215;&#12290;&#36825;&#23558;&#23548;&#33268;&#19968;&#20010;&#24456;&#40635;&#28902;&#30340;&#38382;&#39064;&#65292;&#37027;&#23601;&#26159;&#21306;&#22495;A&#30340;&#26435;&#23041;&#22495;&#21517;&#26381;&#21153;&#22120;&#21487;&#33021;&#26681;&#26412;&#19981;&#30693;&#36947;&#21306;&#22495;B&#30340;&#23384;&#22312;&#12290;&#35748;&#35782;&#21040;&#36825;&#19968;&#28857;&#21518;&#65292;&#20320;&#21487;&#33021;&#20250;&#24819;&#20986;&#19968;&#20010;&#24456;&#33258;&#28982;&#30340;&#35299;&#20915;&#26041;&#26696;&#65292;&#23601;&#26159;&#22312;A&#20013;&#35760;&#24405;B&#22495;&#21517;&#26381;&#21153;&#22120;&#30340;&#22320;&#22336;&#65292;&#21516;&#26102;&#22312;B&#20013;&#35760;&#24405;A&#30340;&#65292;&#36825;&#26679;&#23427;&#20204;&#20004;&#20010;&#23601;&#32852;&#31995;&#36215;&#26469;&#20102;&#12290;&#20294;&#26159;&#32771;&#34385;&#21040;&#25105;&#20204;&#26377;&#36229;&#36807;250&#20010;&#39030;&#32423;&#22495;&#21517;&#65292;&#36825;&#26679;&#20570;&#24182;&#19981;&#26159;&#24456;&#24688;&#24403;&#12290;</P>
<P>&#32780;&#25105;&#20204;&#20351;&#29992;&#30340;&#22495;&#21517;&#31995;&#32479;&#21017;&#37319;&#29992;&#20102;&#19968;&#31181;&#26356;&#21152;&#32874;&#26126;&#30340;&#26041;&#27861;&#65292;&#37027;&#23601;&#26159;&#24341;&#20837;<A href="https://en.wikipedia.org/wiki/Root_name_server">&#26681;&#22495;&#21517;&#26381;&#21153;&#22120;</A>&#65292;&#23427;&#20445;&#23384;&#20102;&#25152;&#26377;&#39030;&#32423;&#21306;&#22495;&#30340;&#26435;&#23041;&#22495;&#21517;&#26381;&#21153;&#22120;&#35760;&#24405;&#12290;&#29616;&#22312;&#36890;&#36807;&#26681;&#22495;&#21517;&#26381;&#21153;&#22120;&#65292;&#25105;&#20204;&#21487;&#20197;&#25214;&#21040;&#25152;&#26377;&#30340;&#39030;&#32423;&#21306;&#22495;&#30340;&#26435;&#23041;&#22495;&#21517;&#26381;&#21153;&#22120;&#65292;&#28982;&#21518;&#23601;&#21487;&#20197;&#24448;&#19979;&#19968;&#32423;&#19968;&#32423;&#25214;&#19979;&#21435;&#20102;&#12290;&#19979;&#22270;&#20026;&#20840;&#29699;&#26681;&#22495;&#21517;&#26381;&#21153;&#22120;&#30340;&#20998;&#24067;&#22270;&#65292;&#21487;&#20197;&#22312;<A href="http://www.root-servers.org/">&#36825;&#37324;</A>&#25214;&#21040;&#12290;</P>
<P><IMG alt="" src="http://xuelangzf-github.qiniudn.com/20151105_root_servers.png"></P>
<P>&#29616;&#22312;&#20026;&#27490;&#65292;&#25105;&#20204;&#30340;&#26435;&#23041;&#22495;&#21517;&#26381;&#21153;&#22120;&#21644;&#26681;&#22495;&#21517;&#26381;&#21153;&#22120;&#20854;&#23454;&#32452;&#25104;&#20102;&#19968;&#20010;&#26641;&#65292;&#26641;&#26681;&#20026;&#26681;&#22495;&#21517;&#26381;&#21153;&#22120;&#65292;&#19979;&#38754;&#27599;&#20010;&#33410;&#28857;&#37117;&#26159;&#19968;&#20010;&#21306;&#22495;&#30340;&#26435;&#23041;&#22495;&#21517;&#26381;&#21153;&#22120;&#65292;&#23545;&#20110;&#22270;a&#20013;&#21508;&#20010;DNS&#21306;&#22495;&#30340;&#26435;&#23041;&#22495;&#21517;&#26381;&#21153;&#22120;&#65292;&#23427;&#20204;&#32452;&#25104;&#20102;&#19979;&#38754;&#36825;&#26869;&#26641;&#65288;<EM>&#23454;&#38469;&#20013;&#65292;&#19968;&#20010;&#26435;&#23041;&#22495;&#21517;&#26381;&#21153;&#22120;&#21487;&#33021;&#20445;&#23384;&#26377;&#22810;&#20010;DNS&#21306;&#22495;&#30340;&#35760;&#24405;&#65292;&#22240;&#27492;&#26435;&#23041;&#22495;&#21517;&#26381;&#21153;&#22120;&#20043;&#38388;&#30340;&#32852;&#31995;&#24182;&#19981;&#26500;&#25104;&#19968;&#26869;&#26641;&#12290;&#36825;&#37096;&#20998;&#30340;&#35814;&#32454;&#20869;&#23481;&#21487;&#20197;&#21442;&#32771;RFC 1034: 4. NAME SERVERS&#12290;&#19979;&#38754;&#20026;&#20102;&#23481;&#26131;&#29702;&#35299;&#65292;&#23558;&#20854;&#31616;&#21270;&#20026;&#19968;&#26869;&#26641;</EM>&#65289;&#65306;</P>
<P><IMG alt="" src="http://xuelangzf-github.qiniudn.com/20151105_servers_tree.png"></P>
<H2>&#22495;&#21517;&#35299;&#26512;</H2>
<P>&#25105;&#20204;&#24050;&#32463;&#26377;&#20102;&#19968;&#20010;&#22495;&#21517;&#26381;&#21153;&#22120;&#38598;&#32676;&#65292;&#35813;&#38598;&#32676;&#21512;&#29702;&#22320;&#20445;&#23384;&#20102;&#22495;&#21517;&#31354;&#38388;&#21644;&#22495;&#21517;&#36164;&#28304;&#35760;&#24405;&#30340;&#23545;&#24212;&#20851;&#31995;&#12290;&#29616;&#22312;&#25105;&#20204;&#35201;&#20570;&#30340;&#23601;&#26159;&#21457;&#36865;&#19968;&#20010;DNS&#35831;&#27714;&#32473;&#22495;&#21517;&#26381;&#21153;&#22120;&#65292;&#28982;&#21518;&#22352;&#31561;&#23427;&#36820;&#22238;&#27491;&#30830;&#30340;&#22495;&#21517;&#36164;&#28304;&#35760;&#24405;&#65292;&#36825;&#20010;&#36807;&#31243;&#21483;&#20316;&#22495;&#21517;&#35299;&#26512;&#12290;</P>
<P>&#20005;&#26684;&#26469;&#35828;&#65292;&#22495;&#21517;&#35299;&#26512;&#30340;&#36807;&#31243;&#26368;&#26089;&#35201;&#36861;&#28335;&#21040;&#24314;&#31435;&#32593;&#32476;&#36830;&#25509;&#12290;&#22240;&#20026;&#27599;&#24403;&#36830;&#25509;&#19978;&#32593;&#32476;&#20043;&#21518;&#65292;&#35745;&#31639;&#26426;&#20250;&#33258;&#21160;&#33719;&#24471;&#19968;&#20010;&#40664;&#35748;&#30340;DNS&#26381;&#21153;&#22120;&#65292;&#24403;&#28982;&#20320;&#20063;&#21487;&#20197;&#29992;&#33258;&#24049;&#20449;&#20219;&#30340;DNS&#26381;&#21153;&#22120;&#65292;&#27604;&#22914;8.8.8.8&#65288;DNS&#26381;&#21153;&#22120;&#20063;&#26377;&#20449;&#20219;&#19981;&#20449;&#20219;&#20043;&#20998;&#65292;&#26159;&#30340;&#65292;&#23454;&#36341;&#31687;&#20250;&#35762;&#21040;&#65289;&#65292;&#25105;&#20204;&#25226;&#36825;&#20010;&#22495;&#21517;&#26381;&#21153;&#22120;&#20063;&#21483;&#20316;<CODE>&#26412;&#22320;&#22495;&#21517;&#26381;&#21153;&#22120;</CODE>&#12290;&#25509;&#19979;&#26469;&#24403;&#25105;&#20204;&#38656;&#35201;&#30693;&#36947;&#19968;&#20010;&#22495;&#21517;&#23545;&#24212;&#30340;&#36164;&#28304;&#35760;&#24405;&#26102;&#65292;&#20250;&#21521;&#26412;&#22320;&#22495;&#21517;&#26381;&#21153;&#22120;&#21457;&#36215;&#35831;&#27714;&#65292;&#22914;&#26524;&#35813;&#22495;&#21517;&#24688;&#22909;&#22312;&#26412;&#22320;&#22495;&#21517;&#26381;&#21153;&#22120;&#25152;&#36758;&#23646;&#30340;&#22495;&#21517;&#21306;&#22495;&#65288;DNS zone&#65289;&#20869;&#65292;&#37027;&#20040;&#21487;&#20197;&#30452;&#25509;&#36820;&#22238;&#35760;&#24405;&#12290;</P>
<P>&#22914;&#26524;&#22312;&#26412;&#22320;&#22495;&#21517;&#26381;&#21153;&#22120;&#27809;&#26377;&#21457;&#29616;&#35813;&#22495;&#21517;&#30340;&#36164;&#28304;&#35760;&#24405;&#65292;&#23601;&#38656;&#35201;&#22312;&#25972;&#20010;&#22495;&#21517;&#31354;&#38388;&#25628;&#32034;&#35813;&#22495;&#21517;&#12290;&#32780;&#25972;&#20010;&#22495;&#21517;&#31354;&#38388;&#30340;&#36164;&#28304;&#35760;&#24405;&#23384;&#20648;&#22312;&#19968;&#20010;&#20998;&#23618;&#30340;&#12289;&#26641;&#29366;&#32852;&#31995;&#30340;&#19968;&#31995;&#21015;&#22495;&#21517;&#26381;&#21153;&#22120;&#19978;&#65292;&#25152;&#20197;&#26412;&#22320;&#22495;&#21517;&#26381;&#21153;&#22120;&#39318;&#20808;&#35201;&#20174;&#26681;&#22495;&#21517;&#26381;&#21153;&#22120;&#24320;&#22987;&#24448;&#19979;&#25628;&#32034;&#12290;&#36825;&#37324;&#26377;&#19968;&#20010;&#38382;&#39064;&#23601;&#26159;<STRONG>&#26412;&#22320;&#22495;&#21517;&#26381;&#21153;&#22120;&#22914;&#20309;&#25214;&#21040;&#26681;&#22495;&#21517;&#26381;&#21153;&#22120;&#22312;&#21738;&#37324;&#21602;&#65311;</STRONG>&#20854;&#23454;&#22495;&#21517;&#26381;&#21153;&#22120;&#21551;&#21160;&#30340;&#26102;&#20505;&#65292;&#23601;&#20250;&#21152;&#36733;&#19968;&#20010;&#37197;&#32622;&#25991;&#20214;&#65292;&#37324;&#38754;&#20445;&#23384;&#20102;&#26681;&#22495;&#21517;&#26381;&#21153;&#22120;&#30340;NS&#35760;&#24405;&#65288;&#35201;&#30693;&#36947;&#26681;&#22495;&#21517;&#26381;&#21153;&#22120;&#22320;&#22336;&#19968;&#33324;&#38750;&#24120;&#31283;&#23450;&#65292;&#19981;&#20250;&#36731;&#26131;&#25913;&#21464;&#65292;&#24182;&#19988;&#25968;&#37327;&#24456;&#23569;&#65292;&#25152;&#20197;&#36825;&#20010;&#37197;&#32622;&#25991;&#20214;&#20250;&#24456;&#23567;&#65289;&#12290;&#25214;&#21040;&#26681;&#22495;&#21517;&#26381;&#21153;&#22120;&#20043;&#21518;&#65292;&#23601;&#21487;&#20197;&#19968;&#32423;&#19968;&#32423;&#22320;&#24448;&#19979;&#26597;&#25214;&#21862;&#12290;</P>
<P>&#20173;&#28982;&#20197;&#25105;&#20204;&#30340;&#22270;a&#20026;&#20363;&#65292;&#29616;&#22312;&#20551;&#35774;&#21306;&#22495;E&#20869;&#30340;&#26576;&#20010;&#29992;&#25143;&#24819;&#35775;&#38382;math.sysu.edu.cn&#65292;&#37027;&#20040;&#35831;&#27714;&#30340;&#36807;&#31243;&#22914;&#19979;&#65306;</P>
<P><IMG alt="" src="http://xuelangzf-github.qiniudn.com/20151105_name_resolution.png"></P>
<P>&#29992;&#35821;&#35328;&#31616;&#21333;&#25551;&#36848;&#22914;&#19979;&#65306;</P>
<OL>
<LI>&#29992;&#25143;&#65306;&#21890;&#65292;&#26412;&#22320;&#22495;&#21517;&#26381;&#21153;&#22120;&#65292;&#21578;&#35785;&#25105;math.sysu.edu.cn&#30340;&#22320;&#22336;&#65307; 
<LI>&#26412;&#22320;&#22495;&#21517;&#26381;&#21153;&#22120;&#65306;&#21710;&#21568;&#65292;&#25105;&#19981;&#30693;&#36947;&#21834;&#65292;&#19981;&#22312;&#25105;&#30340;&#36758;&#21306;&#65292;&#23481;&#25105;&#21435;&#38382;&#38382;&#32769;&#22823;&#21733;&#21543;&#12290;root&#32769;&#22823;&#65292;&#33021;&#21578;&#35785;&#25105;math.sysu.edu.cn&#30340;&#22320;&#22336;&#21527;&#65307; 
<LI>&#26681;&#22495;&#21517;&#26381;&#21153;&#22120;&#65306;&#24537;&#30528;&#21602;&#65292;&#20320;&#21435;&#38382;B&#65288;.cn&#65289;&#65307; 
<LI>&#26412;&#22320;&#22495;&#21517;&#26381;&#21153;&#22120;&#65306;&#21890;&#65292;B&#65292;&#21578;&#35785;&#25105;math.sysu.edu.cn&#30340;&#22320;&#22336;&#65307; 
<LI>B&#65306;&#20320;&#21435;&#38382;D&#65288;.edu.cn&#65289;&#65307; 
<LI>&#26412;&#22320;&#22495;&#21517;&#26381;&#21153;&#22120;&#65306;&#21890;&#65292;D&#65292;&#21578;&#35785;&#25105;math.sysu.edu.cn&#30340;&#22320;&#22336;&#65307; 
<LI>D&#65306;&#20320;&#21435;&#38382;F&#65288;sysu.edu.cn&#65289;&#65307; 
<LI>&#26412;&#22320;&#22495;&#21517;&#26381;&#21153;&#22120;&#65306;&#21890;&#65292;F&#65292;&#21578;&#35785;&#25105;math.sysu.edu.cn&#30340;&#22320;&#22336;&#65307; 
<LI>F&#65306;&#23481;&#32769;&#34930;&#30475;&#30475;&#65292;&#21710;&#21568;&#65292;&#25214;&#21040;&#20102;&#65292;&#26159;X.X.X.X&#65307; 
<LI>&#26412;&#22320;&#22495;&#21517;&#26381;&#21153;&#22120;&#65306;&#36367;&#30772;&#38081;&#38795;&#32456;&#20110;&#25214;&#21040;&#21862;&#65292;&#21890;&#29992;&#25143;&#65292;&#20986;&#26469;&#21834;&#65292;&#25105;&#25214;&#21040;&#20102;&#65292;&#26159;X.X.X.X</LI></OL>
<P>&#20180;&#32454;&#24819;&#24819;&#65292;&#36825;&#21644;&#25105;&#20204;&#37038;&#23492;&#24555;&#36882;&#23454;&#22312;&#26159;&#22914;&#20986;&#19968;&#36761;&#21834;&#65292;&#20551;&#35774;&#20320;&#20174;&#32654;&#22269;&#37038;&#19996;&#35199;&#21040;&#24191;&#24030;&#24066;&#30058;&#31162;&#21306;&#65292;&#39318;&#20808;&#24555;&#36882;&#36865;&#21040;&#20013;&#22269;&#65288;&#19981;&#36807;&#36825;&#37324;&#27809;&#26377;&#19968;&#20010;&#31867;&#20284;&#26681;&#22495;&#21517;&#26381;&#21153;&#22120;&#30340;&#20013;&#36716;&#31449;&#32780;&#24050;&#65289;&#65292;&#28982;&#21518;&#24448;&#19979;&#21040;&#24191;&#19996;&#30465;&#65292;&#25509;&#19979;&#26469;&#26159;&#24191;&#24030;&#24066;&#65292;&#20877;&#24448;&#19979;&#26159;&#30058;&#31162;&#20102;&#12290;</P>
<P>&#19978;&#38754;&#30340;&#26159;&#26412;&#22320;&#22495;&#21517;&#26381;&#21153;&#22120;&#30340;&#36845;&#20195;&#35299;&#26512;&#36807;&#31243;&#65292;&#20854;&#23454;&#20063;&#21487;&#20197;&#36882;&#24402;&#26597;&#35810;&#65292;&#36825;&#37324;&#23601;&#19981;&#35828;&#20102;&#65292;&#36947;&#29702;&#24046;&#19981;&#22810;&#12290;</P>
<H1>&#32531;&#23384;&#26426;&#21046;</H1>
<P>&#29616;&#22312;&#25972;&#20010;&#22495;&#21517;&#31995;&#32479;&#24050;&#32463;&#21487;&#20197;&#20026;&#25105;&#20204;&#25552;&#20379;&#22495;&#21517;&#35299;&#26512;&#26381;&#21153;&#20102;&#65292;&#24403;&#25105;&#20204;&#36755;&#20837;&#22495;&#21517;&#65292;&#35745;&#31639;&#26426;&#21457;&#36865;DNS&#35831;&#27714;&#65292;&#28982;&#21518;DNS&#26381;&#21153;&#22120;&#36820;&#22238;&#32473;&#25105;&#20204;&#35299;&#26512;&#30340;&#32467;&#26524;&#65292;&#19968;&#20999;&#30475;&#36215;&#26469;&#24456;&#23436;&#32654;&#12290;&#28982;&#32780;&#26159;&#19981;&#26159;&#21487;&#20197;&#26356;&#23436;&#32654;&#21602;&#65311;</P>
<P>&#22238;&#39038;&#19968;&#19979;&#24179;&#26102;&#27983;&#35272;&#32593;&#31449;&#30340;&#24773;&#20917;&#65292;&#25105;&#20204;&#20250;&#21457;&#29616;&#20004;&#20010;&#27604;&#36739;&#26377;&#24847;&#24605;&#30340;&#32467;&#35770;&#65306;</P>
<OL>
<LI>80%&#30340;&#26102;&#38388;&#25105;&#20204;&#37117;&#22312;&#30475;&#37027;&#20123;20%&#30340;&#32593;&#31449;&#65292;&#36825;&#23601;&#26159;&#22823;&#21517;&#40718;&#40718;&#30340;<A href="https://en.wikipedia.org/wiki/Pareto_principle">80/20 Rule</A>&#65307; 
<LI>&#25105;&#20204;&#20250;&#22312;&#19968;&#20010;&#32593;&#31449;&#30340;&#19981;&#21516;&#32593;&#39029;&#20043;&#38388;&#36339;&#36716;&#65292;&#20063;&#23601;&#26159;&#19981;&#26029;&#22320;&#35775;&#38382;&#21516;&#19968;&#20010;&#22495;&#21517;&#65292;&#31867;&#20284;&#31243;&#24207;&#35775;&#38382;&#30340;&#23616;&#37096;&#24615;&#21407;&#29702;&#12290;</LI></OL>
<P>&#36825;&#20004;&#26465;&#32467;&#35770;&#24456;&#23481;&#26131;&#35753;&#25105;&#20204;&#32852;&#24819;&#21040;<CODE>&#32531;&#23384;&#26426;&#21046;</CODE>&#12290;&#22914;&#26524;&#25105;&#20204;&#23558;&#24050;&#32463;&#35775;&#38382;&#36807;&#30340;&#37027;&#20123;&#22495;&#21517;&#30340;&#35299;&#26512;&#32467;&#26524;&#32531;&#23384;&#22312;&#33258;&#24049;&#30340;&#35745;&#31639;&#26426;&#19978;&#65292;&#37027;&#20040;&#19979;&#27425;&#35775;&#38382;&#30340;&#26102;&#20505;&#21487;&#20197;&#30452;&#25509;&#35835;&#21462;&#32467;&#26524;&#65292;&#19981;&#29992;&#20877;&#27425;&#37325;&#22797;DNS&#26597;&#35810;&#36807;&#31243;&#65292;&#32473;&#33258;&#24049;&#21644;&#22495;&#21517;&#26381;&#21153;&#22120;&#37117;&#33410;&#30465;&#20102;&#40635;&#28902;&#12290;</P>
<P>&#24403;&#28982;&#65292;&#36825;&#26679;&#20570;&#30340;&#19968;&#20010;&#21069;&#25552;&#26159;&#35201;&#32531;&#23384;&#30340;&#35299;&#26512;&#32467;&#26524;&#19981;&#20250;&#39057;&#32321;&#26356;&#25913;&#65292;&#20063;&#23601;&#26159;&#35828;&#25105;&#21313;&#20998;&#38047;&#21518;&#35299;&#26512;&#19968;&#20010;&#22495;&#21517;&#30340;&#32467;&#26524;&#21644;&#29616;&#22312;&#35299;&#26512;&#30340;&#32467;&#26524;&#26159;&#19968;&#26679;&#30340;&#12290;&#23545;&#22823;&#22810;&#25968;&#22495;&#21517;&#26469;&#35828;&#65292;&#36825;&#37117;&#26159;&#19968;&#20010;&#19981;&#20105;&#30340;&#20107;&#23454;&#12290;&#20294;&#26159;&#38590;&#20813;&#26377;&#19968;&#20123;&#8220;&#21892;&#21464;&#8221;&#30340;&#22495;&#21517;&#65292;&#20182;&#20204;&#21487;&#33021;&#20250;&#39057;&#32321;&#26356;&#25913;&#33258;&#24049;&#30340;&#35299;&#26512;&#32467;&#26524;&#12290;&#20026;&#20102;&#20351;&#32531;&#23384;&#26426;&#21046;&#36866;&#24212;&#36825;&#20004;&#31867;&#24773;&#20917;&#65292;&#25105;&#20204;&#22312;&#22495;&#21517;&#36164;&#28304;&#35760;&#24405;&#37324;&#38754;&#28155;&#21152;&#19968;&#20010;<CODE>Time_to_live</CODE>&#23383;&#27573;&#65292;&#34920;&#26126;&#36825;&#26465;&#35760;&#24405;&#26368;&#22810;&#21487;&#20197;&#32531;&#23384;&#22810;&#20037;&#12290;&#23545;&#20110;&#37027;&#20123;&#8220;&#31283;&#22914;&#27888;&#23665;&#8221;&#30340;&#22495;&#21517;&#65292;&#32473;&#19968;&#20010;&#27604;&#36739;&#22823;&#30340;&#20540;&#65292;&#32780;&#37027;&#20123;&#8220;&#26397;&#19977;&#26286;&#22235;&#8221;&#30340;&#22495;&#21517;&#65292;&#21017;&#21487;&#20197;&#32473;&#23450;&#19968;&#20010;&#23567;&#30340;&#20540;&#12290;</P>
<P>&#25105;&#20204;&#26082;&#28982;&#21487;&#20197;&#22312;&#26412;&#26426;&#21033;&#29992;&#32531;&#23384;&#65292;&#37027;&#20040;&#21487;&#19981;&#21487;&#20197;&#22312;&#22495;&#21517;&#26381;&#21153;&#22120;&#19978;&#20063;&#21033;&#29992;&#32531;&#23384;&#26426;&#21046;&#21602;&#65292;&#31572;&#26696;&#24403;&#28982;&#26159;&#21487;&#20197;&#30340;&#12290;&#22240;&#20026;&#23545;&#20110;&#22495;&#21517;&#26381;&#21153;&#22120;&#26469;&#35828;&#65292;&#19978;&#38754;&#30340;&#20004;&#26465;&#26377;&#24847;&#24605;&#30340;&#32467;&#35770;&#20173;&#28982;&#26377;&#25928;&#12290;&#25152;&#20197;&#65292;&#22495;&#21517;&#26381;&#21153;&#22120;&#21487;&#20197;&#23558;&#37027;&#20123;&#35775;&#38382;&#36807;&#30340;&#22495;&#21517;&#36164;&#28304;&#35760;&#24405;&#32531;&#23384;&#65292;&#29992;&#25143;&#20877;&#27425;&#21457;&#36215;&#35831;&#27714;&#26102;&#65292;&#21487;&#20197;&#30452;&#25509;&#36820;&#22238;&#32531;&#23384;&#32467;&#26524;&#65292;&#19981;&#29992;&#21435;&#36845;&#20195;&#25110;&#32773;&#36882;&#24402;&#35299;&#26512;&#12290;</P>
<P>&#20851;&#20110;DNS&#29702;&#35770;&#37096;&#20998;&#65292;&#26356;&#22810;&#20869;&#23481;&#36824;&#21487;&#20197;&#21442;&#32771;&#36825;&#20004;&#20010;&#25991;&#26412;&#65306;</P>
<UL>
<LI><A href="https://tools.ietf.org/html/rfc1034">RFC 1034: Domain Names &#8211; Concepts and Facilities</A></LI></UL>
<H1>&#24182;&#27809;&#26377;&#32467;&#26463;</H1>
<P>&#19978;&#38754;&#19968;&#22823;&#22534;&#29702;&#35770;&#65292;&#30475;&#19978;&#21435;&#26377;&#28857;&#19981;&#26126;&#25152;&#20197;&#26159;&#21543;&#65292;&#27809;&#20107;&#65292;&#25509;&#19979;&#26469;&#20250;&#32467;&#21512;&#23454;&#36341;&#26469;&#26356;&#21152;&#28165;&#26224;&#22320;&#35748;&#35782;DNS&#36825;&#19968;&#26368;&#22522;&#30784;&#30340;&#31995;&#32479;&#12290;</P>
<P>&#20854;&#23454;&#19981;&#27490;&#26159;DNS&#65292;&#36824;&#26377;HTTPS&#12289;TCP&#12289;UDP&#36825;&#20123;&#24456;&#22522;&#30784;&#30340;&#21327;&#35758;&#65292;&#37117;&#20540;&#24471;&#25105;&#20204;&#38745;&#19979;&#24515;&#21435;&#22909;&#22909;&#35748;&#35782;&#23427;&#20204;&#12290;&#22240;&#20026;&#65292;&#20889;DNS&#20043;&#21069;&#65292;&#25105;&#20197;&#20026;&#25105;&#24050;&#32463;&#23436;&#20840;&#25630;&#26126;&#30333;&#20102;&#23427;&#65292;&#20294;&#26159;&#20889;&#30340;&#36807;&#31243;&#21457;&#29616;&#22909;&#22810;&#22320;&#26041;&#33258;&#24049;&#26681;&#26412;&#23601;&#19981;&#30693;&#36947;&#65292;&#20043;&#21069;&#23436;&#20840;&#26159;&#20572;&#30041;&#22312;&#19968;&#20010;&#24456;&#28014;&#22840;&#30340;&#23618;&#38754;&#19978;&#12290;&#25152;&#20197;&#65292;&#26159;&#26102;&#20505;&#25214;&#26102;&#38388;&#22909;&#22909;&#25226;&#36825;&#20123;&#21327;&#35758;&#36807;&#19968;&#36941;&#65292;&#29992;&#33258;&#24049;&#30340;&#35821;&#35328;&#65292;&#20174;<CODE>&#35299;&#20915;&#38382;&#39064;</CODE>&#30340;&#35282;&#24230;&#65292;&#35760;&#24405;&#19979;&#36825;&#20123;&#32463;&#20856;&#21327;&#35758;&#30340;&#25925;&#20107;&#20102;&#12290;</P></DIV>