<STRONG><SPAN style="FONT-SIZE: 10.5pt; FONT-FAMILY: &#23435;&#20307;; mso-ascii-font-family: Arial; mso-hansi-font-family: Arial; mso-bidi-font-family: Arial"><SPAN class=headers>Title:</SPAN></B><SPAN class=RefText> &#35745;&#31639;&#26426;&#31185;&#23398;</SPAN></FONT></SPAN></STRONG><SPAN style="FONT-SIZE: 10.5pt; mso-ascii-font-family: Arial; mso-hansi-font-family: Arial; mso-bidi-font-family: Arial"><FONT face=&#23435;&#20307;>&#26159;&#25105;&#20204;&#25152;&#20351;&#29992;&#30340;&#25216;&#26415;&#12290;&#20320;&#38656;&#35201;&#36873;&#20462;&#30340;&#21021;&#32423;&#30740;&#31350;&#29983;&#35838;&#31243;&#32943;&#23450;&#19981;&#33021;&#35753;&#20320;&#23545;&#35745;&#31639;&#26426;&#31185;&#23398;&#26377;&#36275;&#22815;&#30340;&#20102;&#35299;&#65292;&#22240;&#27492;&#20320;&#24517;&#39035;&#36890;&#36807;&#38405;&#35835;&#23398;&#20064;&#26356;&#22810;&#30340;&#30693;&#35782;&#12290;&#35745;&#31639;&#26426;&#31185;&#23398;&#25152;&#26377;&#30340;&#39046;&#22495;</FONT></SPAN><SPAN lang=EN-US style="FONT-SIZE: 10.5pt; FONT-FAMILY: 'Arial','sans-serif'">&#8212;&#8212;</SPAN><SPAN style="FONT-SIZE: 10.5pt; mso-ascii-font-family: Arial; mso-hansi-font-family: Arial; mso-bidi-font-family: Arial"><FONT face=&#23435;&#20307;>&#29702;&#35770;&#20307;&#31995;&#32467;&#26500;&#65292;&#31995;&#32479;&#65292;&#35821;&#35328;&#31561;&#31561;</FONT></SPAN><SPAN lang=EN-US style="FONT-SIZE: 10.5pt; FONT-FAMILY: 'Arial','sans-serif'">&#8212;&#8212;</SPAN><FONT face=&#23435;&#20307;><SPAN style="FONT-SIZE: 10.5pt; mso-ascii-font-family: Arial; mso-hansi-font-family: Arial; mso-bidi-font-family: Arial">&#37117;&#26159;&#24517;&#39035;&#23398;&#20064;&#30340;&#12290;</SPAN><SPAN lang=EN-US style="FONT-SIZE: 10.5pt; FONT-FAMILY: 'Arial','sans-serif'"></SPAN></FONT> 
<P></P>
<P><STRONG><SPAN style="FONT-SIZE: 10.5pt; FONT-FAMILY: &#23435;&#20307;; mso-ascii-font-family: Arial; mso-hansi-font-family: Arial; mso-bidi-font-family: Arial">&#25968;&#23398;&#21487;&#33021;&#26159;&#25509;&#19979;&#26469;&#38656;&#35201;&#20102;&#35299;&#30340;&#26368;&#37325;&#35201;&#30340;&#23398;&#31185;</SPAN></STRONG><FONT face=&#23435;&#20307;><SPAN style="FONT-SIZE: 10.5pt; mso-ascii-font-family: Arial; mso-hansi-font-family: Arial; mso-bidi-font-family: Arial">&#12290;&#23545;&#20110;&#24037;&#20316;&#22312;&#35270;&#35273;&#25110;&#32773;&#21307;&#23398;&#22270;&#20687;&#22788;&#29702;&#30340;&#20154;&#26469;&#35828;&#26356;&#20851;&#38190;&#12290;&#23545;&#20110;&#20197;&#31995;&#32479;&#20026;&#20013;&#24515;&#30340;&#24037;&#20316;&#65292;&#34920;&#38754;&#19978;&#30475;&#65292;&#24182;&#19981;&#30456;&#20851;&#65292;&#20294;&#25968;&#23398;&#20250;&#25945;&#20320;&#26377;&#29992;&#30340;&#24605;&#32500;&#26041;&#24335;&#12290;&#20320;&#38656;&#35201;&#33021;&#38405;&#35835;&#23450;&#29702;&#65292;&#22914;&#26524;&#20855;&#26377;&#35777;&#26126;&#23450;&#29702;&#30340;&#33021;&#21147;&#23558;&#20250;&#32473;&#26412;&#39046;&#22495;&#30340;&#22823;&#22810;&#25968;&#20154;&#30041;&#19979;&#28145;&#21051;&#30340;&#21360;&#35937;&#12290;&#24456;&#23569;&#26377;&#20154;&#33021;&#33258;&#23398;&#25968;&#23398;&#65292;&#20809;&#20570;&#20010;&#21548;&#20247;&#26159;&#19981;&#22815;&#30340;&#65292;&#36824;&#24471;&#20570;&#20064;&#39064;&#38598;&#12290;&#23613;&#21487;&#33021;&#26089;&#22320;&#36873;&#20462;&#23613;&#21487;&#33021;&#22810;&#30340;&#25968;&#23398;&#35838;&#65292;&#20854;&#20182;&#39046;&#22495;&#30340;&#35838;&#31243;&#20197;&#21518;&#36873;&#20063;&#24456;&#23481;&#26131;&#12290;&#35745;&#31639;&#26426;&#31185;&#23398;&#26159;&#20197;&#31163;&#25955;&#25968;&#23398;&#20026;&#22522;&#30784;&#30340;&#65306;&#20195;&#25968;&#65292;&#22270;&#35770;&#65292;&#31561;&#31561;&#12290;&#22914;&#26524;&#20320;&#35201;&#20174;&#20107;&#25512;&#29702;&#26041;&#38754;&#30340;&#24037;&#20316;&#65292;&#36923;&#36753;&#26159;&#24456;&#37325;&#35201;&#30340;&#12290;&#36923;&#36753;&#26159;&#35748;&#35782;&#24605;&#32500;&#30340;&#20027;&#27969;&#26041;&#27861;&#12290;&#25152;&#20197;&#20320;&#24517;&#39035;&#20855;&#22791;&#36275;&#22815;&#30340;&#36923;&#36753;&#30693;&#35782;&#65292;&#36825;&#26679;&#20320;&#25165;&#33021;&#20445;&#25252;&#33258;&#24049;&#30340;&#35266;&#28857;&#12290;</SPAN><SPAN lang=EN-US style="FONT-SIZE: 10.5pt; FONT-FAMILY: 'Arial','sans-serif'"></SPAN></FONT></P>
<P><FONT face=&#23435;&#20307;><SPAN style="FONT-SIZE: 10.5pt; mso-ascii-font-family: Arial; mso-hansi-font-family: Arial; mso-bidi-font-family: Arial">&#27599;&#19968;&#20010;&#20154;&#37117;&#38656;&#35201;&#30693;&#36947;<STRONG><SPAN style="FONT-FAMILY: &#23435;&#20307;; mso-ascii-font-family: Arial; mso-hansi-font-family: Arial; mso-bidi-font-family: Arial">&#35748;&#30693;&#24515;&#29702;&#23398;&#30340;&#26576;&#20123;&#30693;&#35782;</SPAN></STRONG>&#12290;&#22914;&#26524;&#20320;&#24819;&#20570;&#26377;&#20851;&#23398;&#20064;&#30340;&#24037;&#20316;&#65292;&#37027;&#20040;&#21457;&#23637;&#24515;&#29702;&#23398;&#26159;&#24456;&#37325;&#35201;&#30340;&#12290;&#21457;&#23637;&#24515;&#29702;&#23398;&#20174;&#19968;&#33324;&#24847;&#20041;&#19978;&#35762;&#20063;&#26159;&#24456;&#26377;&#29992;&#30340;&#65292;&#23427;&#33021;&#21578;&#35785;&#20320;&#23545;&#20110;&#20154;&#31867;&#26469;&#35828;&#65292;&#21738;&#20123;&#20107;&#24773;&#38590;&#21738;&#20123;&#23481;&#26131;&#12290;&#23427;&#36824;&#32473;&#20986;&#20102;&#26377;&#20851;&#35748;&#30693;&#20307;&#31995;&#32467;&#26500;&#30340;&#35748;&#30693;&#27169;&#22411;&#12290;&#20363;&#22914;&#65292;&#26377;&#20851;&#20799;&#31461;&#35821;&#35328;&#23398;&#20064;&#30340;&#24037;&#20316;&#23601;&#23545;&#35821;&#35328;&#22788;&#29702;&#29702;&#35770;&#26045;&#21152;&#20102;&#22362;&#23454;&#30340;&#32422;&#26463;&#12290;</SPAN><SPAN lang=EN-US style="FONT-SIZE: 10.5pt; FONT-FAMILY: 'Arial','sans-serif'"></SPAN></FONT></P>
<P><SPAN style="FONT-SIZE: 10.5pt; mso-ascii-font-family: Arial; mso-hansi-font-family: Arial; mso-bidi-font-family: Arial"><FONT face=&#23435;&#20307;>&#24515;&#29702;&#23398;&#20013;&#26356;</FONT></SPAN><SPAN lang=EN-US style="FONT-SIZE: 10.5pt; FONT-FAMILY: 'Arial','sans-serif'">&#8220;</SPAN><SPAN style="FONT-SIZE: 10.5pt; mso-ascii-font-family: Arial; mso-hansi-font-family: Arial; mso-bidi-font-family: Arial"><FONT face=&#23435;&#20307;>&#36719;</FONT></SPAN><SPAN lang=EN-US style="FONT-SIZE: 10.5pt; FONT-FAMILY: 'Arial','sans-serif'">&#8221;</SPAN><FONT face=&#23435;&#20307;><SPAN style="FONT-SIZE: 10.5pt; mso-ascii-font-family: Arial; mso-hansi-font-family: Arial; mso-bidi-font-family: Arial">&#30340;&#37096;&#20998;&#65292;&#20363;&#22914;&#24515;&#29702;&#20998;&#26512;&#21644;&#31038;&#20250;&#24515;&#29702;&#23398;&#65292;&#23545;&#33258;&#24049;&#30740;&#31350;&#39046;&#22495;&#30340;&#24433;&#21709;&#30475;&#20284;&#24456;&#23567;&#65292;&#20294;&#20855;&#26377;&#28508;&#22312;&#30340;&#37325;&#22823;&#24847;&#20041;&#12290;&#23427;&#20204;&#20250;&#32473;&#20320;&#38750;&#24120;&#19981;&#21516;&#30340;&#29702;&#35299;&#20154;&#26159;&#20160;&#20040;&#30340;&#26041;&#24335;&#12290;&#20687;&#31038;&#20250;&#23398;&#21644;&#20154;&#31867;&#23398;&#36825;&#26679;&#30340;&#31038;&#20250;&#31185;&#23398;&#21487;&#20197;&#36215;&#30456;&#20284;&#30340;&#20316;&#29992;&#12290;&#20855;&#26377;&#22810;&#31181;&#35266;&#28857;&#26159;&#24456;&#26377;&#29992;&#30340;&#12290;&#19978;&#36848;&#23398;&#31185;&#20320;&#26377;&#21487;&#33021;&#38656;&#35201;&#33258;&#23398;&#65292;&#19981;&#24184;&#30340;&#26159;&#65292;&#24456;&#38590;&#21306;&#20998;&#20986;&#36825;&#20123;&#39046;&#22495;&#21738;&#20123;&#26159;&#20248;&#31168;&#30340;&#25104;&#26524;&#21738;&#20123;&#26159;&#22403;&#22334;&#12290;</SPAN><SPAN lang=EN-US style="FONT-SIZE: 10.5pt; FONT-FAMILY: 'Arial','sans-serif'"></SPAN></FONT></P>
<P><FONT face=&#23435;&#20307;><SPAN style="FONT-SIZE: 10.5pt; mso-ascii-font-family: Arial; mso-hansi-font-family: Arial; mso-bidi-font-family: Arial">&#29289;&#29702;&#23398;&#23545;&#20110;&#25105;&#20204;&#26576;&#20123;&#30740;&#31350;&#39046;&#22495;&#20063;&#20855;&#26377;&#26497;&#22823;&#30340;&#24433;&#21709;&#12290;</SPAN><SPAN lang=EN-US style="FONT-SIZE: 10.5pt; FONT-FAMILY: 'Arial','sans-serif'"></SPAN></FONT></P>
<P><STRONG><SPAN style="FONT-SIZE: 10.5pt; FONT-FAMILY: &#23435;&#20307;; mso-ascii-font-family: Arial; mso-hansi-font-family: Arial; mso-bidi-font-family: Arial">&#21746;&#23398;&#26159;&#26576;&#20123;&#30740;&#31350;&#39046;&#22495;&#30475;&#19981;&#35265;&#30340;&#26694;&#26550;</SPAN></STRONG><FONT face=&#23435;&#20307;><SPAN style="FONT-SIZE: 10.5pt; mso-ascii-font-family: Arial; mso-hansi-font-family: Arial; mso-bidi-font-family: Arial">&#12290;&#21746;&#23398;&#20063;&#33021;&#24110;&#21161;&#20320;&#36816;&#29992;&#25110;&#32773;&#35835;&#25026;&#24456;&#22810;&#33258;&#24049;&#30740;&#31350;&#39046;&#22495;&#35770;&#25991;&#20013;&#29992;&#21040;&#30340;&#35266;&#28857;&#12290;&#26377;&#20851;&#24605;&#32500;&#21644;&#35821;&#35328;&#30340;&#21746;&#23398;&#19982;&#33258;&#24049;&#30740;&#31350;&#39046;&#22495;&#26356;&#30456;&#20851;&#12290;&#21746;&#23398;&#23384;&#22312;&#30528;&#22810;&#31181;&#23398;&#27966;&#65292;&#20174;&#27604;&#36739;&#22823;&#30340;&#33539;&#22260;&#26469;&#20998;&#65292;&#21746;&#23398;&#21487;&#20998;&#20026;&#20998;&#26512;&#21746;&#23398;&#21644;&#22823;&#38470;&#21746;&#23398;&#12290;&#22823;&#38470;&#21746;&#23398;&#21017;&#23545;&#25105;&#20204;&#20064;&#20197;&#20026;&#24120;&#30340;&#24456;&#22810;&#19996;&#35199;&#26377;&#38750;&#24120;&#19981;&#21516;&#30340;&#30475;&#24453;&#26041;&#24335;&#12290;</SPAN><SPAN lang=EN-US style="FONT-SIZE: 10.5pt; FONT-FAMILY: 'Arial','sans-serif'"></SPAN></FONT></P>
<P><SPAN style="FONT-SIZE: 10.5pt; mso-ascii-font-family: Arial; mso-hansi-font-family: Arial; mso-bidi-font-family: Arial"><FONT face=&#23435;&#20307;>&#30475;&#36215;&#26469;&#35201;&#23398;&#20064;&#22826;&#22810;&#30340;&#19996;&#35199;&#65292;&#26159;&#19981;&#26159;&#65311;&#30830;&#23454;&#22914;&#27492;&#12290;&#35201;&#23567;&#24515;&#19968;&#20010;&#38519;&#38449;&#65306;&#35748;&#20026;&#23545;&#20110;&#25152;&#26377;&#30340;</FONT></SPAN><SPAN lang=EN-US style="FONT-SIZE: 10.5pt; FONT-FAMILY: 'Arial','sans-serif'">X</SPAN><SPAN style="FONT-SIZE: 10.5pt; mso-ascii-font-family: Arial; mso-hansi-font-family: Arial; mso-bidi-font-family: Arial"><FONT face=&#23435;&#20307;>&#65292;</FONT></SPAN><SPAN lang=EN-US style="FONT-SIZE: 10.5pt; FONT-FAMILY: 'Arial','sans-serif'">&#8220;</SPAN><SPAN style="FONT-SIZE: 10.5pt; mso-ascii-font-family: Arial; mso-hansi-font-family: Arial; mso-bidi-font-family: Arial"><FONT face=&#23435;&#20307;>&#21482;&#26377;&#25105;&#23545;</FONT></SPAN><SPAN lang=EN-US style="FONT-SIZE: 10.5pt; FONT-FAMILY: 'Arial','sans-serif'">X</SPAN><SPAN style="FONT-SIZE: 10.5pt; mso-ascii-font-family: Arial; mso-hansi-font-family: Arial; mso-bidi-font-family: Arial"><FONT face=&#23435;&#20307;>&#20102;&#35299;&#30340;&#26356;&#22810;&#65292;&#36825;&#20010;&#38382;&#39064;&#25165;&#20250;&#21464;&#24471;&#23481;&#26131;</FONT></SPAN><SPAN lang=EN-US style="FONT-SIZE: 10.5pt; FONT-FAMILY: 'Arial','sans-serif'">&#8221;</SPAN><SPAN style="FONT-SIZE: 10.5pt; mso-ascii-font-family: Arial; mso-hansi-font-family: Arial; mso-bidi-font-family: Arial"><FONT face=&#23435;&#20307;>&#12290;&#35201;&#30693;&#36947;&#65292;&#19982;&#20043;&#30456;&#20851;&#38656;&#35201;&#36827;&#19968;&#27493;&#20102;&#35299;&#30340;&#19996;&#35199;&#26159;&#27704;&#36828;&#27809;&#23436;&#30340;&#65292;&#20294;&#26368;&#32456;&#20320;&#36824;&#26159;&#35201;&#22352;&#19979;&#26469;&#21435;&#35299;&#20915;&#38382;&#39064;&#30340;&#12290;</FONT></SPAN><SPAN lang=EN-US style="FONT-SIZE: 10.5pt; FONT-FAMILY: 'Arial','sans-serif'"></SPAN>