<H2>Linux&#35774;&#22791;&#27169;&#22411;(1)_&#22522;&#26412;&#27010;&#24565;</H2>
<P class=date>&#20316;&#32773;&#65306;<A href="http://www.wowotech.net/author/2">&#34583;&#34583;</A> &#21457;&#24067;&#20110;&#65306;2014-2-27 17:01 &#20998;&#31867;&#65306;<A href="http://www.wowotech.net/sort/device_model">&#32479;&#19968;&#35774;&#22791;&#27169;&#22411;</A> </P>
<H4>1. &#21069;&#35328; </H4>
<P>&#22312;&#8220;<A href="http://www.wowotech.net/linux_kenrel/11.html">Linux&#20869;&#26680;&#30340;&#25972;&#20307;&#26550;&#26500;</A>&#8221;&#20013;&#65292;&#34583;&#34583;&#26377;&#25552;&#21040;&#65292;&#30001;&#20110;Linux&#25903;&#25345;&#19990;&#30028;&#19978;&#20960;&#20046;&#25152;&#26377;&#30340;&#12289;&#19981;&#21516;&#21151;&#33021;&#30340;&#30828;&#20214;&#35774;&#22791;&#65288;&#36825;&#26159;Linux&#30340;&#20248;&#28857;&#65289;&#65292;&#23548;&#33268;Linux&#20869;&#26680;&#20013;&#26377;&#19968;&#21322;&#30340;&#20195;&#30721;&#26159;&#35774;&#22791;&#39537;&#21160;&#65292;&#32780;&#19988;&#38543;&#30528;&#30828;&#20214;&#30340;&#24555;&#36895;&#21319;&#32423;&#25442;&#20195;&#65292;&#35774;&#22791;&#39537;&#21160;&#30340;&#20195;&#30721;&#37327;&#20063;&#22312;&#24555;&#36895;&#22686;&#38271;&#12290;&#20010;&#20154;&#24847;&#35265;&#65292;&#36825;&#31181;&#29616;&#35937;&#25171;&#30772;&#20102;&#8220;&#31616;&#27905;&#23601;&#26159;&#32654;&#8221;&#30340;&#29702;&#24565;&#65292;&#26159;&#19985;&#38475;&#30340;&#12290;&#23427;&#23548;&#33268;Linux&#20869;&#26680;&#30475;&#19978;&#21435;&#38750;&#24120;&#33219;&#32959;&#12289;&#26434;&#20081;&#12289;&#19981;&#26131;&#32500;&#25252;&#12290;&#20294;&#34583;&#34583;&#20063;&#30693;&#36947;&#65292;&#36825;&#19981;&#26159;Linux&#30340;&#38169;&#65292;Linux&#26159;&#19968;&#20010;&#23439;&#20869;&#26680;&#65292;&#23427;&#24517;&#39035;&#38754;&#23545;&#35774;&#22791;&#30340;&#22810;&#26679;&#24615;&#65292;&#24182;&#23454;&#29616;&#23545;&#24212;&#30340;&#39537;&#21160;&#12290; </P>
<P>&#20026;&#20102;&#38477;&#20302;&#35774;&#22791;&#22810;&#26679;&#24615;&#24102;&#26469;&#30340;Linux&#39537;&#21160;&#24320;&#21457;&#30340;&#22797;&#26434;&#24230;&#65292;&#20197;&#21450;&#35774;&#22791;&#28909;&#25300;&#25554;&#22788;&#29702;&#12289;&#30005;&#28304;&#31649;&#29702;&#31561;&#65292;Linux&#20869;&#26680;&#25552;&#20986;&#20102;&#35774;&#22791;&#27169;&#22411;&#65288;&#20063;&#31216;&#20316;Driver Model&#65289;&#30340;&#27010;&#24565;&#12290;&#35774;&#22791;&#27169;&#22411;&#23558;&#30828;&#20214;&#35774;&#22791;&#24402;&#32435;&#12289;&#20998;&#31867;&#65292;&#28982;&#21518;&#25277;&#35937;&#20986;&#19968;&#22871;&#26631;&#20934;&#30340;&#25968;&#25454;&#32467;&#26500;&#21644;&#25509;&#21475;&#12290;&#39537;&#21160;&#30340;&#24320;&#21457;&#65292;&#23601;&#31616;&#21270;&#20026;&#23545;&#20869;&#26680;&#25152;&#35268;&#23450;&#30340;&#25968;&#25454;&#32467;&#26500;&#30340;&#22635;&#20805;&#21644;&#23454;&#29616;&#12290; </P>
<P>&#26412;&#25991;&#23558;&#20250;&#20174;&#35774;&#22791;&#27169;&#22411;&#30340;&#22522;&#26412;&#27010;&#24565;&#24320;&#22987;&#65292;&#36890;&#36807;&#20998;&#26512;&#20869;&#26680;&#30456;&#24212;&#30340;&#20195;&#30721;&#65292;&#19968;&#27493;&#19968;&#27493;&#35299;&#26512;Linux&#35774;&#22791;&#27169;&#22411;&#30340;&#23454;&#29616;&#21450;&#20351;&#29992;&#26041;&#27861;&#12290; </P>
<H4>2. Linux&#35774;&#22791;&#27169;&#22411;&#30340;&#22522;&#26412;&#27010;&#24565; </H4>
<H5>2.1 Bus, Class, Device&#21644;Device Driver&#30340;&#27010;&#24565; </H5>
<P>&#19979;&#22270;&#26159;&#23884;&#20837;&#24335;&#31995;&#32479;&#24120;&#35265;&#30340;&#30828;&#20214;&#25299;&#25169;&#30340;&#19968;&#20010;&#31034;&#20363;&#65306; <BR><A href="http://www.wowotech.net/content/uploadfile/201402/861308c496428d7590deccd7507b61f720140227080145.gif"><IMG title=device_toplogy style="BORDER-LEFT-WIDTH: 0px; BORDER-RIGHT-WIDTH: 0px; BORDER-BOTTOM-WIDTH: 0px; DISPLAY: inline; BORDER-TOP-WIDTH: 0px" border=0 alt=device_toplogy src="http://www.wowotech.net/content/uploadfile/201402/e960493a2c0e405ae9b2fefaf869334220140227080147.gif" width=529 height=480></A> </P>
<P>&#30828;&#20214;&#25299;&#25169;&#25551;&#36848;Linux&#35774;&#22791;&#27169;&#22411;&#20013;&#22235;&#20010;&#37325;&#35201;&#27010;&#24565;&#20013;&#19977;&#20010;&#65306;Bus&#65292;Class&#21644;Device&#65288;&#31532;&#22235;&#20010;&#20026;Device Driver&#65292;&#21518;&#38754;&#20250;&#35828;&#65289;&#12290; </P>
<P>Bus&#65288;&#24635;&#32447;&#65289;&#65306;Linux&#35748;&#20026;&#65288;&#21487;&#20197;&#21442;&#32771;include/linux/device.h&#20013;struct bus_type&#30340;&#27880;&#37322;&#65289;&#65292;&#24635;&#32447;&#26159;CPU&#21644;&#19968;&#20010;&#25110;&#22810;&#20010;&#35774;&#22791;&#20043;&#38388;&#20449;&#24687;&#20132;&#20114;&#30340;&#36890;&#36947;&#12290;&#32780;&#20026;&#20102;&#26041;&#20415;&#35774;&#22791;&#27169;&#22411;&#30340;&#25277;&#35937;&#65292;&#25152;&#26377;&#30340;&#35774;&#22791;&#37117;&#24212;&#36830;&#25509;&#21040;&#24635;&#32447;&#19978;&#65288;&#26080;&#35770;&#26159;CPU&#20869;&#37096;&#24635;&#32447;&#12289;&#34394;&#25311;&#30340;&#24635;&#32447;&#36824;&#26159;&#8220;platform Bus&#8221;&#65289;&#12290; </P>
<P>Class&#65288;&#20998;&#31867;&#65289;&#65306;&#22312;Linux&#35774;&#22791;&#27169;&#22411;&#20013;&#65292;Class&#30340;&#27010;&#24565;&#38750;&#24120;&#31867;&#20284;&#38754;&#21521;&#23545;&#35937;&#31243;&#24207;&#35774;&#35745;&#20013;&#30340;Class&#65288;&#31867;&#65289;&#65292;&#23427;&#20027;&#35201;&#26159;&#38598;&#21512;&#20855;&#26377;&#30456;&#20284;&#21151;&#33021;&#25110;&#23646;&#24615;&#30340;&#35774;&#22791;&#65292;&#36825;&#26679;&#23601;&#21487;&#20197;&#25277;&#35937;&#20986;&#19968;&#22871;&#21487;&#20197;&#22312;&#22810;&#20010;&#35774;&#22791;&#20043;&#38388;&#20849;&#29992;&#30340;&#25968;&#25454;&#32467;&#26500;&#21644;&#25509;&#21475;&#20989;&#25968;&#12290;&#22240;&#32780;&#20174;&#23646;&#20110;&#30456;&#21516;Class&#30340;&#35774;&#22791;&#30340;&#39537;&#21160;&#31243;&#24207;&#65292;&#23601;&#19981;&#20877;&#38656;&#35201;&#37325;&#22797;&#23450;&#20041;&#36825;&#20123;&#20844;&#20849;&#36164;&#28304;&#65292;&#30452;&#25509;&#20174;Class&#20013;&#32487;&#25215;&#21363;&#21487;&#12290; </P>
<P>Device&#65288;&#35774;&#22791;&#65289;&#65306;&#25277;&#35937;&#31995;&#32479;&#20013;&#25152;&#26377;&#30340;&#30828;&#20214;&#35774;&#22791;&#65292;&#25551;&#36848;&#23427;&#30340;&#21517;&#23383;&#12289;&#23646;&#24615;&#12289;&#20174;&#23646;&#30340;Bus&#12289;&#20174;&#23646;&#30340;Class&#31561;&#20449;&#24687;&#12290; </P>
<P>Device Driver&#65288;&#39537;&#21160;&#65289;&#65306;Linux&#35774;&#22791;&#27169;&#22411;&#29992;Driver&#25277;&#35937;&#30828;&#20214;&#35774;&#22791;&#30340;&#39537;&#21160;&#31243;&#24207;&#65292;&#23427;&#21253;&#21547;&#35774;&#22791;&#21021;&#22987;&#21270;&#12289;&#30005;&#28304;&#31649;&#29702;&#30456;&#20851;&#30340;&#25509;&#21475;&#23454;&#29616;&#12290;&#32780;Linux&#20869;&#26680;&#20013;&#30340;&#39537;&#21160;&#24320;&#21457;&#65292;&#22522;&#26412;&#37117;&#22260;&#32469;&#35813;&#25277;&#35937;&#36827;&#34892;&#65288;&#23454;&#29616;&#25152;&#35268;&#23450;&#30340;&#25509;&#21475;&#20989;&#25968;&#65289;&#12290; </P>
<P><SPAN style="COLOR: rgb(0,0,255)">&#27880;&#65306;&#20160;&#20040;&#26159;Platform Bus&#65311; <BR>&#22312;&#35745;&#31639;&#26426;&#20013;&#26377;&#36825;&#26679;&#19968;&#31867;&#35774;&#22791;&#65292;&#23427;&#20204;&#36890;&#36807;&#21508;&#33258;&#30340;&#35774;&#22791;&#25511;&#21046;&#22120;&#65292;&#30452;&#25509;&#21644;CPU&#36830;&#25509;&#65292;CPU&#21487;&#20197;&#36890;&#36807;&#24120;&#35268;&#30340;&#23547;&#22336;&#25805;&#20316;&#35775;&#38382;&#23427;&#20204;&#65288;&#25110;&#32773;&#35828;&#35775;&#38382;&#23427;&#20204;&#30340;&#25511;&#21046;&#22120;&#65289;&#12290;&#36825;&#31181;&#36830;&#25509;&#26041;&#24335;&#65292;&#24182;&#19981;&#23646;&#20110;&#20256;&#32479;&#24847;&#20041;&#19978;&#30340;&#24635;&#32447;&#36830;&#25509;&#12290;&#20294;&#35774;&#22791;&#27169;&#22411;&#24212;&#35813;&#20855;&#22791;&#26222;&#36866;&#24615;&#65292;&#22240;&#27492;Linux&#23601;&#34394;&#26500;&#20102;&#19968;&#26465;Platform Bus&#65292;&#20379;&#36825;&#20123;&#35774;&#22791;&#25346;&#38752;&#12290;</SPAN> </P>
<H5>2.2 &#35774;&#22791;&#27169;&#22411;&#30340;&#26680;&#24515;&#24605;&#24819; </H5>
<P><FONT class=extract>Linux&#35774;&#22791;&#27169;&#22411;&#30340;&#26680;&#24515;&#24605;&#24819;&#26159;&#65288;&#36890;&#36807;xxx&#25163;&#27573;&#65292;&#23454;&#29616;xxx&#30446;&#30340;&#65289;&#65306; </FONT></P>
<P><FONT class=extract>1. &#29992;Device&#65288;struct device&#65289;&#21644;Device Driver&#65288;struct device_driver&#65289;&#20004;&#20010;&#25968;&#25454;&#32467;&#26500;&#65292;&#20998;&#21035;&#20174;&#8220;&#26377;&#20160;&#20040;&#29992;&#8221;&#21644;&#8220;&#24590;&#20040;&#29992;&#8221;&#20004;&#20010;&#35282;&#24230;&#25551;&#36848;&#30828;&#20214;&#35774;&#22791;&#12290;&#36825;&#26679;&#23601;&#32479;&#19968;&#20102;&#32534;&#20889;&#35774;&#22791;&#39537;&#21160;&#30340;&#26684;&#24335;&#65292;&#20351;&#39537;&#21160;&#24320;&#21457;&#20174;&#35770;&#36848;&#39064;&#21464;&#20026;&#22635;&#31354;&#20307;&#65292;&#20174;&#32780;&#31616;&#21270;&#20102;&#35774;&#22791;&#39537;&#21160;&#30340;&#24320;&#21457;&#12290; </FONT></P>
<P><FONT class=extract>2. &#21516;&#26679;&#20351;&#29992;Device&#21644;Device Driver&#20004;&#20010;&#25968;&#25454;&#32467;&#26500;&#65292;&#23454;&#29616;&#30828;&#20214;&#35774;&#22791;&#30340;&#21363;&#25554;&#21363;&#29992;&#65288;&#28909;&#25300;&#25554;&#65289;&#12290; <BR>&#22312;Linux&#20869;&#26680;&#20013;&#65292;&#21482;&#35201;&#20219;&#20309;Device&#21644;Device Driver&#20855;&#26377;&#30456;&#21516;&#30340;&#21517;&#23383;&#65292;&#20869;&#26680;&#23601;&#20250;&#25191;&#34892;Device Driver&#32467;&#26500;&#20013;&#30340;&#21021;&#22987;&#21270;&#20989;&#25968;&#65288;probe&#65289;&#65292;&#35813;&#20989;&#25968;&#20250;&#21021;&#22987;&#21270;&#35774;&#22791;&#65292;&#20351;&#20854;&#20026;&#21487;&#29992;&#29366;&#24577;&#12290; <BR>&#32780;&#23545;&#22823;&#22810;&#25968;&#28909;&#25300;&#25554;&#35774;&#22791;&#32780;&#35328;&#65292;&#23427;&#20204;&#30340;Device Driver&#19968;&#30452;&#23384;&#22312;&#20869;&#26680;&#20013;&#12290;&#24403;&#35774;&#22791;&#27809;&#26377;&#25554;&#20837;&#26102;&#65292;&#20854;Device&#32467;&#26500;&#19981;&#23384;&#22312;&#65292;&#22240;&#32780;&#20854;Driver&#20063;&#23601;&#19981;&#25191;&#34892;&#21021;&#22987;&#21270;&#25805;&#20316;&#12290;&#24403;&#35774;&#22791;&#25554;&#20837;&#26102;&#65292;&#20869;&#26680;&#20250;&#21019;&#24314;&#19968;&#20010;Device&#32467;&#26500;&#65288;&#21517;&#31216;&#21644;Driver&#30456;&#21516;&#65289;&#65292;&#27492;&#26102;&#23601;&#20250;&#35302;&#21457;Driver&#30340;&#25191;&#34892;&#12290;&#36825;&#23601;&#26159;&#21363;&#25554;&#21363;&#29992;&#30340;&#27010;&#24565;&#12290; </FONT></P>
<P><FONT class=extract>3. &#36890;&#36807;"Bus--&gt;Device&#8221;&#31867;&#22411;&#30340;&#26641;&#29366;&#32467;&#26500;&#65288;&#35265;2.1&#31456;&#33410;&#30340;&#22270;&#20363;&#65289;&#35299;&#20915;&#35774;&#22791;&#20043;&#38388;&#30340;&#20381;&#36182;&#65292;&#32780;&#36825;&#31181;&#20381;&#36182;&#22312;&#24320;&#20851;&#26426;&#12289;&#30005;&#28304;&#31649;&#29702;&#31561;&#36807;&#31243;&#20013;&#23588;&#20026;&#37325;&#35201;&#12290; <BR>&#35797;&#24819;&#65292;&#19968;&#20010;&#35774;&#22791;&#25346;&#36733;&#22312;&#19968;&#26465;&#24635;&#32447;&#19978;&#65292;&#35201;&#21551;&#21160;&#36825;&#20010;&#35774;&#22791;&#65292;&#24517;&#39035;&#20808;&#21551;&#21160;&#23427;&#25152;&#25346;&#36733;&#30340;&#24635;&#32447;&#12290;&#24456;&#26174;&#28982;&#65292;&#22914;&#26524;&#31995;&#32479;&#20013;&#35774;&#22791;&#38750;&#24120;&#22810;&#12289;&#20381;&#36182;&#20851;&#31995;&#38750;&#24120;&#22797;&#26434;&#30340;&#26102;&#20505;&#65292;&#26080;&#35770;&#26159;&#20869;&#26680;&#36824;&#26159;&#39537;&#21160;&#30340;&#24320;&#21457;&#20154;&#21592;&#65292;&#37117;&#26080;&#21147;&#32500;&#25252;&#36825;&#31181;&#20851;&#31995;&#12290; <BR>&#32780;&#35774;&#22791;&#27169;&#22411;&#20013;&#30340;&#36825;&#31181;&#26641;&#29366;&#32467;&#26500;&#65292;&#21487;&#20197;&#33258;&#21160;&#22788;&#29702;&#36825;&#31181;&#20381;&#36182;&#20851;&#31995;&#12290;&#21551;&#21160;&#26576;&#19968;&#20010;&#35774;&#22791;&#21069;&#65292;&#20869;&#26680;&#20250;&#26816;&#26597;&#35813;&#35774;&#22791;&#26159;&#21542;&#20381;&#36182;&#20854;&#23427;&#35774;&#22791;&#25110;&#32773;&#24635;&#32447;&#65292;&#22914;&#26524;&#20381;&#36182;&#65292;&#21017;&#26816;&#26597;&#25152;&#20381;&#36182;&#30340;&#23545;&#35937;&#26159;&#21542;&#24050;&#32463;&#21551;&#21160;&#65292;&#22914;&#26524;&#27809;&#26377;&#65292;&#21017;&#20250;&#20808;&#21551;&#21160;&#23427;&#20204;&#65292;&#30452;&#21040;&#21551;&#21160;&#35813;&#35774;&#22791;&#30340;&#26465;&#20214;&#20855;&#22791;&#20026;&#27490;&#12290;&#32780;&#39537;&#21160;&#24320;&#21457;&#20154;&#21592;&#38656;&#35201;&#20570;&#30340;&#65292;&#23601;&#26159;&#22312;&#32534;&#20889;&#35774;&#22791;&#39537;&#21160;&#26102;&#65292;&#21578;&#30693;&#20869;&#26680;&#35813;&#35774;&#22791;&#30340;&#20381;&#36182;&#20851;&#31995;&#21363;&#21487;&#12290; </FONT></P>
<P><FONT class=extract>4. &#20351;&#29992;Class&#32467;&#26500;&#65292;&#22312;&#35774;&#22791;&#27169;&#22411;&#20013;&#24341;&#20837;&#38754;&#21521;&#23545;&#35937;&#30340;&#27010;&#24565;&#65292;&#36825;&#26679;&#21487;&#20197;&#26368;&#22823;&#38480;&#24230;&#22320;&#25277;&#35937;&#20849;&#24615;&#65292;&#20943;&#23569;&#39537;&#21160;&#24320;&#21457;&#36807;&#31243;&#20013;&#30340;&#37325;&#22797;&#21171;&#21160;&#65292;&#38477;&#20302;&#24037;&#20316;&#37327;&#12290; </FONT></P>
<P><SPAN style="COLOR: rgb(128,128,128)"><EM>&#21407;&#21019;&#25991;&#31456;&#65292;&#36716;&#21457;&#35831;&#27880;&#26126;&#20986;&#22788;&#12290;&#34583;&#31389;&#31185;&#25216;&#65292;<A href="http://www.wowotech.net/linux_kenrel/13.html">www.wowotech.net</A>&#12290;</EM></SPAN>