<H1 class=postTitle><A id=cb_post_title_url class=postTitle2 href="http://www.cnblogs.com/vamei/p/3603046.html">Python&#24555;&#36895;&#25945;&#31243; &#23614;&#22768;</A> </H1>
<DIV class=clear></DIV>
<DIV class=postBody>
<DIV id=cnblogs_post_body>
<P><SPAN style="FONT-FAMILY: 'courier new', courier">&#20316;&#32773;&#65306;Vamei &#20986;&#22788;&#65306;http://www.cnblogs.com/vamei &#27426;&#36814;&#36716;&#36733;&#65292;&#20063;&#35831;&#20445;&#30041;&#36825;&#27573;&#22768;&#26126;&#12290;&#35874;&#35874;&#65281;</SPAN></P>
<P>&nbsp;</P>
<P><SPAN style="FONT-FAMILY: 'courier new', courier">&#20889;&#20102;&#23558;&#36817;&#20004;&#24180;&#30340;<A class=" wrap external" href="http://www.cnblogs.com/vamei/archive/2012/09/13/2682778.html" rel=nofollow target=_blank>Python&#24555;&#36895;&#25945;&#31243;</A>&#65292;&#32456;&#20110;&#22823;&#27010;&#25104;&#24418;&#12290;&#36825;&#19968;&#31995;&#21015;&#25991;&#31456;&#65292;&#21253;&#25324;Python&#22522;&#30784;&#12289;&#26631;&#20934;&#24211;&#12289;Django&#26694;&#26550;&#12290;<SPAN>&#21069;&#21069;&#21518;&#21518;&#30340;&#25991;&#31456;&#65292;&#21253;&#21547;&#20102;Python&#26368;&#37325;&#35201;&#30340;&#32452;&#25104;&#37096;&#20998;&#12290;&#36825;&#19968;&#20869;&#23481;&#30340;&#36328;&#24230;&#36828;&#36828;&#36229;&#36807;&#25105;&#30340;&#39044;&#26399;&#65292;&#20063;&#36229;&#36807;&#20102;&#25105;&#30475;&#36807;&#30340;&#20219;&#20309;Python&#30456;&#20851;&#20070;&#31821;&#12290;</SPAN>&#26368;&#21021;&#21160;&#31508;&#30340;&#21407;&#22240;&#65292;&#38500;&#20102;&#35201;&#24635;&#32467;&#65292;&#36824;&#23545;&#24456;&#22810;Python&#20070;&#21644;&#25945;&#31243;&#35273;&#24471;&#19981;&#28385;&#24847;&#65292;&#35273;&#24471;&#22826;&#26214;&#28073;&#65292;&#21448;&#19981;&#22815;&#20840;&#38754;&#12290;&#29616;&#22312;&#65292;&#25105;&#27604;&#36739;&#30830;&#23450;&#65292;&#21442;&#32771;&#25105;&#22312;<A href="http://www.cnblogs.com/vamei/archive/2012/10/10/2718229.html">Linux</A>&#12289;<A href="http://www.cnblogs.com/vamei/archive/2012/12/05/2802811.html">&#32593;&#32476;</A>&#12289;<A href="http://www.cnblogs.com/vamei/archive/2013/03/22/2974052.html">&#31639;&#27861;</A>&#26041;&#38754;&#30340;&#24635;&#32467;&#65292;&#35835;&#32773;&#21487;&#20197;&#22312;&#26080;&#22522;&#30784;&#30340;&#32972;&#26223;&#19979;&#65292;&#22312;&#30701;&#26102;&#38388;&#65292;&#26377;&#28145;&#24230;&#30340;&#23398;&#20064;Python&#20102;&#12290;</SPAN></P>
<P>&nbsp;</P>
<P><SPAN style="FONT-FAMILY: 'courier new', courier">&#36825;&#19968;&#31687;&#20063;&#26159;&#23614;&#22768;&#12290;&#20934;&#22791;&#22312;&#19968;&#20010;&#38271;&#30340;&#26102;&#38388;&#20869;&#65292;&#20572;&#27490;&#26356;&#26032;Python&#24555;&#36895;&#25945;&#31243;&#65292;&#25226;&#31934;&#21147;&#38598;&#20013;&#22312;&#20854;&#23427;&#26041;&#38754;&#12290;&#27605;&#31455;&#19968;&#20214;&#20107;&#24773;&#20570;&#20037;&#20102;&#65292;&#20250;&#32570;&#20047;&#33258;&#25105;&#31361;&#30772;&#12290;&#32534;&#31243;&#26159;&#19968;&#20010;&#24456;&#26377;&#21019;&#26032;&#24615;&#65292;&#24456;&#38656;&#35201;&#31361;&#30772;&#33258;&#25105;&#30340;&#24037;&#20316;&#12290;&#22312;&#19968;&#20010;&#26041;&#38754;&#24453;&#20037;&#20102;&#65292;&#33258;&#24049;&#37117;&#20250;&#35273;&#24471;&#21457;&#39306;&#12290;&#32780;&#26410;&#30693;&#30340;&#35745;&#31639;&#26426;&#39046;&#22495;&#20013;&#65292;&#36824;&#26377;&#24456;&#22810;&#26377;&#36259;&#30340;&#25216;&#26415;&#20540;&#24471;&#26356;&#28145;&#20837;&#30340;&#23398;&#20064;&#12290;&#21478;&#19968;&#26041;&#38754;&#65292;Python&#29992;&#33298;&#26381;&#20102;&#65292;&#23548;&#33268;&#25105;&#19968;&#24819;&#21040;&#38382;&#39064;&#65292;&#22522;&#26412;&#37117;&#26159;Python&#30340;&#24605;&#36335;&#12290;&#36825;&#26679;&#65292;Python&#23601;&#25104;&#20102;&#25105;&#30340;&#33298;&#26381;&#21306;&#22495;&#12290;&#25105;&#25042;&#24471;&#21435;&#24819;&#65292;Java&#20250;&#22914;&#20309;&#35299;&#20915;&#65292;Scala&#20250;&#22914;&#20309;&#35299;&#20915;&#65292;C&#20250;&#22914;&#20309;&#35299;&#20915;&#12290;&#25104;&#38271;&#30340;&#31354;&#38388;&#34987;&#21387;&#32553;&#24471;&#24456;&#23567;&#12290;&#20026;&#20102;&#33258;&#24049;&#33021;&#21069;&#36827;&#65292;&#35201;&#25171;&#30772;&#36825;&#20010;&#33298;&#36866;&#21306;&#12290;</SPAN></P>
<P>&nbsp;</P>
<P><SPAN style="FONT-FAMILY: 'courier new', courier">&#35874;&#35874;&#21508;&#20301;&#38405;&#35835;&#36825;&#20123;&#30340;Python&#25991;&#31456;&#12290;&#20320;&#20204;&#30340;&#25903;&#25345;&#26159;&#25105;&#36208;&#21040;&#29616;&#22312;&#30340;&#26368;&#22823;&#21160;&#21147;&#12290;&#24076;&#26395;&#36825;&#20123;&#25216;&#26415;&#25991;&#31456;&#33021;&#28857;&#32512;&#20320;&#30340;&#38386;&#26247;&#12290;&#22914;&#26524;&#20877;&#33021;&#26377;&#19968;&#20123;&#20855;&#20307;&#30340;&#24110;&#21161;&#65292;&#37027;&#23601;&#26368;&#22909;&#19981;&#36807;&#20102;&#12290;</SPAN></P>
<P>&nbsp;</P>
<HR>

<P><SPAN style="FONT-FAMILY: 'courier new', courier">&nbsp;</SPAN></P>
<P><SPAN style="FONT-FAMILY: 'courier new', courier">&#19979;&#38754;&#26159;&#25105;&#22312;&#30693;&#20046;&#22238;&#31572;&#30340;&#19968;&#20010;&#24086;&#23376;&#8220;<A href="http://www.zhihu.com/question/20702054/answer/22886485?group_id=204761075">&#20320;&#26159;&#22914;&#20309;&#33258;&#23398;Python&#30340;</A>&#8221;&#65292;&#30053;&#20570;&#20462;&#25913;&#65292;&#20316;&#20026;&#24635;&#32467;&#65306;</SPAN></P>
<P>&nbsp;</P>
<P><SPAN style="FONT-FAMILY: 'courier new', courier">&#25105;&#26159;&#33258;&#23398;&#30340;Python&#12290;&#20174;&#23545;Python&#19968;&#26080;&#25152;&#30693;&#65292;&#21040;&#22312;&#21338;&#23458;&#19978;&#20889;Python&#30456;&#20851;&#30340;&#31995;&#21015;&#25991;&#31456;&#65292;&#26399;&#38388;&#26377;&#19981;&#23569;&#38376;&#27099;&#65292;&#20294;&#20063;&#20805;&#28385;&#20048;&#36259;&#12290;&#20048;&#36259;&#26159;&#33258;&#23398;&#30340;&#26368;&#22823;&#21160;&#21147;&#12290;Python&#26159;&#19968;&#20010;&#23481;&#26131;&#32534;&#20889;&#65292;&#21448;&#21151;&#33021;&#24378;&#22823;&#30340;&#21160;&#24577;&#35821;&#35328;&#12290;&#20351;&#29992;Python&#65292;&#21487;&#20197;&#22312;&#30701;&#30701;&#20960;&#34892;&#20869;&#23454;&#29616;&#30456;&#24403;&#24378;&#22823;&#30340;&#21151;&#33021;&#12290;&#36890;&#36807;&#33258;&#24049;&#20889;&#19968;&#20123;&#23567;&#31243;&#24207;&#65292;&#36805;&#36895;&#30340;&#30475;&#21040;&#25928;&#26524;&#65292;&#21457;&#29616;&#38382;&#39064;&#65292;&#36825;&#26159;&#23398;&#20064;Python&#26368;&#20415;&#21033;&#30340;&#22320;&#26041;&#12290;&#22312;&#12298;&#40657;&#23458;&#19982;&#30011;&#23478;&#12299;&#20013;&#65292;Paul&#20063;&#35828;&#65292;&#21160;&#24577;&#35821;&#35328;&#21487;&#20197;&#32473;Hacker&#20204;&#26356;&#22810;&#28034;&#28034;&#30011;&#30011;&#30340;&#24555;&#24863;&#12290;&#36825;&#28145;&#24471;&#25105;&#24515;&#12290;</SPAN><BR><BR><SPAN style="FONT-FAMILY: 'courier new', courier">&#22312;&#23398;&#20064;Python&#20043;&#21069;&#65292;&#21487;&#20197;&#20102;&#35299;&#19968;&#19979;Python&#30340;&#29305;&#28857;&#21644;&#35774;&#35745;&#29702;&#24565;(<A class=" wrap external" href="http://www.cnblogs.com/vamei/archive/2013/02/06/2892628.html" rel=nofollow target=_blank>Python&#31616;&#21490;</A>)&#12290;&#22312;&#35774;&#35745;&#20043;&#21021;&#65292;Python&#23601;&#35797;&#22270;&#22312;&#22797;&#26434;&#12289;&#24378;&#22823;&#30340;C&#21644;&#26041;&#20415;&#12289;&#21151;&#33021;&#26377;&#38480;&#30340;bash&#20043;&#38388;&#65292;&#25214;&#21040;&#19968;&#20010;&#24179;&#34913;&#28857;&#12290;Python&#30340;&#35821;&#27861;&#27604;&#36739;&#31616;&#21333;&#65292;&#29992;&#36215;&#26469;&#24456;&#26041;&#20415;&#65292;&#22240;&#27492;&#26377;&#20123;&#20154;&#25226;&#23427;&#24403;&#20316;&#33050;&#26412;&#35821;&#35328;&#20351;&#29992;&#12290;&#20294;Python&#35201;&#27604;&#26222;&#36890;&#30340;&#33050;&#26412;&#35821;&#35328;&#21151;&#33021;&#24378;&#22823;&#24456;&#22810;&#12290;&#36890;&#36807;&#33391;&#22909;&#30340;&#21487;&#25299;&#23637;&#24615;&#65292;Python&#30340;&#21151;&#33021;&#30456;&#24403;&#20840;&#38754;&#65292;&#24212;&#29992;&#38754;&#24456;&#24191;&#65306;web&#26381;&#21153;&#22120;&#65292;&#32593;&#32476;&#29228;&#34411;&#65292;&#31185;&#23398;&#36816;&#31639;&#65292;&#26426;&#22120;&#23398;&#20064;&#65292;&#28216;&#25103;&#24320;&#21457;&#8230;&#8230; &#24403;&#28982;&#65292;&#22825;&#19979;&#27809;&#26377;&#20813;&#36153;&#30340;&#21320;&#39184;&#65292;&#20063;&#27809;&#26377;&#23436;&#32654;&#30340;&#35821;&#35328;&#65292;Python&#20026;&#20102;&#36798;&#21040;&#19978;&#36848;&#20004;&#28857;&#65292;&#26377;&#24847;&#30340;&#29306;&#29298;&#20102;Python&#30340;&#36816;&#34892;&#36895;&#24230;&#12290;&#22914;&#26524;&#20320;&#26159;&#22312;&#32534;&#20889;&#39640;&#19994;&#21153;&#37327;&#12289;&#36816;&#31639;&#37327;&#30340;&#31243;&#24207;&#65292;&#21487;&#33021;Python&#24182;&#19981;&#26159;&#26368;&#22909;&#30340;&#36873;&#25321;&#12290;</SPAN><BR><BR><SPAN style="FONT-FAMILY: 'courier new', courier">-----</SPAN><BR><BR><SPAN style="FONT-FAMILY: 'courier new', courier">Python&#30340;&#20027;&#20307;&#20869;&#23481;&#22823;&#33268;&#21487;&#20197;&#20998;&#20026;&#20197;&#19979;&#20960;&#20010;&#37096;&#20998;&#65306;</SPAN></P>
<OL>
<LI><SPAN style="FONT-FAMILY: 'courier new', courier">&#38754;&#21521;&#36807;&#31243;&#12290;&#21253;&#25324;&#22522;&#26412;&#30340;&#34920;&#36798;&#24335;&#65292;if&#35821;&#21477;&#65292;&#24490;&#29615;&#65292;&#20989;&#25968;&#31561;&#12290;&#22914;&#26524;&#20320;&#26377;&#20219;&#20309;&#19968;&#20010;&#35821;&#35328;&#30340;&#22522;&#30784;&#65292;&#29305;&#21035;&#26159;C&#35821;&#35328;&#30340;&#22522;&#30784;&#65292;&#36825;&#19968;&#37096;&#20998;&#23601;&#26159;&#20998;&#20998;&#38047;&#20102;&#35299;&#19979;Python&#35268;&#23450;&#30340;&#20107;&#12290;&#22914;&#26524;&#20320;&#27809;&#26377;&#35821;&#35328;&#22522;&#30784;&#65292;&#24314;&#35758;&#29992;<A class=" wrap external" href="http://book.douban.com/subject/5407267/" rel=nofollow target=_blank>Python Programming</A>&#20026;&#21442;&#32771;&#20070;&#12290;&#36825;&#26412;&#20070;&#26159;&#35745;&#31639;&#26426;&#23548;&#35770;&#24615;&#36136;&#30340;&#25945;&#26448;&#65292;&#19981;&#38656;&#35201;&#32534;&#31243;&#22522;&#30784;&#12290;</SPAN></LI>
<LI><SPAN style="FONT-FAMILY: 'courier new', courier">&#38754;&#21521;&#23545;&#35937;&#65292;&#21253;&#25324;&#38754;&#21521;&#23545;&#35937;&#30340;&#22522;&#26412;&#27010;&#24565;&#65292;&#31867;&#65292;&#26041;&#27861;&#65292;&#23646;&#24615;&#65292;&#32487;&#25215;&#31561;&#12290;Python&#26159;&#38754;&#21521;&#23545;&#35937;&#30340;&#35821;&#35328;&#65292;&#8220;&#19968;&#20999;&#30342;&#23545;&#35937;&#8221;&#12290;&#38754;&#21521;&#23545;&#35937;&#26159;&#24456;&#38590;&#22238;&#36991;&#30340;&#12290;Python&#30340;&#38754;&#21521;&#23545;&#35937;&#26426;&#21046;&#26159;&#30456;&#23545;&#27604;&#36739;&#26494;&#25955;&#30340;&#65292;&#19981;&#20687;Java&#21644;C++&#37027;&#20040;&#20005;&#26684;&#12290;&#22909;&#22788;&#26159;&#23481;&#26131;&#23398;&#65292;&#23481;&#26131;&#32500;&#25252;&#65292;&#22351;&#22788;&#26159;&#23481;&#26131;&#29359;&#38169;&#12290;</SPAN></LI>
<LI><SPAN style="FONT-FAMILY: 'courier new', courier">&#24212;&#29992;&#21151;&#33021;&#65292;&#21253;&#25324;IO&#65292;&#25968;&#25454;&#23481;&#22120;&#22914;&#34920;&#21644;&#35789;&#20856;&#65292;&#20869;&#32622;&#20989;&#25968;&#65292;&#27169;&#22359;&#65292;&#26684;&#24335;&#21270;&#23383;&#31526;&#20018;&#31561;&#12290;&#36825;&#20123;&#22312;&#20854;&#23427;&#35821;&#35328;&#20013;&#20063;&#32463;&#24120;&#20986;&#29616;&#65292;&#26377;&#27604;&#36739;&#24378;&#30340;&#23454;&#29992;&#24615;&#12290;</SPAN></LI>
<LI><SPAN style="FONT-FAMILY: 'courier new', courier">&#39640;&#32423;&#35821;&#27861;&#65292;&#19978;&#19979;&#25991;&#31649;&#29702;&#22120;&#65292;&#21015;&#34920;&#25512;&#23548;&#65292;&#20989;&#25968;&#24335;&#32534;&#31243;&#65292;&#35013;&#39280;&#22120;&#65292;&#29305;&#27530;&#26041;&#27861;&#31561;&#12290;&#36825;&#20123;&#35821;&#27861;&#24182;&#19981;&#26159;&#24517;&#39035;&#30340;&#65292;&#20320;&#21487;&#20197;&#29992;&#21069;&#38754;&#27604;&#36739;&#22522;&#30784;&#30340;&#35821;&#27861;&#23454;&#29616;&#12290;&#23398;&#36825;&#20123;&#39640;&#32423;&#35821;&#27861;&#30340;&#20027;&#35201;&#21407;&#22240;&#26159;&#65306;&#23427;&#20204;&#22826;&#26041;&#20415;&#20102;&#12290;&#27604;&#22914;&#21015;&#34920;&#25512;&#23548;&#19968;&#34892;&#21487;&#20197;&#20570;&#21040;&#30340;&#20107;&#24773;&#65292;&#29992;&#24490;&#29615;&#32467;&#26500;&#35201;&#22909;&#20960;&#34892;&#25165;&#34892;&#12290;</SPAN></LI></OL>
<P><BR><SPAN style="FONT-FAMILY: 'courier new', courier">&#23398;&#20064;Python&#20027;&#20307;&#26368;&#22909;&#30340;&#21442;&#32771;&#20070;&#26159;<A class=" wrap external" href="http://book.douban.com/subject/3988517/" rel=nofollow target=_blank>Learning Python</A>&#65292;&#23427;&#38750;&#24120;&#20840;&#38754;&#65292;&#28385;&#28385;&#30340;&#37117;&#26159;&#24178;&#36135;&#12290;&#34429;&#28982;&#24456;&#21402;&#65292;&#35835;&#36215;&#26469;&#24182;&#19981;&#38590;&#35835;&#12290;&#21478;&#19968;&#20010;&#26159;&#21442;&#32771;&#23448;&#32593;&#30340;&#25945;&#31243;<A class=" wrap external" href="http://python.org/" rel=nofollow target=_blank>Python.org</A></SPAN><BR><BR><SPAN style="FONT-FAMILY: 'courier new', courier">Python&#21495;&#31216;&#8220;Battery Included"&#65292;&#20063;&#23601;&#26159;&#35828;&#65292;&#21151;&#33021;&#37117;&#24050;&#32463;&#21253;&#21547;&#22312;&#20102;&#35821;&#35328;&#20013;&#12290;&#36825;&#19968;&#33258;&#20449;&#65292;&#20027;&#35201;&#26469;&#33258;Python&#21151;&#33021;&#20840;&#38754;&#30340;&#26631;&#20934;&#24211;&#12290;&#26631;&#20934;&#24211;&#25552;&#20379;&#20102;&#35768;&#22810;&#21151;&#33021;&#27169;&#22359;&#65292;&#27599;&#20010;&#27169;&#22359;&#26159;&#26576;&#19968;&#26041;&#38754;&#21151;&#33021;&#30340;&#25509;&#21475;&#65292;&#27604;&#22914;&#25991;&#20214;&#31649;&#29702;&#65292;&#25805;&#20316;&#31995;&#32479;&#20114;&#21160;&#65292;&#23383;&#31526;&#22788;&#29702;&#65292;&#32593;&#32476;&#25509;&#21475;&#65292;&#32534;&#30721;&#21152;&#23494;&#31561;&#31561;&#12290;</SPAN><BR><BR><SPAN style="FONT-FAMILY: 'courier new', courier"><A class=" wrap external" href="http://docs.python.org/2/library/" rel=nofollow target=_blank>The Python Standard Library</A>&#20013;&#65292;&#20320;&#21487;&#20197;&#30475;&#21040;&#26631;&#20934;&#24211;&#27169;&#22359;&#30340;&#21015;&#34920;&#12290;&#36825;&#37324;&#20063;&#26159;&#26631;&#20934;&#24211;&#26368;&#22909;&#30340;&#23398;&#20064;&#36164;&#26009;&#12290;&#22914;&#26524;&#24819;&#25214;&#20070;&#65292;&#25105;&#21482;&#30475;&#21040;&#36807;&#20004;&#26412;&#20851;&#20110;&#26631;&#20934;&#24211;&#30340;&#65306;</SPAN><BR><SPAN style="FONT-FAMILY: 'courier new', courier"><A class=" wrap external" href="http://book.douban.com/subject/3273420/" rel=nofollow target=_blank>Python Essential Reference</A></SPAN><BR><SPAN style="FONT-FAMILY: 'courier new', courier"><A class=" wrap external" href="http://book.douban.com/subject/6540551/" rel=nofollow target=_blank>The Python Standard Library by Example</A></SPAN><BR><BR><SPAN style="FONT-FAMILY: 'courier new', courier">&#35828;&#23454;&#35805;&#65292;&#36825;&#20004;&#26412;&#37117;&#19981;&#31639;&#24456;&#22909;&#30340;&#26631;&#20934;&#24211;&#25945;&#26448;&#65292;&#32780;&#26631;&#20934;&#24211;&#30340;&#21442;&#32771;&#20070;&#20063;&#30830;&#23454;&#24456;&#38590;&#20889;&#12290;&#22240;&#20026;&#26631;&#20934;&#24211;&#21482;&#26159;&#35843;&#29992;&#21151;&#33021;&#30340;&#25509;&#21475;&#65292;&#26368;&#32456;&#23454;&#29616;&#30340;&#26159;Python&#21644;&#31995;&#32479;&#30340;&#20114;&#21160;&#12290;&#36825;&#38656;&#35201;&#24456;&#24378;&#30340;&#31995;&#32479;&#30693;&#35782;&#65292;&#27604;&#22914;&#25991;&#20214;&#31995;&#32479;&#30693;&#35782;&#65292;&#36827;&#31243;&#31649;&#29702;&#65292;http&#21407;&#29702;&#65292;socket&#32534;&#31243;&#65292;&#25968;&#25454;&#24211;&#21407;&#29702;&#8230;&#8230; &#22914;&#26524;&#36825;&#20123;&#30693;&#35782;&#37117;&#24050;&#32463;&#20934;&#22791;&#20805;&#20998;&#65292;&#37027;&#20040;&#26631;&#20934;&#24211;&#23398;&#36215;&#26469;&#23436;&#20840;&#27809;&#26377;&#38590;&#24230;&#12290;&#28982;&#32780;&#65292;&#36825;&#20123;&#32972;&#26223;&#30693;&#35782;&#30340;&#23398;&#20064;&#26354;&#32447;&#65292;&#35201;&#36828;&#36828;&#38497;&#36807;Python&#26412;&#36523;&#12290;</SPAN><BR><BR><SPAN style="FONT-FAMILY: 'courier new', courier">&#26356;&#28145;&#20837;&#30340;Python&#23398;&#20064;&#20063;&#26159;&#22914;&#27492;&#65292;&#38656;&#35201;&#22823;&#37327;&#30340;&#32972;&#26223;&#30693;&#35782;&#65292;&#32780;&#19981;&#27490;&#26159;Python&#33258;&#36523;&#12290;&#22914;&#26524;&#20320;&#23545;Python&#30340;&#25299;&#23637;&#24615;&#24863;&#20852;&#36259;&#65292;&#21487;&#20197;&#22810;&#22810;&#23581;&#35797;&#28151;&#21512;&#32534;&#31243;&#12290;&#22914;&#26524;&#20320;&#23545;Python&#30340;&#32534;&#35793;&#21644;&#36816;&#34892;&#26426;&#21046;&#24863;&#20852;&#36259;&#65292;&#20320;&#21487;&#20197;&#24448;Python&#24213;&#23618;&#36825;&#19968;&#28145;&#24230;&#25366;&#65292;&#30475;&#30475;&#32534;&#35793;&#22120;&#26159;&#24590;&#20040;&#20570;&#30340;&#12290;&#22914;&#26524;&#20320;&#23545;&#24212;&#29992;&#24863;&#20852;&#36259;&#65292;&#20320;&#21487;&#20197;&#22810;&#23398;&#20064;&#20960;&#20010;&#33258;&#24049;&#29992;&#30340;&#19978;&#30340;&#31532;&#19977;&#26041;&#21253;&#12290;&#23398;&#21040;&#36825;&#20010;&#26102;&#20505;&#65292;&#25340;&#30340;&#26159;&#22659;&#30028;&#65292;&#20063;&#27809;&#26377;&#20160;&#20040;&#23450;&#27861;&#12290;&#24191;&#38420;&#31354;&#38388;&#65292;&#30041;&#24453;&#25506;&#32034;&#12290;</SPAN><BR><BR><SPAN style="FONT-FAMILY: 'courier new', courier">&#22522;&#26412;&#19978;&#65292;&#23398;&#36807;&#20027;&#20307;&#20869;&#23481;&#20043;&#21518;&#65292;Python&#36824;&#26159;&#35201;&#38752;&#20570;&#39033;&#30446;&#26469;&#32451;&#20064;&#12290;&#26377;&#19981;&#23569;&#23567;&#32451;&#20064;&#39064;&#31867;&#22411;&#30340;&#36164;&#26009;&#65292;&#27604;&#22914;<A class=" wrap external" href="http://book.douban.com/subject/1418172/" rel=nofollow target=_blank>Python Cookbook</A>&#12290;&#20294;&#26356;&#22909;&#30340;&#26041;&#24335;&#26159;&#33258;&#24049;&#21435;&#24819;&#19968;&#20123;&#24212;&#29992;&#22330;&#26223;&#65292;&#29992;Python&#26469;&#35299;&#20915;&#12290;&#27604;&#22914;&#65306;</SPAN></P>
<UL>
<LI><SPAN style="FONT-FAMILY: 'courier new', courier">&#24314;&#35774;&#19968;&#20010;&#32593;&#31449;</SPAN></LI>
<LI><SPAN style="FONT-FAMILY: 'courier new', courier">&#20570;&#19968;&#20010;&#32593;&#39029;&#29228;&#34411;</SPAN></LI>
<LI><SPAN style="FONT-FAMILY: 'courier new', courier">&#31995;&#32479;&#31649;&#29702;</SPAN></LI></UL>
<P><SPAN style="FONT-FAMILY: 'courier new', courier">Python&#21151;&#33021;&#20840;&#38754;&#65292;&#25152;&#20197;&#19981;&#35201;&#25285;&#24515;&#33258;&#24049;&#24819;&#30340;&#38382;&#39064;Python&#35299;&#20915;&#19981;&#20102; (&#22522;&#26412;&#19978;Python&#35299;&#20915;&#19981;&#20102;&#30340;&#38382;&#39064;&#65292;&#21035;&#30340;&#35821;&#35328;&#20063;&#27809;&#25103;)&#12290;&#27604;&#22914;&#25105;&#23398;&#20064;&#22810;&#32447;&#31243;&#30340;&#21160;&#21147;&#65292;&#23601;&#22240;&#20026;&#35201;&#24182;&#34892;&#30340;&#19979;&#36733;&#22823;&#37327;&#30340;&#25991;&#20214;&#12290;&#22522;&#26412;&#19978;&#19968;&#20010;&#39033;&#30446;&#19979;&#26469;&#65292;&#20250;&#29992;&#21040;Python&#22909;&#20960;&#22359;&#30340;&#20869;&#23481;&#65292;&#30693;&#35782;&#20250;&#29305;&#21035;&#24041;&#22266;&#12290;</SPAN><BR><BR><SPAN style="FONT-FAMILY: 'courier new', courier">&#26368;&#21518;&#65292;&#21644;&#20854;&#23427;&#20219;&#20309;&#30693;&#35782;&#30340;&#23398;&#20064;&#19968;&#26679;&#65292;&#31508;&#35760;&#21644;&#24635;&#32467;&#24456;&#37325;&#35201;&#12290;&#22312;&#30475;&#21442;&#32771;&#20070;&#21644;&#30475;&#32593;&#39029;&#26102;&#65292;&#21487;&#20197;&#20570;&#19968;&#20123;&#31508;&#35760;&#12290;&#31561;&#21040;&#23398;&#20102;&#19968;&#27573;&#26102;&#38388;&#21518;&#65292;&#21487;&#20197;&#25226;&#31508;&#35760;&#25972;&#29702;&#25104;&#26356;&#26377;&#26465;&#29702;&#30340;&#21442;&#32771;&#21345;&#29255;(reference card)&#65292;&#25110;&#32773;&#20889;&#21338;&#23458;&#12290;</SPAN></P>
<P>&nbsp;</P>
<P>&#38271;&#36335;&#28459;&#28459;&#65292;&#19982;&#35832;&#21531;&#20849;&#21193;&#12290;</P></DIV></DIV>